<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FaqsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::statement('SET FOREIGN_KEY_CHECKS=0;');
        DB::table('faqs')->truncate();

        $data = [
            [
                'id' => 258,
                'question' => 'كيف أستخدم مركز التكلفة بشكل فعال؟',
                'answer' => 'يمكنك استخدام مركز التكلفة من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 259,
                'question' => 'ما الفائدة من استخدام مركز التكلفة؟',
                'answer' => 'يساعد مركز التكلفة في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 260,
                'question' => 'أين يمكنني العثور على إعدادات مركز التكلفة؟',
                'answer' => 'تجد إعدادات مركز التكلفة ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 261,
                'question' => 'هل يمكن تخصيص مركز التكلفة حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص مركز التكلفة من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 262,
                'question' => 'ما هو ميزان المراجعة في نظام ERP؟',
                'answer' => 'ميزان المراجعة هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ ميزان المراجعة بطريقة منظمة وآلية.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 263,
                'question' => 'كيف أستخدم ميزان المراجعة بشكل فعال؟',
                'answer' => 'يمكنك استخدام ميزان المراجعة من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 264,
                'question' => 'ما الفائدة من استخدام ميزان المراجعة؟',
                'answer' => 'يساعد ميزان المراجعة في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 265,
                'question' => 'أين يمكنني العثور على إعدادات ميزان المراجعة؟',
                'answer' => 'تجد إعدادات ميزان المراجعة ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 266,
                'question' => 'هل يمكن تخصيص ميزان المراجعة حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص ميزان المراجعة من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 267,
                'question' => 'ما هو نظام إدارة المهام والمشاريع في نظام ERP؟',
                'answer' => 'نظام إدارة المهام والمشاريع هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام إدارة المهام والمشاريع بطريقة منظمة وآلية.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 268,
                'question' => 'كيف أستخدم نظام إدارة المهام والمشاريع بشكل فعال؟',
                'answer' => 'يمكنك استخدام نظام إدارة المهام والمشاريع من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 269,
                'question' => 'ما الفائدة من استخدام نظام إدارة المهام والمشاريع؟',
                'answer' => 'يساعد نظام إدارة المهام والمشاريع في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 270,
                'question' => 'أين يمكنني العثور على إعدادات نظام إدارة المهام والمشاريع؟',
                'answer' => 'تجد إعدادات نظام إدارة المهام والمشاريع ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 271,
                'question' => 'هل يمكن تخصيص نظام إدارة المهام والمشاريع حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص نظام إدارة المهام والمشاريع من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 272,
                'question' => 'ما هو نظام الاقساط في نظام ERP؟',
                'answer' => 'نظام الاقساط هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام الاقساط بطريقة منظمة وآلية.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 273,
                'question' => 'كيف أستخدم نظام الاقساط بشكل فعال؟',
                'answer' => 'يمكنك استخدام نظام الاقساط من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 274,
                'question' => 'ما الفائدة من استخدام نظام الاقساط؟',
                'answer' => 'يساعد نظام الاقساط في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 275,
                'question' => 'أين يمكنني العثور على إعدادات نظام الاقساط؟',
                'answer' => 'تجد إعدادات نظام الاقساط ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 276,
                'question' => 'هل يمكن تخصيص نظام الاقساط حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص نظام الاقساط من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 277,
                'question' => 'ما هو نظام المبيعات في نظام ERP؟',
                'answer' => 'نظام المبيعات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام المبيعات بطريقة منظمة وآلية.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 278,
                'question' => 'كيف أستخدم نظام المبيعات بشكل فعال؟',
                'answer' => 'يمكنك استخدام نظام المبيعات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 279,
                'question' => 'ما الفائدة من استخدام نظام المبيعات؟',
                'answer' => 'يساعد نظام المبيعات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 280,
                'question' => 'أين يمكنني العثور على إعدادات نظام المبيعات؟',
                'answer' => 'تجد إعدادات نظام المبيعات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 281,
                'question' => 'هل يمكن تخصيص نظام المبيعات حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص نظام المبيعات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 282,
                'question' => 'ما هو نظام المخزون في نظام ERP؟',
                'answer' => 'نظام المخزون هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام المخزون بطريقة منظمة وآلية.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 283,
                'question' => 'كيف أستخدم نظام المخزون بشكل فعال؟',
                'answer' => 'يمكنك استخدام نظام المخزون من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 284,
                'question' => 'ما الفائدة من استخدام نظام المخزون؟',
                'answer' => 'يساعد نظام المخزون في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 285,
                'question' => 'أين يمكنني العثور على إعدادات نظام المخزون؟',
                'answer' => 'تجد إعدادات نظام المخزون ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 286,
                'question' => 'هل يمكن تخصيص نظام المخزون حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص نظام المخزون من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 287,
                'question' => 'ما هو نظام المشتريات في نظام ERP؟',
                'answer' => 'نظام المشتريات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام المشتريات بطريقة منظمة وآلية.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 288,
                'question' => 'كيف أستخدم نظام المشتريات بشكل فعال؟',
                'answer' => 'يمكنك استخدام نظام المشتريات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 289,
                'question' => 'ما الفائدة من استخدام نظام المشتريات؟',
                'answer' => 'يساعد نظام المشتريات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 290,
                'question' => 'أين يمكنني العثور على إعدادات نظام المشتريات؟',
                'answer' => 'تجد إعدادات نظام المشتريات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 291,
                'question' => 'هل يمكن تخصيص نظام المشتريات حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص نظام المشتريات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 292,
                'question' => 'ما هو نظام شؤون الموظفين HR في نظام ERP؟',
                'answer' => 'نظام شؤون الموظفين HR هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام شؤون الموظفين HR بطريقة منظمة وآلية.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 293,
                'question' => 'كيف أستخدم نظام شؤون الموظفين HR بشكل فعال؟',
                'answer' => 'يمكنك استخدام نظام شؤون الموظفين HR من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 294,
                'question' => 'ما الفائدة من استخدام نظام شؤون الموظفين HR؟',
                'answer' => 'يساعد نظام شؤون الموظفين HR في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 295,
                'question' => 'أين يمكنني العثور على إعدادات نظام شؤون الموظفين HR؟',
                'answer' => 'تجد إعدادات نظام شؤون الموظفين HR ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => 296,
                'question' => 'هل يمكن تخصيص نظام شؤون الموظفين HR حسب احتياجاتي؟',
                'answer' => 'نعم، يتيح النظام إمكانية تخصيص نظام شؤون الموظفين HR من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.',
                'created_at' => '2025-04-23 11:34:07',
                'updated_at' => '2025-04-23 11:34:07',
            ],
            [
                'id' => '`id` bigint(20',
            ],
            [
                'id' => 20,
            ],
            [
                'id' => 20,
            ],
            [
                'id' => 20,
            ],
            [
                'id' => 20,
            ],
            [
                'id' => 20,
            ],
            [
                'id' => 'scheduled',
                'question' => 'done',
                'answer' => 'skipped',
                'created_at' => 'lost',
            ],
            [
                'id' => 255,
            ],
        ];

        foreach ($data as $row) {
            DB::table('faqs')->insert($row);
        }

        DB::statement('SET FOREIGN_KEY_CHECKS=1;');
    }
}
