-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Dec 29, 2025 at 09:33 PM
-- Server version: 11.8.3-MariaDB-log
-- PHP Version: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `u414283222_crm`
--

-- --------------------------------------------------------

--
-- Table structure for table `accounts`
--

CREATE TABLE `accounts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `storage_id` bigint(20) UNSIGNED DEFAULT NULL,
  `account` varchar(255) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `balance` double DEFAULT 0,
  `account_number` varchar(255) NOT NULL,
  `total_in` double DEFAULT 0,
  `total_out` double DEFAULT 0,
  `type` int(11) NOT NULL DEFAULT 0,
  `account_type` enum('asset','liability','equity','revenue','expense','other') NOT NULL,
  `code` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `parent_id` bigint(20) DEFAULT NULL,
  `default_cost_center_id` bigint(20) UNSIGNED DEFAULT NULL,
  `cost_center` varchar(20) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `accounts`
--

INSERT INTO `accounts` (`id`, `storage_id`, `account`, `description`, `balance`, `account_number`, `total_in`, `total_out`, `type`, `account_type`, `code`, `created_at`, `updated_at`, `deleted_at`, `company_id`, `parent_id`, `default_cost_center_id`, `cost_center`) VALUES
(1, NULL, 'أصول متداولة', 'أصول متداولة', 0, '', 0, 0, 0, 'asset', 11, '2025-03-03 18:51:51', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(4, NULL, 'اصول غير متداولة.', 'اصول غير متداولة.', 0, '10102', 0, 0, 0, 'asset', 12, '2025-03-03 21:35:31', '2025-09-11 15:25:14', NULL, 1, NULL, NULL, '0'),
(8, NULL, 'الصناديق', 'الصناديق', 0, '101', 0, 0, 0, 'asset', 111, '2025-03-03 22:44:27', '2025-08-14 17:58:34', NULL, 1, 1, NULL, '0'),
(14, NULL, 'البنوك', 'البنوك', 0, '1012', 0, 0, 0, 'asset', 112, '2025-03-03 22:49:43', '2025-08-14 17:58:34', NULL, 1, 1, NULL, '0'),
(15, NULL, 'العملاء', 'العملاء', 0, '1014', 0, 0, 1, 'asset', 113, '2025-03-03 22:50:15', '2025-08-14 17:58:34', NULL, 1, 1, NULL, '0'),
(16, NULL, 'المخزون', 'المخزون', 0, '1015', 0, 0, 1, 'asset', 114, '2025-03-03 22:50:39', '2025-08-14 17:58:34', NULL, 1, 1, NULL, '0'),
(17, NULL, 'العهد', 'العهد', 0, '1016', 0, 0, 1, 'asset', 115, '2025-03-03 22:51:03', '2025-09-14 13:56:38', NULL, 1, 1, NULL, '0'),
(18, NULL, 'الممتلكات والمعدات', 'الممتلكات والمعدات', 0, '10156', 0, 0, 1, 'asset', 121, '2025-03-03 22:51:34', '2025-08-14 17:58:34', NULL, 1, 4, NULL, '0'),
(19, NULL, 'الأراضي', 'الأراضي', 0, '10564', 0, 0, 1, 'asset', 122, '2025-03-03 22:51:53', '2025-08-14 17:58:34', NULL, 1, 4, NULL, '0'),
(20, NULL, 'المباني', 'المباني', 0, '8467', 0, 0, 1, 'asset', 123, '2025-03-03 22:52:14', '2025-08-14 17:58:34', NULL, 1, 4, NULL, '0'),
(21, NULL, 'السيارات', 'السيارات', 0, '1685', 0, 0, 1, 'asset', 124, '2025-03-03 22:52:34', '2025-08-14 17:58:34', NULL, 1, 4, NULL, '0'),
(22, NULL, 'الآلات والاجهزة', 'الآلات والاجهزة', 0, '6994', 0, 0, 1, 'asset', 125, '2025-03-03 22:52:57', '2025-08-14 17:58:34', NULL, 1, 4, NULL, '0'),
(24, NULL, 'الالتزامات المتداولة', 'الالتزامات المتداولة', 0, '25497', 0, 0, 0, 'liability', 21, '2025-03-03 22:53:51', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(25, NULL, 'الالتزامات غير المتداولة', 'الالتزامات غير المتداولة', 0, '647', 0, 0, 0, 'liability', 22, '2025-03-03 22:54:17', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(26, NULL, 'الدائنون', 'دائنون', 0, '254484', 0, 0, 1, 'liability', 211, '2025-03-03 22:54:43', '2025-08-14 17:58:34', NULL, 1, 24, NULL, '0'),
(28, NULL, 'ذمم دائنة اخرى', 'ذمم دائنة اخرى', 0, '51151', 0, 0, 1, 'liability', 212, '2025-03-03 22:55:45', '2025-08-14 17:58:34', NULL, 1, 24, NULL, '0'),
(29, NULL, 'الرواتب المستحقة', 'الرواتب المستحقة', 0, '466479', 0, 0, 1, 'liability', 213, '2025-03-03 22:56:16', '2025-08-14 17:58:34', NULL, 1, 24, NULL, '0'),
(30, NULL, 'مصروفات مستحقة', 'مصروفات مستحقة', 0, '661313', 0, 0, 1, 'liability', 214, '2025-03-03 22:56:39', '2025-08-14 17:58:34', NULL, 1, 24, NULL, '0'),
(31, NULL, 'اطراف ذات علاقة', 'اطراف ذات علاقة', 0, '32316', 0, 0, 1, 'liability', 215, '2025-03-03 22:57:03', '2025-08-14 17:58:34', NULL, 1, 24, NULL, '0'),
(32, NULL, 'القروض طويلة الأجل', 'القروض طويلة الأجل', 0, '15448', 0, 0, 1, 'liability', 221, '2025-03-03 22:57:34', '2025-08-14 17:58:34', NULL, 1, 25, NULL, '0'),
(33, NULL, 'مجمع الإهلاكات', 'مجمع الإهلاكات', 0, '215464', 0, 0, 1, 'liability', 222, '2025-03-03 22:57:56', '2025-08-14 17:58:34', NULL, 1, 25, NULL, '0'),
(34, NULL, 'المخصصات', 'المخصصات', 0, '664984', 0, 0, 1, 'liability', 223, '2025-03-03 22:58:14', '2025-08-14 17:58:34', NULL, 1, 25, NULL, '0'),
(35, NULL, 'رأس المال', 'رأس المال', 0, '212121', 0, 0, 0, 'equity', 31, '2025-03-03 22:58:45', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(37, NULL, 'جارى الشركاء', 'جارى الشركاء', 0, '65959', 0, 0, 0, 'equity', 32, '2025-03-03 22:59:36', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(39, NULL, 'احتياطيات', 'احتياطيات', 0, '6595989', 0, 0, 0, 'equity', 33, '2025-03-03 23:00:09', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(40, NULL, 'الايرادات', 'الايرادات', 0, '9559797', 0, 0, 0, 'revenue', 41, '2025-03-03 23:00:32', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(44, NULL, 'المصروفات..', 'المصروفات..', 0, '569', 0, 0, 0, 'expense', 51, '2025-03-03 23:01:58', '2025-08-14 17:58:34', NULL, 1, NULL, NULL, '0'),
(59, NULL, 'اخري', 'اخري', 0, '5555', 0.1, 0.1, 0, 'other', 601, '2025-03-05 01:44:42', '2025-09-12 14:24:05', NULL, 1, NULL, NULL, '0'),
(64, NULL, 'سلف موظفين', 'سلف موظفين', 0, '10108', 0, 0, 1, 'asset', 116, '2025-03-13 21:55:35', '2025-08-14 17:58:34', NULL, 1, 1, NULL, '0'),
(74, NULL, 'مخزون فرع الرئيسي', 'مخزون فرع الرئيسي', 0, '1010402', 0, 0, 1, 'asset', 1141, '2025-03-18 21:07:35', '2025-08-14 17:58:34', NULL, 1, 16, NULL, '0'),
(76, NULL, 'السلف', 'السلف', 0, '101080', 0, 0, 1, 'asset', 117, '2025-04-03 06:24:08', '2025-08-14 17:58:34', NULL, 1, 1, NULL, '0'),
(84, NULL, 'حساب تسوية بيع الاصول الثابتة', 'حساب تسوية بيع الاصول الثابتة', 0, '60102', 0, 0, 1, 'other', 60102, '2025-04-14 05:43:38', '2025-08-09 23:01:48', NULL, 1, 59, NULL, '0'),
(88, NULL, 'حسابات دائنة متنوعة', 'حسابات دائنة متنوعة', 0, '20106', 0, 0, 1, 'liability', 216, '2025-04-15 16:50:19', '2025-08-14 17:58:34', NULL, 1, 24, NULL, '0'),
(92, NULL, 'ذمم مدينة اخرى', 'ذمم مدينة اخرى', 0, '10109', 0, 0, 1, 'asset', 118, '2025-04-19 03:59:33', '2025-08-14 17:58:34', NULL, 1, 1, NULL, '0'),
(101, NULL, 'مخزون قيد الأنتاج', 'مخزون قيد الأنتاج', 0, '1010403', 0, 0, 0, 'asset', 1142, '2025-05-13 05:06:04', '2025-08-14 17:58:34', NULL, 1, 16, NULL, '0'),
(103, NULL, 'حساب تسوية مرتبات', 'حساب لتسوية المرتبات', 0, '8203', 0, 0, 0, 'other', 602, '2025-05-10 02:36:58', '2025-05-10 02:36:58', NULL, 1, NULL, NULL, '0'),
(120, NULL, 'الصندوق', 'الصندوق', 0, '', 0, 0, 0, 'asset', 1111, '2025-07-31 00:52:46', '2025-08-14 18:36:02', NULL, 1, 8, NULL, '0'),
(138, NULL, 'صندوق المكتب الرئيسي', 'صندوق المكتب الرئيسي', 0, '1', 0, 0, 0, 'asset', 11110001, '2025-08-13 17:06:27', '2025-08-14 17:58:34', NULL, 1, 120, NULL, '0'),
(139, NULL, 'صندوق عرعر', 'صندوق عرعر', 0, '2', 0, 0, 0, 'asset', 11110002, '2025-08-13 17:08:45', '2025-08-14 17:58:34', NULL, 1, 120, NULL, '0'),
(140, NULL, 'صندوق حفرالباطن', 'صندوق حفرالباطن', 0, '3', 0, 0, 0, 'asset', 11110003, '2025-08-13 17:10:16', '2025-08-14 17:58:34', NULL, 1, 120, NULL, '0'),
(141, NULL, 'البنوك', 'البنوك', 0, '', 0, 0, 0, 'asset', 1121, '2025-08-13 17:15:45', '2025-08-14 18:36:29', NULL, 1, 14, NULL, '0'),
(142, NULL, 'ايرادات النشاط', 'ايرادات النشاط', 0, '77', 0, 0, 0, 'revenue', 411, '2025-08-13 18:09:42', '2025-08-14 17:58:34', NULL, 1, 40, NULL, '0'),
(144, NULL, 'ايرادات متنوعة', 'ايرادات متنوعة', 0, '777', 0, 0, 0, 'revenue', 412, '2025-08-13 18:11:08', '2025-08-14 17:58:34', NULL, 1, 40, NULL, '0'),
(145, NULL, 'مصاريف التشغيل', 'مصاريف التشغيل', 0, '9999', 0, 0, 0, 'expense', 511, '2025-08-13 18:35:12', '2025-08-14 17:58:34', NULL, 1, 44, NULL, '0'),
(146, NULL, 'المصاريف الادارية', 'المصاريف الادارية', 0, '8888', 0, 0, 0, 'expense', 512, '2025-08-13 18:35:44', '2025-08-14 17:58:34', NULL, 1, 44, NULL, '0'),
(147, NULL, 'تكلفة البضاعة المباعة', 'تكلفة البضاعة المباعة', 0, '999', 0, 0, 0, 'expense', 513, '2025-08-13 18:36:09', '2025-08-14 17:58:34', NULL, 1, 44, NULL, '0'),
(148, NULL, 'مصروفات الاهلاك', 'مصروفات الاهلاك', 0, '7788', 0, 0, 0, 'expense', 514, '2025-08-13 18:36:29', '2025-08-14 17:58:34', NULL, 1, 44, NULL, '0'),
(149, NULL, 'مصروفات متنوعة', 'مصروفات متنوعة', 0, '88889', 0, 0, 0, 'expense', 515, '2025-08-13 18:36:49', '2025-08-14 17:58:34', NULL, 1, 44, NULL, '0'),
(151, NULL, 'بنك الراجحى', 'بنك الراجحى', 107915.35, '11210001', 948018.27, 840102.92, 0, 'asset', 11210001, '2025-08-14 18:36:51', '2025-11-12 17:10:14', NULL, 1, 141, NULL, '0'),
(153, NULL, 'حساب مخزون: فرع حفر الباطن', 'حساب مخزون: فرع حفر الباطن', 0, '1143', 0, 0, 0, 'asset', 1143, '2025-09-09 17:24:13', '2025-09-09 17:24:13', NULL, 1, 16, NULL, '0'),
(154, NULL, 'حساب مخزون: فرع عرعر', 'حساب مخزون: فرع عرعر', 0, '1144', 0, 0, 0, 'asset', 1144, '2025-09-09 17:26:39', '2025-09-09 17:26:39', NULL, 1, 16, NULL, '0'),
(155, NULL, 'مصرف الانماء', 'مصرف الانماء', 122770.8, '11210002', 122770.8, 0, 0, 'asset', 11210002, '2025-09-11 14:22:39', '2025-11-12 16:10:48', NULL, 1, 141, NULL, '0'),
(158, NULL, 'الايرادات', 'الايرادات', 0, '', 0, 0, 0, 'revenue', 4111, '2025-09-11 14:31:31', '2025-09-11 14:53:37', NULL, 1, 142, NULL, '1'),
(162, NULL, 'عملاء الاستقدام', 'عملاء الاستقدام', 0, '1130001', 0, 0, 0, 'asset', 1131, '2025-09-11 14:43:48', '2025-09-11 14:53:37', NULL, 1, 15, NULL, '0'),
(164, NULL, 'عملاء التاجير', 'عملاء التاجير', 0, '1130002', 0, 0, 0, 'asset', 1132, '2025-09-11 14:44:51', '2025-09-11 14:53:37', NULL, 1, 15, NULL, '0'),
(165, NULL, 'عملاء التفاويض الرجالية', 'عملاء التفاويض الرجالية', 0, '1130003', 0, 0, 0, 'asset', 1133, '2025-09-11 14:45:19', '2025-09-11 14:53:37', NULL, 1, 15, NULL, '0'),
(166, NULL, 'المصروفات التشغيلية', 'المصروفات التشغيلية', 0, '', 0, 0, 0, 'expense', 5111, '2025-09-11 14:45:43', '2025-09-11 14:57:29', NULL, 1, 145, NULL, '1'),
(171, NULL, 'ايرادات الاستقدام', 'ايرادات الاستقدام', 0, '41110001', 0, 0, 0, 'revenue', 41110001, '2025-09-11 14:54:07', '2025-09-11 14:54:07', NULL, 1, 158, NULL, '1'),
(172, NULL, 'ايراد التاجير', 'ايراد التاجير', 0, '41110002', 0, 0, 0, 'revenue', 41110002, '2025-09-11 14:54:54', '2025-09-11 14:54:54', NULL, 1, 158, NULL, '1'),
(173, NULL, 'ايرادات التفاويض الرجالية', 'ايرادات التفاويض الرجالية', 0, '41110003', 0, 0, 0, 'revenue', 41110003, '2025-09-11 14:55:14', '2025-09-11 14:55:14', NULL, 1, 158, NULL, '1'),
(174, NULL, 'ايرادات نقل كفالة', 'ايرادات نقل كفالة', 0, '41110004', 0, 0, 0, 'revenue', 41110004, '2025-09-11 14:55:26', '2025-09-11 14:55:26', NULL, 1, 158, NULL, '1'),
(175, NULL, 'ايردات اخرى', 'ايردات اخرى', 0, '', 0, 0, 0, 'revenue', 4121, '2025-09-11 14:56:07', '2025-09-11 14:56:34', NULL, 1, 144, NULL, '1'),
(176, NULL, 'تكاليف الاستقدام', 'تكاليف الاستقدام', 238380.97, '51110001', 238380.97, 0, 0, 'expense', 51110001, '2025-09-11 14:58:01', '2025-11-12 17:10:14', NULL, 1, 166, NULL, '1'),
(177, NULL, 'مصاريف العقود المباشرة', 'مصاريف العقود المباشرة', 0, '51110002', 0, 0, 0, 'expense', 51110002, '2025-09-11 14:58:24', '2025-09-11 14:58:24', NULL, 1, 166, NULL, '1'),
(178, NULL, 'مصروف المراجعات', 'مصروف المراجعات', 0, '51110003', 0, 0, 0, 'expense', 51110003, '2025-09-11 14:58:36', '2025-09-11 14:58:36', NULL, 1, 166, NULL, '1'),
(179, NULL, 'فحص طبى الاستقدام', 'فحص طبى الاستقدام', 180, '51110004', 180, 0, 0, 'expense', 51110004, '2025-09-11 14:58:56', '2025-11-12 06:26:55', NULL, 1, 166, NULL, '1'),
(180, NULL, 'تامين طبى الاستقدام', 'تامين طبى الاستقدام', 0, '51110005', 0, 0, 0, 'expense', 51110005, '2025-09-11 14:59:08', '2025-09-11 14:59:08', NULL, 1, 166, NULL, '1'),
(181, NULL, 'مصروف انتقالات', 'مصروف انتقالات', 239, '51110006', 239, 0, 0, 'expense', 51110006, '2025-09-11 14:59:19', '2025-11-12 06:14:45', NULL, 1, 166, NULL, '1'),
(182, NULL, 'تاشيرات بديلة', 'تاشيرات بديلة', 2000, '51110007', 2000, 0, 0, 'expense', 51110007, '2025-09-11 14:59:37', '2025-11-12 06:56:05', NULL, 1, 166, NULL, '1'),
(183, NULL, 'مصروفات ادارية', 'مصروفات ادارية', 0, '', 0, 0, 0, 'expense', 5121, '2025-09-11 15:00:34', '2025-09-11 15:02:23', NULL, 1, 146, NULL, '1'),
(184, NULL, 'نقل كفالة الاستقدام', 'نقل كفالة الاستقدام', 0, '51110008', 0, 0, 0, 'expense', 51110008, '2025-09-11 15:01:13', '2025-09-11 15:01:13', NULL, 1, 166, NULL, '1'),
(185, NULL, 'المرتبات والاجور', 'المرتبات والاجور', 164299, '51210001', 164299, 0, 0, 'expense', 51210001, '2025-09-11 15:02:49', '2025-11-12 06:04:01', NULL, 1, 183, NULL, '1'),
(186, NULL, 'ايجار المكتب', 'ايجار المكتب', 0, '5125122', 0, 0, 0, 'expense', 5122, '2025-09-11 15:03:13', '2025-09-16 12:04:55', '2025-09-16 12:04:55', 1, 146, NULL, '1'),
(187, NULL, 'ايجار سكن العمال', 'ايجار سكن العمال', 0, '5125123', 0, 0, 0, 'expense', 5123, '2025-09-11 15:03:37', '2025-09-16 12:05:32', '2025-09-16 12:05:32', 1, 146, NULL, '1'),
(188, NULL, 'ايجار سكن الموظفين', 'ايجار سكن الموظفين', 0, '5125124', 0, 0, 0, 'expense', 5124, '2025-09-11 15:03:47', '2025-09-16 12:05:59', '2025-09-16 12:05:59', 1, 146, NULL, '1'),
(189, NULL, 'مصروف الاعاشة', 'مصروف الاعاشة', 0, '5125125', 0, 0, 0, 'expense', 5125, '2025-09-11 15:04:02', '2025-09-16 12:06:12', '2025-09-16 12:06:12', 1, 146, NULL, '1'),
(190, NULL, 'مصروف الكهرباء', 'مصروف الكهرباء', 0, '5125126', 0, 0, 0, 'expense', 5126, '2025-09-11 15:04:20', '2025-09-16 12:07:31', '2025-09-16 12:07:31', 1, 146, NULL, '1'),
(191, NULL, 'مصروف تذاكر سفر موظفين', 'مصروف تذاكر سفر موظفين', 0, '5125127', 0, 0, 0, 'expense', 5127, '2025-09-11 15:04:43', '2025-09-16 12:07:47', '2025-09-16 12:07:47', 1, 146, NULL, '1'),
(192, NULL, 'مصروف قرطاسية', 'مصروف قرطاسية', 0, '5125128', 0, 0, 0, 'expense', 5128, '2025-09-11 15:05:03', '2025-09-16 12:08:06', '2025-09-16 12:08:06', 1, 146, NULL, '1'),
(193, NULL, 'مصروف اتصالات وانترنت', 'مصروف اتصالات وانترنت', 0, '5125129', 0, 0, 0, 'expense', 5129, '2025-09-11 15:05:17', '2025-09-16 12:08:20', '2025-09-16 12:08:20', 1, 146, NULL, '1'),
(194, NULL, 'مصروف تامينات اجتماعية', 'مصروف تامينات اجتماعية', 0, '5125130', 0, 0, 0, 'expense', 51210, '2025-09-11 15:05:31', '2025-09-16 12:08:40', '2025-09-16 12:08:40', 1, 146, NULL, '1'),
(195, NULL, 'مصروف دعاية واعلان وتسويق', 'مصروف دعاية واعلان وتسويق', 0, '5125131', 0, 0, 0, 'expense', 51211, '2025-09-11 15:05:47', '2025-09-16 12:08:53', '2025-09-16 12:08:53', 1, 146, NULL, '1'),
(196, NULL, 'مصروف تجديد اقامات', 'مصروف تجديد اقامات', 0, '5125132', 0, 0, 0, 'expense', 51212, '2025-09-11 15:06:03', '2025-09-16 12:09:18', '2025-09-16 12:09:18', 1, 146, NULL, '1'),
(197, NULL, 'مصروف نقل كفالة الموظفين', 'مصروف نقل كفالة الموظفين', 0, '5125133', 0, 0, 0, 'expense', 51213, '2025-09-11 15:06:16', '2025-09-16 12:09:06', '2025-09-16 12:09:06', 1, 146, NULL, '1'),
(198, NULL, 'مخالفات وغرامات', 'مخالفات وغرامات', 0, '5125134', 0, 0, 0, 'expense', 51214, '2025-09-11 15:06:29', '2025-09-16 12:09:30', '2025-09-16 12:09:30', 1, 146, NULL, '1'),
(199, NULL, 'رسوم حكومية', 'رسوم حكومية', 0, '5125135', 0, 0, 0, 'expense', 51215, '2025-09-11 15:06:41', '2025-09-16 12:09:42', '2025-09-16 12:09:42', 1, 146, NULL, '1'),
(200, NULL, 'مصروفات الصيانة', 'مصروفات الصيانة', 0, '5125136', 0, 0, 0, 'expense', 51216, '2025-09-11 15:06:54', '2025-09-16 12:09:53', '2025-09-16 12:09:53', 1, 146, NULL, '1'),
(201, NULL, 'محروقات', 'محروقات', 0, '5125137', 0, 0, 0, 'expense', 51217, '2025-09-11 15:07:14', '2025-09-16 12:07:12', '2025-09-16 12:07:12', 1, 146, NULL, '1'),
(202, NULL, 'مصروف صيانة سيارات', 'مصروف صيانة سيارات', 0, '5125138', 0, 0, 0, 'expense', 51218, '2025-09-11 15:07:26', '2025-09-16 12:06:59', '2025-09-16 12:06:59', 1, 146, NULL, '1'),
(203, NULL, 'عمولات بنكية', 'عمولات بنكية', 0, '5125139', 0, 0, 0, 'expense', 51219, '2025-09-11 15:07:40', '2025-09-16 12:06:46', '2025-09-16 12:06:46', 1, 146, NULL, '1'),
(204, NULL, 'المصروفات المتنوعة', 'المصروفات المتنوعة', 0, '', 0, 0, 0, 'expense', 5151, '2025-09-11 15:08:31', '2025-09-11 15:09:15', NULL, 1, 149, NULL, '1'),
(205, NULL, 'مصروفات الضيافة', 'مصروفات الضيافة', 129, '51510001', 129, 0, 0, 'expense', 51510001, '2025-09-11 15:09:34', '2025-11-12 17:10:14', NULL, 1, 204, NULL, '1'),
(206, NULL, 'مصروفات متنوعة اخرى', 'مصروفات متنوعة اخرى', 7750, '51510002', 7750, 0, 0, 'expense', 51510002, '2025-09-11 15:09:51', '2025-11-12 15:44:18', NULL, 1, 204, NULL, '1'),
(207, NULL, 'جارى الشركاء', 'جارى الشركاء', 0, '321', 0, 0, 0, 'equity', 321, '2025-09-11 15:10:20', '2025-09-11 15:10:20', NULL, 1, 37, NULL, '0'),
(208, NULL, 'الجارى', 'الجارى', 0, '3210001', 0, 0, 0, 'equity', 3211, '2025-09-11 15:10:45', '2025-09-13 14:50:59', NULL, 1, 207, NULL, '0'),
(209, NULL, 'ذمم دائنة اخرى', 'ذمم دائنة اخرى', 0, '2120001', 0, 0, 0, 'liability', 2121, '2025-09-11 15:14:41', '2025-09-16 11:54:54', NULL, 1, 28, NULL, '0'),
(210, NULL, 'تسوية ضريبة القيمة المضافة', 'تسوية ضريبة القيمة المضافة', 0, '2120002', 0, 0, 0, 'liability', 2122, '2025-09-11 15:15:08', '2025-09-16 11:55:41', '2025-09-16 11:55:41', 1, 28, NULL, '1'),
(211, NULL, 'ايرادات مدفوعة مقدما', 'ايرادات مدفوعة مقدما', 0, '2120003', 0, 0, 0, 'liability', 2123, '2025-09-11 15:15:27', '2025-09-16 11:55:17', '2025-09-16 11:55:17', 1, 28, NULL, '0'),
(212, NULL, 'اطراف ذات علاقة', 'اطراف ذات علاقة', 0, '2150001', 0, 0, 0, 'liability', 2151, '2025-09-11 15:16:32', '2025-09-13 14:48:35', NULL, 1, 31, NULL, '0'),
(213, NULL, 'مؤسسة ليان ون', 'مؤسسة ليان ون', 0, '2150002', 0, 0, 0, 'liability', 2152, '2025-09-11 15:17:04', '2025-09-13 14:47:54', '2025-09-13 14:47:54', 1, 31, NULL, '0'),
(214, NULL, 'مؤسسة سلطان الرويلى للمقاولات', 'مؤسسة سلطان الرويلى للمقاولات', 0, '2150003', 0, 0, 0, 'liability', 2153, '2025-09-11 15:17:30', '2025-09-13 14:48:09', '2025-09-13 14:48:09', 1, 31, NULL, '0'),
(215, NULL, 'ذمم مدينة اخرى', 'ذمم مدينة اخرى', 0, '', 0, 0, 0, 'asset', 1181, '2025-09-11 15:18:12', '2025-09-11 15:20:07', NULL, 1, 92, NULL, '0'),
(217, NULL, 'ضريبة القيمة المضافة على المشتريات', 'ضريبة القيمة المضافة على المشتريات', 0, '11810001', 0, 0, 0, 'asset', 11810001, '2025-09-11 15:20:24', '2025-09-11 15:20:24', NULL, 1, 215, NULL, '1'),
(218, NULL, 'ايرادات مستحقة لدى الغير', 'ايرادات مستحقة لدى الغير', 0, '11810002', 0, 0, 0, 'asset', 11810002, '2025-09-11 15:20:35', '2025-09-11 15:20:35', NULL, 1, 215, NULL, '0'),
(219, NULL, 'سلف الموظفين', 'سلف الموظفين', 0, '', 0, 0, 0, 'asset', 1161, '2025-09-11 15:21:26', '2025-09-11 15:21:41', NULL, 1, 64, NULL, '0'),
(220, NULL, 'سلفة جلال العازمي', 'سلفة جلال العازمي', 0, '11610001', 0, 0, 0, 'asset', 11610001, '2025-09-11 15:46:02', '2025-09-11 15:46:02', NULL, 1, 219, NULL, '0'),
(221, NULL, 'سلفة عايض سعود', 'سلفة عايض سعود', 0, '11610002', 0, 0, 0, 'asset', 11610002, '2025-09-11 15:51:42', '2025-09-11 15:51:42', NULL, 1, 219, NULL, '0'),
(222, NULL, 'سلفة خليل شيوعي علي الحيمي', 'سلفة خليل شيوعي علي الحيمي', 0, '11610003', 0, 0, 0, 'asset', 11610003, '2025-09-11 15:51:56', '2025-09-11 15:51:56', NULL, 1, 219, NULL, '0'),
(223, NULL, 'سلفة ام احمد ( خليل شيوعي )', 'سلفة ام احمد ( خليل شيوعي )', 0, '11610004', 0, 0, 0, 'asset', 11610004, '2025-09-11 15:52:07', '2025-09-11 15:52:07', NULL, 1, 219, NULL, '0'),
(224, NULL, 'سلفة نور الدين هاشم الامين محمد', 'سلفة نور الدين هاشم الامين محمد', 0, '11610005', 0, 0, 0, 'asset', 11610005, '2025-09-11 15:52:19', '2025-09-11 15:52:19', NULL, 1, 219, NULL, '0'),
(225, NULL, 'سلفة هاني رديف نايف الحربي', 'سلفة هاني رديف نايف الحربي', 0, '11610006', 0, 0, 0, 'asset', 11610006, '2025-09-11 15:52:29', '2025-09-11 15:52:29', NULL, 1, 219, NULL, '0'),
(226, NULL, 'سلفة مشاري الشمري', 'سلفة مشاري الشمري', 0, '11610007', 0, 0, 0, 'asset', 11610007, '2025-09-11 15:52:38', '2025-09-11 15:52:38', NULL, 1, 219, NULL, '0'),
(227, NULL, 'سلفة فيصل الحبلاني', 'سلفة فيصل الحبلاني', 0, '11610008', 0, 0, 0, 'asset', 11610008, '2025-09-11 15:52:48', '2025-09-11 15:52:48', NULL, 1, 219, NULL, '0'),
(228, NULL, 'سلفة عمران', 'سلفة عمران', 0, '11610009', 0, 0, 0, 'asset', 11610009, '2025-09-11 15:52:57', '2025-09-11 15:52:57', NULL, 1, 219, NULL, '0'),
(229, NULL, 'سلفة سيدا-فيدا', 'سلفة سيدا-فيدا', 0, '11610010', 0, 0, 0, 'asset', 11610010, '2025-09-11 15:53:07', '2025-09-11 15:53:07', NULL, 1, 219, NULL, '0'),
(230, NULL, 'سلفة ديسو مترجم اثيوبيا', 'سلفة ديسو مترجم اثيوبيا', 0, '11610011', 0, 0, 0, 'asset', 11610011, '2025-09-11 15:53:17', '2025-09-11 15:53:17', NULL, 1, 219, NULL, '0'),
(231, NULL, 'سلفة ارشاد السريلانكي', 'سلفة ارشاد السريلانكي', 0, '11610012', 0, 0, 0, 'asset', 11610012, '2025-09-11 15:53:46', '2025-09-11 15:53:46', NULL, 1, 219, NULL, '0'),
(232, NULL, 'سلفة مريم ساير العنزي', 'سلفة مريم ساير العنزي', 0, '11610013', 0, 0, 0, 'asset', 11610013, '2025-09-11 15:53:56', '2025-09-11 15:53:56', NULL, 1, 219, NULL, '0'),
(233, NULL, 'سلفة عيده العازمي', 'سلفة عيده العازمي', 0, '11610014', 0, 0, 0, 'asset', 11610014, '2025-09-11 15:54:05', '2025-09-11 15:54:05', NULL, 1, 219, NULL, '0'),
(234, NULL, 'سلفة هدي الرشيدي', 'سلفة هدي الرشيدي', 0, '11610015', 0, 0, 0, 'asset', 11610015, '2025-09-11 15:54:13', '2025-09-11 15:54:13', NULL, 1, 219, NULL, '0'),
(235, NULL, 'سلفة امل الرويلي', 'سلفة امل الرويلي', 0, '11610016', 0, 0, 0, 'asset', 11610016, '2025-09-11 15:54:20', '2025-09-11 15:54:20', NULL, 1, 219, NULL, '0'),
(236, NULL, 'سلفة حصه الدعجاني', 'سلفة حصه الدعجاني', 0, '11610017', 0, 0, 0, 'asset', 11610017, '2025-09-11 15:54:30', '2025-09-11 15:54:30', NULL, 1, 219, NULL, '0'),
(237, NULL, 'سلفة محمد مرشد غالب بعطوط', 'سلفة محمد مرشد غالب بعطوط', 0, '11610018', 0, 0, 0, 'asset', 11610018, '2025-09-11 15:55:03', '2025-09-11 15:55:03', NULL, 1, 219, NULL, '0'),
(238, NULL, 'سلفة مصطفي خطاب', 'سلفة مصطفي خطاب', 0, '11610019', 0, 0, 0, 'asset', 11610019, '2025-09-11 15:55:10', '2025-09-11 15:55:10', NULL, 1, 219, NULL, '0'),
(239, NULL, 'سلفة محمد مرعي', 'سلفة محمد مرعي', 0, '11610020', 0, 0, 0, 'asset', 11610020, '2025-09-11 15:55:18', '2025-09-11 15:55:18', NULL, 1, 219, NULL, '0'),
(240, NULL, 'سلفة اسامه محمد', 'سلفة اسامه محمد', 0, '11610021', 0, 0, 0, 'asset', 11610021, '2025-09-11 15:55:29', '2025-09-11 15:55:29', NULL, 1, 219, NULL, '0'),
(241, NULL, 'سلفة محمود بشير', 'سلفة محمود بشير', 0, '11610022', 0, 0, 0, 'asset', 11610022, '2025-09-11 15:55:43', '2025-09-11 15:55:43', NULL, 1, 219, NULL, '0'),
(242, NULL, 'سلفة عبدالرحمن العنزي', 'سلفة عبدالرحمن العنزي', 0, '11610023', 0, 0, 0, 'asset', 11610023, '2025-09-11 15:55:51', '2025-09-11 15:55:51', NULL, 1, 219, NULL, '0'),
(243, NULL, 'سلفة جويل رنا', 'سلفة جويل رنا', 0, '11610024', 0, 0, 0, 'asset', 11610024, '2025-09-11 15:56:00', '2025-09-11 15:56:00', NULL, 1, 219, NULL, '0'),
(244, NULL, 'سلفة زوجه محمد مرشد', 'سلفة زوجه محمد مرشد', 0, '11610025', 0, 0, 0, 'asset', 11610025, '2025-09-11 15:56:08', '2025-09-11 15:56:08', NULL, 1, 219, NULL, '0'),
(245, NULL, 'سلفة مشعان محمد العنزي', 'سلفة مشعان محمد العنزي', 0, '11610026', 0, 0, 0, 'asset', 11610026, '2025-09-11 15:56:17', '2025-09-11 15:56:17', NULL, 1, 219, NULL, '0'),
(246, NULL, 'سلفة محمد الدهام', 'سلفة محمد الدهام', 0, '11610027', 0, 0, 0, 'asset', 11610027, '2025-09-11 15:56:25', '2025-09-11 15:56:25', NULL, 1, 219, NULL, '0'),
(247, NULL, 'سلفة ثامر محمد العنزي', 'سلفة ثامر محمد العنزي', 0, '11610028', 0, 0, 0, 'asset', 11610028, '2025-09-11 15:56:34', '2025-09-11 15:56:34', NULL, 1, 219, NULL, '0'),
(248, NULL, 'سلفة خضر الشاذلي', 'سلفة خضر الشاذلي', 0, '11610029', 0, 0, 0, 'asset', 11610029, '2025-09-11 15:56:42', '2025-09-11 15:56:42', NULL, 1, 219, NULL, '0'),
(249, NULL, 'سلفة احمد إبراهيم المحاسب', 'سلفة احمد إبراهيم المحاسب', 0, '11610030', 0, 0, 0, 'asset', 11610030, '2025-09-11 15:56:50', '2025-09-11 15:56:50', NULL, 1, 219, NULL, '0'),
(250, NULL, 'سلفة فيصل عبدالجليل بنجلادش', 'سلفة فيصل عبدالجليل بنجلادش', 0, '11610031', 0, 0, 0, 'asset', 11610031, '2025-09-11 15:57:01', '2025-09-11 15:57:01', NULL, 1, 219, NULL, '0'),
(251, NULL, 'سلفة ماجد اليمني', 'سلفة ماجد اليمني', 0, '11610032', 0, 0, 0, 'asset', 11610032, '2025-09-11 15:57:10', '2025-09-11 15:57:10', NULL, 1, 219, NULL, '0'),
(252, NULL, 'سلفة مالفين اوغندا', 'سلفة مالفين اوغندا', 0, '11610033', 0, 0, 0, 'asset', 11610033, '2025-09-11 15:57:20', '2025-09-11 15:57:20', NULL, 1, 219, NULL, '0'),
(253, NULL, 'سلفة مترجمة اثيوبيا', 'سلفة مترجمة اثيوبيا', 0, '11610034', 0, 0, 0, 'asset', 11610034, '2025-09-11 15:57:28', '2025-09-11 15:57:28', NULL, 1, 219, NULL, '0'),
(254, NULL, 'سلفة محمد الشماحي', 'سلفة محمد الشماحي', 0, '11610035', 0, 0, 0, 'asset', 11610035, '2025-09-11 15:57:36', '2025-09-11 15:57:36', NULL, 1, 219, NULL, '0'),
(255, NULL, 'سلفة احمد خطاب', 'سلفة احمد خطاب', 0, '11610036', 0, 0, 0, 'asset', 11610036, '2025-09-11 15:57:44', '2025-09-11 15:57:44', NULL, 1, 219, NULL, '0'),
(256, NULL, 'سلفة احمد نور', 'سلفة احمد نور', 0, '11610037', 0, 0, 0, 'asset', 11610037, '2025-09-11 15:57:52', '2025-09-11 15:57:52', NULL, 1, 219, NULL, '0'),
(257, NULL, 'مرتبات المستحقة', 'مرتبات المستحقة', 0, '2130001', 0, 0, 0, 'liability', 2131, '2025-09-11 16:15:05', '2025-09-11 16:15:48', NULL, 1, 29, NULL, '0'),
(258, NULL, 'احمد صاهود الرويلي', 'احمد صاهود الرويلي', 0, '21310001', 0, 0, 0, 'liability', 21310001, '2025-09-11 16:16:47', '2025-09-11 16:16:47', NULL, 1, 257, NULL, '0'),
(259, NULL, 'جلال العازمي', 'جلال العازمي', 0, '21310002', 0, 0, 0, 'liability', 21310002, '2025-09-11 16:16:55', '2025-09-11 16:16:55', NULL, 1, 257, NULL, '0'),
(260, NULL, 'عايض سعود', 'عايض سعود', 0, '21310003', 0, 0, 0, 'liability', 21310003, '2025-09-11 16:17:03', '2025-09-11 16:17:03', NULL, 1, 257, NULL, '0'),
(261, NULL, 'خليل شيوعي علي الحيمي', 'خليل شيوعي علي الحيمي', 0, '21310004', 0, 0, 0, 'liability', 21310004, '2025-09-11 16:17:11', '2025-09-11 16:17:11', NULL, 1, 257, NULL, '0'),
(262, NULL, 'ام احمد ( خليل شيوعي )', 'ام احمد ( خليل شيوعي )', 0, '21310005', 0, 0, 0, 'liability', 21310005, '2025-09-11 16:17:20', '2025-09-11 16:17:20', NULL, 1, 257, NULL, '0'),
(263, NULL, 'نور الدين هاشم الامين محمد', 'نور الدين هاشم الامين محمد', 0, '21310006', 0, 0, 0, 'liability', 21310006, '2025-09-11 16:17:28', '2025-09-11 16:17:28', NULL, 1, 257, NULL, '0'),
(264, NULL, 'هاني رديف نايف الحربي', 'هاني رديف نايف الحربي', 0, '21310007', 0, 0, 0, 'liability', 21310007, '2025-09-11 16:17:38', '2025-09-11 16:17:38', NULL, 1, 257, NULL, '0'),
(265, NULL, 'مشاري الشمري', 'مشاري الشمري', 0, '21310008', 0, 0, 0, 'liability', 21310008, '2025-09-11 16:17:46', '2025-09-11 16:17:46', NULL, 1, 257, NULL, '0'),
(266, NULL, 'فيصل الحبلاني', 'فيصل الحبلاني', 0, '21310009', 0, 0, 0, 'liability', 21310009, '2025-09-11 16:17:53', '2025-09-11 16:17:53', NULL, 1, 257, NULL, '0'),
(267, NULL, 'عمران', 'عمران', 0, '21310010', 0, 0, 0, 'liability', 21310010, '2025-09-11 16:18:02', '2025-09-11 16:18:02', NULL, 1, 257, NULL, '0'),
(268, NULL, 'سيدا-فيدا', 'سيدا-فيدا', 0, '21310011', 0, 0, 0, 'liability', 21310011, '2025-09-11 16:18:09', '2025-09-11 16:18:09', NULL, 1, 257, NULL, '0'),
(269, NULL, 'ديسو مترجم اثيوبيا', 'ديسو مترجم اثيوبيا', 0, '21310012', 0, 0, 0, 'liability', 21310012, '2025-09-11 16:18:16', '2025-09-11 16:18:16', NULL, 1, 257, NULL, '0'),
(270, NULL, 'ارشاد السريلانكي', 'ارشاد السريلانكي', 0, '21310013', 0, 0, 0, 'liability', 21310013, '2025-09-11 16:18:24', '2025-09-11 16:18:24', NULL, 1, 257, NULL, '0'),
(271, NULL, 'خالد حويش الظفيري', 'خالد حويش الظفيري', 0, '21310014', 0, 0, 0, 'liability', 21310014, '2025-09-11 16:18:32', '2025-09-11 16:18:32', NULL, 1, 257, NULL, '0'),
(272, NULL, 'مريم ساير العنزي', 'مريم ساير العنزي', 0, '21310015', 0, 0, 0, 'liability', 21310015, '2025-09-11 16:18:39', '2025-09-11 16:18:39', NULL, 1, 257, NULL, '0'),
(273, NULL, 'عيده العازمي', 'عيده العازمي', 0, '21310016', 0, 0, 0, 'liability', 21310016, '2025-09-11 16:18:49', '2025-09-11 16:18:49', NULL, 1, 257, NULL, '0'),
(274, NULL, 'هدي الرشيدي', 'هدي الرشيدي', 0, '21310017', 0, 0, 0, 'liability', 21310017, '2025-09-11 16:18:57', '2025-09-11 16:18:57', NULL, 1, 257, NULL, '0'),
(275, NULL, 'امل الرويلي', 'امل الرويلي', 0, '21310018', 0, 0, 0, 'liability', 21310018, '2025-09-11 16:19:05', '2025-09-11 16:19:05', NULL, 1, 257, NULL, '0'),
(276, NULL, 'حصه الدعجاني', 'حصه الدعجاني', 0, '21310019', 0, 0, 0, 'liability', 21310019, '2025-09-11 16:19:12', '2025-09-11 16:19:12', NULL, 1, 257, NULL, '0'),
(277, NULL, 'محمد مرشد غالب بعطوط', 'محمد مرشد غالب بعطوط', 0, '21310020', 0, 0, 0, 'liability', 21310020, '2025-09-11 16:19:20', '2025-09-11 16:19:20', NULL, 1, 257, NULL, '0'),
(278, NULL, 'مصطفي خطاب', 'مصطفي خطاب', 0, '21310021', 0, 0, 0, 'liability', 21310021, '2025-09-11 16:19:27', '2025-09-11 16:19:27', NULL, 1, 257, NULL, '0'),
(279, NULL, 'محمد مرعي', 'محمد مرعي', 0, '21310022', 0, 0, 0, 'liability', 21310022, '2025-09-11 16:19:34', '2025-09-11 16:19:34', NULL, 1, 257, NULL, '0'),
(280, NULL, 'اسامه محمد', 'اسامه محمد', 0, '21310023', 0, 0, 0, 'liability', 21310023, '2025-09-11 16:19:42', '2025-09-11 16:19:42', NULL, 1, 257, NULL, '0'),
(281, NULL, 'محمود بشير', 'محمود بشير', 0, '21310024', 0, 0, 0, 'liability', 21310024, '2025-09-11 16:19:49', '2025-09-11 16:19:49', NULL, 1, 257, NULL, '0'),
(282, NULL, 'عبدالرحمن العنزي', 'عبدالرحمن العنزي', 0, '21310025', 0, 0, 0, 'liability', 21310025, '2025-09-11 16:19:57', '2025-09-11 16:19:57', NULL, 1, 257, NULL, '0'),
(283, NULL, 'جويل رنا', 'جويل رنا', 0, '21310026', 0, 0, 0, 'liability', 21310026, '2025-09-11 16:20:05', '2025-09-11 16:20:05', NULL, 1, 257, NULL, '0'),
(284, NULL, 'زوجه محمد مرشد', 'زوجه محمد مرشد', 0, '21310027', 0, 0, 0, 'liability', 21310027, '2025-09-11 16:20:13', '2025-09-11 16:20:13', NULL, 1, 257, NULL, '0'),
(285, NULL, 'مشعان محمد العنزي', 'مشعان محمد العنزي', 0, '21310028', 0, 0, 0, 'liability', 21310028, '2025-09-11 16:20:20', '2025-09-11 16:20:20', NULL, 1, 257, NULL, '0'),
(286, NULL, 'محمد الدهام', 'محمد الدهام', 0, '21310029', 0, 0, 0, 'liability', 21310029, '2025-09-11 16:20:30', '2025-09-11 16:20:30', NULL, 1, 257, NULL, '0'),
(287, NULL, 'ثامر محمد العنزي', 'ثامر محمد العنزي', 0, '21310030', 0, 0, 0, 'liability', 21310030, '2025-09-11 16:20:38', '2025-09-11 16:20:38', NULL, 1, 257, NULL, '0'),
(288, NULL, 'خضر الشاذلي', 'خضر الشاذلي', 0, '21310031', 0, 0, 0, 'liability', 21310031, '2025-09-11 16:20:46', '2025-09-11 16:20:46', NULL, 1, 257, NULL, '0'),
(289, NULL, 'احمد إبراهيم المحاسب', 'احمد إبراهيم المحاسب', 0, '21310032', 0, 0, 0, 'liability', 21310032, '2025-09-11 16:20:54', '2025-09-11 16:20:54', NULL, 1, 257, NULL, '0'),
(290, NULL, 'فيصل عبدالجليل بنجلادش', 'فيصل عبدالجليل بنجلادش', 0, '21310033', 0, 0, 0, 'liability', 21310033, '2025-09-11 16:21:02', '2025-09-11 16:21:02', NULL, 1, 257, NULL, '0'),
(291, NULL, 'ماجد اليمني', 'ماجد اليمني', 0, '21310034', 0, 0, 0, 'liability', 21310034, '2025-09-11 16:21:10', '2025-09-11 16:21:10', NULL, 1, 257, NULL, '0'),
(292, NULL, 'مالفين اوغندا', 'مالفين اوغندا', 0, '21310035', 0, 0, 0, 'liability', 21310035, '2025-09-11 16:21:19', '2025-09-11 16:21:19', NULL, 1, 257, NULL, '0'),
(293, NULL, 'مترجمة اثيوبيا', 'مترجمة اثيوبيا', 0, '21310036', 0, 0, 0, 'liability', 21310036, '2025-09-11 16:21:27', '2025-09-11 16:21:27', NULL, 1, 257, NULL, '0'),
(294, NULL, 'محمد الشماحي', 'محمد الشماحي', 0, '21310037', 0, 0, 0, 'liability', 21310037, '2025-09-11 16:21:36', '2025-09-11 16:21:36', NULL, 1, 257, NULL, '0'),
(295, NULL, 'احمد خطاب', 'احمد خطاب', 0, '21310038', 0, 0, 0, 'liability', 21310038, '2025-09-11 16:21:43', '2025-09-11 16:21:43', NULL, 1, 257, NULL, '0'),
(296, NULL, 'احمد نور', 'احمد نور', 0, '21310039', 0, 0, 0, 'liability', 21310039, '2025-09-11 16:21:51', '2025-09-11 16:21:51', NULL, 1, 257, NULL, '0'),
(297, NULL, 'رصيد افتتاحي', 'حساب مقابل قيود الأرصدة الافتتاحية', -1908072.82, '', 146767.14, 2054839.96, 0, 'equity', 34, '2025-09-11 18:20:00', '2025-09-13 15:59:09', NULL, 1, NULL, NULL, '0'),
(298, NULL, 'محمود عاصم', 'محمود عاصم', 0, '21310040', 0, 0, 0, 'liability', 21310040, '2025-09-12 11:08:01', '2025-09-12 11:08:01', NULL, 1, 257, NULL, '0'),
(299, NULL, 'بنك الرياض', 'بنك الرياض', 0, '11210003', 0, 0, 0, 'asset', 11210003, '2025-09-12 11:08:59', '2025-09-12 11:08:59', NULL, 1, 141, NULL, '0'),
(300, NULL, 'qweqw', 'weqwqewq', 0, '118100020001', 0, 0, 0, 'asset', 2147483647, '2025-09-12 13:52:03', '2025-09-12 13:53:10', '2025-09-12 13:53:10', 1, 218, NULL, '0'),
(301, NULL, 'وكالة حدود الذكاء', 'وكالة حدود الذكاء', 15536.67, '21510001', 15536.67, 0, 0, 'liability', 21510001, '2025-09-13 14:47:24', '2025-11-12 16:10:48', NULL, 1, 212, NULL, '0'),
(302, NULL, 'مؤسسة ليان ون', 'مؤسسة ليان ون', 2712.73, '21510002', 6112.73, 3400, 0, 'liability', 21510002, '2025-09-13 14:47:35', '2025-11-12 06:08:41', NULL, 1, 212, NULL, '0'),
(303, NULL, 'مؤسسة سلطان الرويلى', 'مؤسسة سلطان الرويلى', 0, '21510003', 0, 0, 0, 'liability', 21510003, '2025-09-13 14:47:50', '2025-09-13 14:47:50', NULL, 1, 212, NULL, '0'),
(304, NULL, 'الايرادات الاخرى', 'الايرادات الاخرى', -39123.1, '3210001', 0, 39123.1, 0, 'revenue', 41210001, '2025-09-13 14:49:30', '2025-11-12 16:54:40', NULL, 1, 175, NULL, '0'),
(305, NULL, 'جارى الشريك احمد الرويلى', 'جارى الشريك احمد الرويلى', 4582.15, '3210001', 4582.15, 0, 0, 'equity', 32110001, '2025-09-13 14:51:21', '2025-11-12 06:56:05', NULL, 1, 208, NULL, '0'),
(306, NULL, 'عهد فيزا', 'عهد فيزا', 2000, '1150001', 2000, 0, 0, 'asset', 1151, '2025-09-14 13:50:15', '2025-11-12 03:51:57', NULL, 1, 17, NULL, '0'),
(307, NULL, 'فيزا 9151', 'فيزا 9151', 10000, '11510001', 10000, 0, 0, 'asset', 11510001, '2025-09-14 13:54:05', '2025-11-12 15:47:03', NULL, 1, 306, NULL, '0'),
(308, NULL, 'فيزا 9748', 'فيزا 9748', 10000, '11510002', 10000, 0, 0, 'asset', 11510002, '2025-09-14 13:54:41', '2025-11-12 16:54:40', NULL, 1, 306, NULL, '0'),
(309, NULL, 'فيزا 1705', 'فيزا 1705', 4000, '11510003', 4000, 0, 0, 'asset', 11510003, '2025-09-14 13:54:58', '2025-11-12 07:35:57', NULL, 1, 306, NULL, '0'),
(310, NULL, 'فيزا 9726', 'فيزا 9726', 6000, '11510004', 6000, 0, 0, 'asset', 11510004, '2025-09-14 13:55:11', '2025-11-12 16:54:40', NULL, 1, 306, NULL, '0'),
(311, NULL, 'فيزا 0263', 'فيزا 0263', 2000, '11510005', 2000, 0, 0, 'asset', 11510005, '2025-09-14 13:55:52', '2025-11-12 04:00:19', NULL, 1, 306, NULL, '0'),
(312, NULL, 'فيزا 7808', 'فيزا 7808', 0, '11510006', 0, 0, 0, 'asset', 11510006, '2025-09-14 13:56:07', '2025-09-14 13:56:07', NULL, 1, 306, NULL, '0'),
(313, NULL, 'العهد النقدية', 'العهد النقدية', 0, '1151152', 0, 0, 0, 'asset', 1151152, '2025-09-14 13:57:17', '2025-09-14 13:59:12', '2025-09-14 13:59:12', 1, 17, NULL, '0'),
(314, NULL, 'العهد النقدية', 'العهد النقدية', 0, '1151153', 0, 0, 0, 'asset', 1151153, '2025-09-14 13:58:29', '2025-09-14 13:58:50', '2025-09-14 13:58:50', 1, 17, NULL, '0'),
(315, NULL, 'eee', 'eee', 0, '1151152', 0, 0, 0, 'asset', 1151152, '2025-09-14 14:02:01', '2025-09-14 14:02:15', '2025-09-14 14:02:15', 1, 17, NULL, '0'),
(316, NULL, 'dsdssdsd', 'sddssdsd', 0, '1151152', 0, 0, 0, 'asset', 1151152, '2025-09-14 14:15:25', '2025-09-14 16:23:03', '2025-09-14 16:23:03', 1, 17, NULL, '0'),
(317, NULL, '122121', '122121frrfrf', 0, '1151153', 0, 0, 0, 'asset', 1151153, '2025-09-14 16:06:26', '2025-09-14 16:23:21', '2025-09-14 16:23:21', 1, 17, NULL, '0'),
(318, NULL, 'dffdfd', 'dffdfd', 0, '1151152', 0, 0, 0, 'asset', 1151152, '2025-09-14 16:23:48', '2025-09-14 16:25:40', '2025-09-14 16:25:55', 1, 17, NULL, '0'),
(319, NULL, 'weq', '21', 0, '1150003', 0, 0, 0, 'asset', 1150003, '2025-09-14 16:24:13', '2025-09-14 16:24:31', '2025-09-14 16:24:31', 1, 17, NULL, '0'),
(320, NULL, 'fggf', 'fggf', 0, '1160002', 0, 0, 0, 'asset', 1160002, '2025-09-14 16:24:31', '2025-09-14 16:25:02', '2025-09-14 16:25:02', 1, 64, NULL, '0'),
(321, NULL, '34232ewrew', 'ewerwerw', 0, '1151152', 0, 0, 0, 'asset', 1151152, '2025-09-14 16:26:24', '2025-09-14 16:38:41', '2025-09-14 16:38:41', 1, 17, NULL, '0'),
(322, NULL, 'ewqqw123321', 'dsfds12321', 0, '1152', 0, 0, 0, 'asset', 1152, '2025-09-14 16:36:40', '2025-09-14 16:39:27', '2025-09-14 16:39:27', 1, 17, NULL, '0'),
(323, NULL, 'sdsdsd', 'sdsdsd', 0, '1152', 0, 0, 0, 'asset', 1152, '2025-09-14 16:39:48', '2025-09-14 16:39:57', '2025-09-14 16:39:57', 1, 17, NULL, '0'),
(324, NULL, 'cssc', 'scsc', 0, '1162', 0, 0, 0, 'asset', 1162, '2025-09-14 16:42:22', '2025-09-14 16:42:29', '2025-09-14 16:42:29', 1, 64, NULL, '0'),
(325, NULL, 'مكاتب الوكلاء', 'مكاتب الوكلاء', 0, '2111', 0, 0, 0, 'liability', 2111, '2025-09-16 11:50:30', '2025-09-28 11:16:34', NULL, 1, 26, NULL, '0'),
(326, NULL, 'ذمم دائنة اخرى', 'ذمم دائنة اخرى', 0, '2124', 0, 0, 0, 'liability', 2124, '2025-09-16 11:52:40', '2025-09-16 11:53:07', '2025-09-16 11:53:07', 1, 28, NULL, '0'),
(327, NULL, 'ضريبة القيمة المضافة على مبيعات', 'ضريبة القيمة المضافة على مبيعات', 0, '21210001', 0, 0, 0, 'liability', 21210001, '2025-09-16 11:56:02', '2025-09-16 11:56:02', NULL, 1, 209, NULL, '1'),
(328, NULL, 'تسوية ضريبة القيمة المضافة', 'تسوية ضريبة القيمة المضافة', 0, '21210002', 0, 0, 0, 'liability', 21210002, '2025-09-16 11:56:20', '2025-09-16 11:56:20', NULL, 1, 209, NULL, '1'),
(329, NULL, 'ايرادات مدفوعة مقدما', 'ايرادات مدفوعة مقدما', 0, '21210003', 0, 0, 0, 'liability', 21210003, '2025-09-16 11:56:36', '2025-09-16 11:56:36', NULL, 1, 209, NULL, '1'),
(330, NULL, 'عقود تحت التنفيذ', 'عقود تحت التنفيذ', 0, '21210004', 0, 0, 0, 'liability', 21210004, '2025-09-16 11:56:49', '2025-09-16 11:56:49', NULL, 1, 209, NULL, '0'),
(331, NULL, 'ايجار المكتب', 'ايجار المكتب', 14600, '51210002', 14600, 0, 0, 'expense', 51210002, '2025-09-16 12:00:47', '2025-11-12 16:10:48', NULL, 1, 183, NULL, '1'),
(332, NULL, 'ايجار سكن العمال', 'ايجار سكن العمال', 0, '51210003', 0, 0, 0, 'expense', 51210003, '2025-09-16 12:01:21', '2025-09-16 12:01:21', NULL, 1, 183, NULL, '1'),
(333, NULL, 'ايجار سكن الموظفين', 'ايجار سكن الموظفين', 6000, '51210004', 6000, 0, 0, 'expense', 51210004, '2025-09-16 12:01:33', '2025-11-12 16:10:48', NULL, 1, 183, NULL, '1'),
(334, NULL, 'مصروف الاعاشة', 'مصروف الاعاشة', 331, '51210005', 331, 0, 0, 'expense', 51210005, '2025-09-16 12:01:40', '2025-11-12 06:26:55', NULL, 1, 183, NULL, '1'),
(335, NULL, 'مصروف الكهرباء', 'مصروف الكهرباء', 1626.46, '51210006', 1626.46, 0, 0, 'expense', 51210006, '2025-09-16 12:01:48', '2025-11-12 06:04:01', NULL, 1, 183, NULL, '1'),
(336, NULL, 'مصروف تذاكر سفر موظفين', 'مصروف تذاكر سفر موظفين', 0, '51210007', 0, 0, 0, 'expense', 51210007, '2025-09-16 12:01:57', '2025-09-16 12:01:57', NULL, 1, 183, NULL, '1'),
(337, NULL, 'مصروف قرطاسية', 'مصروف قرطاسية', 46, '51210008', 46, 0, 0, 'expense', 51210008, '2025-09-16 12:02:04', '2025-11-12 03:34:44', NULL, 1, 183, NULL, '1'),
(338, NULL, 'مصروف اتصالات وانترنت', 'مصروف اتصالات وانترنت', 2869.77, '51210009', 2869.77, 0, 0, 'expense', 51210009, '2025-09-16 12:02:12', '2025-11-12 17:10:14', NULL, 1, 183, NULL, '1'),
(339, NULL, 'مصروف تامينات اجتماعية', 'مصروف تامينات اجتماعية', 7895.6, '51210010', 7895.6, 0, 0, 'expense', 51210010, '2025-09-16 12:02:20', '2025-11-12 06:04:01', NULL, 1, 183, NULL, '1'),
(340, NULL, 'مصروف دعاية واعلان وتسويق', 'مصروف دعاية واعلان وتسويق', 0, '51210011', 0, 0, 0, 'expense', 51210011, '2025-09-16 12:02:27', '2025-09-16 12:02:27', NULL, 1, 183, NULL, '1'),
(341, NULL, 'مصروف دعاية واعلان وتسويق', 'مصروف دعاية واعلان وتسويق', 2520, '51210012', 2520, 0, 0, 'expense', 51210012, '2025-09-16 12:02:34', '2025-11-12 03:42:58', NULL, 1, 183, NULL, '1'),
(342, NULL, 'مصروف تجديد اقامات', 'مصروف تجديد اقامات', 15187, '51210013', 15187, 0, 0, 'expense', 51210013, '2025-09-16 12:02:42', '2025-11-12 17:10:14', NULL, 1, 183, NULL, '1'),
(343, NULL, 'مصروف نقل كفالة الموظفين', 'مصروف نقل كفالة الموظفين', 8000, '51210014', 8000, 0, 0, 'expense', 51210014, '2025-09-16 12:02:48', '2025-11-12 06:14:46', NULL, 1, 183, NULL, '1'),
(344, NULL, 'مخالفات وغرامات', 'مخالفات وغرامات', 0, '51210015', 0, 0, 0, 'expense', 51210015, '2025-09-16 12:02:55', '2025-09-16 12:02:55', NULL, 1, 183, NULL, '1'),
(345, NULL, 'رسوم حكومية', 'رسوم حكومية', 0, '51210016', 0, 0, 0, 'expense', 51210016, '2025-09-16 12:03:02', '2025-09-16 12:03:02', NULL, 1, 183, NULL, '1'),
(346, NULL, 'مصروفات الصيانة', 'مصروفات الصيانة', 2875, '51210017', 2875, 0, 0, 'expense', 51210017, '2025-09-16 12:03:08', '2025-11-12 16:50:41', NULL, 1, 183, NULL, '1'),
(347, NULL, 'محروقات', 'محروقات', 5000, '51210018', 5000, 0, 0, 'expense', 51210018, '2025-09-16 12:03:17', '2025-11-12 16:50:41', NULL, 1, 183, NULL, '1'),
(348, NULL, 'مصروف صيانة سيارات', 'مصروف صيانة سيارات', 0, '51210019', 0, 0, 0, 'expense', 51210019, '2025-09-16 12:03:24', '2025-09-16 12:03:24', NULL, 1, 183, NULL, '1'),
(349, NULL, 'عمولات بنكية', 'عمولات بنكية', 164.48, '51210020', 164.48, 0, 0, 'expense', 51210020, '2025-09-16 12:03:32', '2025-11-12 17:10:14', NULL, 1, 183, NULL, '1'),
(350, NULL, 'يونيك اوغندا', 'يونيك اوغندا', 0, '21110001', 0, 0, 0, 'liability', 21110001, '2025-09-28 11:12:59', '2025-09-28 11:12:59', NULL, 1, 325, NULL, '0'),
(351, NULL, 'تايم ماستر اوغندا', 'تايم ماستر اوغندا', 0, '21110002', 0, 0, 0, 'liability', 21110002, '2025-09-28 11:13:17', '2025-09-28 11:13:17', NULL, 1, 325, NULL, '0'),
(352, NULL, 'كريستال اوغندا', 'كريستال اوغندا', 0, '21110003', 0, 0, 0, 'liability', 21110003, '2025-09-28 11:13:29', '2025-09-28 11:13:29', NULL, 1, 325, NULL, '0'),
(353, NULL, 'سنترال بنجلاديش', 'سنترال بنجلاديش', 0, '21110004', 0, 0, 0, 'liability', 21110004, '2025-09-28 11:13:40', '2025-09-28 11:13:40', NULL, 1, 325, NULL, '0'),
(354, NULL, 'رفيق بنجلاديش', 'رفيق بنجلاديش', 0, '21110005', 0, 0, 0, 'liability', 21110005, '2025-09-28 11:13:52', '2025-09-28 11:13:52', NULL, 1, 325, NULL, '0'),
(355, NULL, 'ليلى الفلبين', 'ليلى الفلبين', 0, '21110006', 0, 0, 0, 'liability', 21110006, '2025-09-28 11:14:02', '2025-09-28 11:14:02', NULL, 1, 325, NULL, '0'),
(356, NULL, 'انكوربريت الفلبين', 'انكوربريت الفلبين', 0, '21110007', 0, 0, 0, 'liability', 21110007, '2025-09-28 11:14:15', '2025-09-28 11:14:15', NULL, 1, 325, NULL, '0'),
(357, NULL, 'نيشن سيرلانكا', 'نيشن سيرلانكا', 0, '21110008', 0, 0, 0, 'liability', 21110008, '2025-09-28 11:14:28', '2025-09-28 11:14:28', NULL, 1, 325, NULL, '0'),
(358, NULL, 'ورلد اير سيرلانكا', 'ورلد اير سيرلانكا', 0, '21110009', 0, 0, 0, 'liability', 21110009, '2025-09-28 11:14:44', '2025-09-28 11:14:44', NULL, 1, 325, NULL, '0'),
(359, NULL, 'مطلب سيرلانكا', 'مطلب سيرلانكا', 0, '21110010', 0, 0, 0, 'liability', 21110010, '2025-09-28 11:15:08', '2025-09-28 11:15:08', NULL, 1, 325, NULL, '0'),
(360, NULL, 'ماجوردمو كينيا', 'ماجوردمو كينيا', 0, '21110011', 0, 0, 0, 'liability', 21110011, '2025-09-28 11:15:28', '2025-09-28 11:15:28', NULL, 1, 325, NULL, '0'),
(361, NULL, 'قولدن سيزون اثيوبيا', 'قولدن سيزون اثيوبيا', 0, '21110012', 0, 0, 0, 'liability', 21110012, '2025-09-28 11:15:45', '2025-09-28 11:15:45', NULL, 1, 325, NULL, '0'),
(362, NULL, 'سابولا اثيوبيا', 'سابولا اثيوبيا', 0, '21110013', 0, 0, 0, 'liability', 21110013, '2025-09-28 11:15:57', '2025-09-28 11:15:57', NULL, 1, 325, NULL, '0'),
(363, NULL, 'حساب العميل: سالم فهد عبدالخالق الزهراني', 'حساب العميل: سالم فهد عبدالخالق الزهراني', 0, '1134', 0, 0, 0, 'asset', 1134, '2025-09-29 18:50:11', '2025-09-29 18:50:11', NULL, 1, 15, NULL, '0'),
(364, NULL, 'مساند', 'مساند', -887279.59, '11310001', 0, 887279.59, 0, 'asset', 11310001, '2025-11-12 03:04:36', '2025-11-12 16:54:40', NULL, 1, 162, NULL, '0'),
(365, NULL, 'استلام عاملات', 'استلام عاملات', 4639, '51110009', 4639, 0, 0, 'expense', 51110009, '2025-11-12 03:29:11', '2025-11-12 16:50:41', NULL, 1, 166, NULL, '1'),
(366, NULL, 'تاذكر سفر عاملات', 'تاذكر سفر عاملات', 4650, '51110010', 4650, 0, 0, 'expense', 51110010, '2025-11-12 03:29:24', '2025-11-12 17:10:14', NULL, 1, 166, NULL, '1'),
(367, NULL, 'مطالبات مالية', 'مطالبات مالية', 77730.25, '51110011', 77730.25, 0, 0, 'expense', 51110011, '2025-11-12 03:29:35', '2025-11-12 16:50:41', NULL, 1, 166, NULL, '1'),
(368, NULL, 'عمولات مناديب', 'عمولات مناديب', 3080, '51210021', 3080, 0, 0, 'expense', 51210021, '2025-11-12 03:43:44', '2025-11-12 17:10:14', NULL, 1, 183, NULL, '1'),
(369, NULL, 'مشتريات الالات والاجهزة', 'مشتريات الالات والاجهزة', 0, '1251', 0, 0, 0, 'asset', 1251, '2025-11-12 04:17:15', '2025-11-12 04:17:53', NULL, 1, 22, NULL, '0'),
(370, NULL, 'عهد', 'عهد', 70000, '1150001', 70000, 0, 0, 'asset', 12510001, '2025-11-12 04:18:37', '2025-11-12 06:47:58', NULL, 1, 369, NULL, '0'),
(371, NULL, 'عهدة خليل شويعى', 'عهدة خليل شويعى', 485, '11510007', 485, 0, 0, 'asset', 11510007, '2025-11-12 04:36:19', '2025-11-12 04:41:55', NULL, 1, 306, NULL, '0'),
(372, NULL, 'ايرادات اخرى 2', 'ايرادات اخرى 2', -18100, '412100010001', 0, 18100, 0, 'revenue', 2147483647, '2025-11-12 05:44:59', '2025-11-12 06:08:41', NULL, 1, 304, NULL, '0');

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `f_name` varchar(255) NOT NULL,
  `l_name` varchar(255) NOT NULL,
  `name_en` varchar(255) NOT NULL DEFAULT 'Default Name',
  `email` varchar(255) NOT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `mandob_code` varchar(255) DEFAULT NULL,
  `vehicle_code` varchar(255) DEFAULT NULL,
  `type` varchar(20) DEFAULT NULL,
  `role` varchar(6) NOT NULL DEFAULT 'admin',
  `dashboard` int(11) NOT NULL DEFAULT 0,
  `pos` int(11) NOT NULL DEFAULT 0,
  `stock` int(11) NOT NULL DEFAULT 0,
  `store` int(11) NOT NULL DEFAULT 0,
  `cat` int(11) NOT NULL DEFAULT 0,
  `unit` int(11) NOT NULL DEFAULT 0,
  `product` int(11) NOT NULL DEFAULT 0,
  `stock_limit` int(11) NOT NULL DEFAULT 0,
  `coupons` int(11) NOT NULL DEFAULT 0,
  `customer` int(11) NOT NULL DEFAULT 0,
  `seller` int(11) NOT NULL DEFAULT 0,
  `admin` int(11) NOT NULL DEFAULT 0,
  `supplier` int(11) NOT NULL DEFAULT 0,
  `setting` int(11) NOT NULL DEFAULT 0,
  `requests` int(11) NOT NULL DEFAULT 0,
  `storage` int(11) NOT NULL DEFAULT 0,
  `notification` int(11) NOT NULL DEFAULT 0,
  `tracking` int(11) NOT NULL DEFAULT 0,
  `vehicle_stock` int(11) NOT NULL DEFAULT 0,
  `reports` int(11) NOT NULL DEFAULT 0,
  `regions` int(11) NOT NULL DEFAULT 0,
  `sales` int(11) NOT NULL DEFAULT 1,
  `accounts` int(11) NOT NULL DEFAULT 1,
  `rating` int(11) NOT NULL DEFAULT 1,
  `visit` int(11) NOT NULL DEFAULT 1,
  `sectionsalary` int(11) NOT NULL DEFAULT 1,
  `latitude` varchar(2000) DEFAULT '1',
  `longitude` varchar(2000) DEFAULT '1',
  `visitors` int(11) NOT NULL DEFAULT 0,
  `result_visitors` int(11) NOT NULL DEFAULT 0,
  `salary` varchar(255) NOT NULL DEFAULT '0',
  `precent_of_sales` varchar(255) NOT NULL DEFAULT '0',
  `commission` varchar(5000) NOT NULL DEFAULT '0',
  `balance` varchar(255) NOT NULL DEFAULT '0',
  `credit` varchar(255) NOT NULL DEFAULT '0',
  `loan` double NOT NULL DEFAULT 0,
  `score` varchar(20) NOT NULL DEFAULT '0',
  `note` mediumtext DEFAULT '\'\'',
  `holidays` int(11) NOT NULL DEFAULT 0,
  `number_of_days` int(11) NOT NULL DEFAULT 0,
  `role_id` bigint(20) DEFAULT 1,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `shift_id` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`shift_id`)),
  `account_id` bigint(20) DEFAULT NULL,
  `department_id` bigint(20) UNSIGNED DEFAULT NULL,
  `manager_id` bigint(20) UNSIGNED DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`id`, `local_id`, `f_name`, `l_name`, `name_en`, `email`, `phone`, `password`, `remember_token`, `insert_flag`, `created_at`, `update_flag`, `updated_at`, `image`, `company_id`, `mandob_code`, `vehicle_code`, `type`, `role`, `dashboard`, `pos`, `stock`, `store`, `cat`, `unit`, `product`, `stock_limit`, `coupons`, `customer`, `seller`, `admin`, `supplier`, `setting`, `requests`, `storage`, `notification`, `tracking`, `vehicle_stock`, `reports`, `regions`, `sales`, `accounts`, `rating`, `visit`, `sectionsalary`, `latitude`, `longitude`, `visitors`, `result_visitors`, `salary`, `precent_of_sales`, `commission`, `balance`, `credit`, `loan`, `score`, `note`, `holidays`, `number_of_days`, `role_id`, `branch_id`, `shift_id`, `account_id`, `department_id`, `manager_id`, `deleted_at`) VALUES
(100, 100, 'admin', 'Aa12345', '', 'info@novoosystem.com', NULL, '$2y$10$cS/TR8WC0kTuIn4unbJdi.4RqNMfX/F3TcpWajrCwnSQzr5fFgDeC', NULL, 1, '2023-12-24 18:27:14', 0, '2025-09-09 17:31:13', '2025-02-19-67b500022451f.png', NULL, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '', 0, 0, 1, 1, '\"[\\\"1\\\",\\\"2\\\"]\"', NULL, 1, NULL, '2025-09-09 17:31:13'),
(159, 0, 'محمود', 'بشير', 'Default Name', 'mahmoudbeshier@alemtayaz.com', NULL, '$2y$10$ZiuXBrVzZAJAHUnzu1I2GOMXgX.fjP.mVI..vW0F9YI1zH6yvhpEK', NULL, 1, '2025-08-30 16:02:31', 0, '2025-09-09 18:04:06', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 3, 1, '1', NULL, 4, 160, NULL),
(160, 0, 'محمود', 'عاصم', 'Default Name', 'mahmoudassem@alemtayaz.com', NULL, '$2y$10$E31iiaILRPPH2LAvKvUM8uglRMjpXeBi/bZ2aOQ/luXcmXXHivZum', NULL, 1, '2025-08-30 16:03:14', 0, '2025-09-09 18:04:37', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 1, 1, '1', NULL, 4, 164, NULL),
(161, 0, 'مصطفي', 'خطاب', 'Default Name', 'mostafakhatab@alemtayaz.com', NULL, '$2y$10$5brJMtfNoIQ5.MJrzh6eB.b/Ab2SqZN939H5SiDZwf10baejdfa/G', NULL, 1, '2025-08-30 16:03:54', 0, '2025-09-09 18:05:08', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 4, 1, '1', NULL, 8, 165, NULL),
(162, 0, 'test', 'test', 'Default Name', 'test@email.com', NULL, '$2y$10$pARM9VjQg992yLriFvIMkujUYCCVZ.1HKBDYTdIEO12H8uQxGgjxS', NULL, 1, '2025-08-30 18:13:17', 0, '2025-09-09 17:31:39', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 4, 1, '1', NULL, NULL, NULL, '2025-09-09 17:31:39'),
(163, 0, 'ادمن', 'ادمن', 'Default Name', 'admin@alemtayaz.com', NULL, '$2y$10$gVVJwJzW5OxRv0EETXDaBu3oh.UanF/lxhLOFJOduGLwWczN9Y1pS', NULL, 1, '2025-09-09 17:20:36', 0, '2025-09-09 18:03:39', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 2, 1, '1', NULL, NULL, NULL, NULL),
(164, 0, 'ابو', 'سلطان', 'Default Name', 'ceo@alemtayaz.com', NULL, '$2y$10$IXOHPQBm5P94v4eIiDpwKOQpW/.FG0LqIvPfpaSBy3/hIwIfBwbIu', NULL, 1, '2025-09-09 17:38:12', 0, '2025-09-09 17:38:12', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 2, 1, '1', NULL, NULL, NULL, NULL),
(165, 0, 'اسامه', 'اسامه', 'Default Name', 'osama@alemtayaz.com', NULL, '$2y$10$GfFG3ASo2FTsSsJ0orVxaetH/5GhCGqRyOD6hnEJIMyKujb7iyGd2', NULL, 1, '2025-09-09 18:02:10', 0, '2025-09-09 18:02:10', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 4, 1, '1', NULL, 9, 164, NULL),
(166, 0, 'خضر', 'خضر', 'Default Name', 'khder@alemtayaz.com', NULL, '$2y$10$2cux5E9RrMAxF9Mag7jM6ujGmr78lEa9oqmGt0UE.8C4Ywg3TfXdi', NULL, 1, '2025-09-09 18:03:24', 0, '2025-09-09 18:03:24', NULL, 1, NULL, NULL, NULL, 'admin', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, NULL, NULL, 0, 0, '0', '0', '0', '0', '0', 0, '0', '\'\'', 0, 0, 4, 10, '1', NULL, 10, 165, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `admin_details`
--

CREATE TABLE `admin_details` (
  `id` bigint(20) NOT NULL,
  `admin_id` bigint(20) DEFAULT NULL,
  `full_name` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `department` varchar(100) DEFAULT NULL,
  `job_title` varchar(100) DEFAULT NULL,
  `hire_date` date DEFAULT NULL,
  `qualifications` text DEFAULT NULL,
  `contract_details` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `admin_sellers`
--

CREATE TABLE `admin_sellers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `admin_sellers`
--

INSERT INTO `admin_sellers` (`id`, `admin_id`, `seller_id`, `created_at`, `updated_at`) VALUES
(70, 162, 100, '2025-08-30 15:32:43', '2025-08-30 15:32:43'),
(71, 162, 159, '2025-08-30 15:32:43', '2025-08-30 15:32:43'),
(72, 162, 160, '2025-08-30 15:32:43', '2025-08-30 15:32:43'),
(73, 162, 161, '2025-08-30 15:32:43', '2025-08-30 15:32:43');

-- --------------------------------------------------------

--
-- Table structure for table `application_status_history`
--

CREATE TABLE `application_status_history` (
  `id` int(11) NOT NULL,
  `job_applicant_id` int(11) NOT NULL,
  `previous_status` varchar(50) NOT NULL,
  `new_status` varchar(50) NOT NULL,
  `changed_at` timestamp NULL DEFAULT current_timestamp(),
  `comment` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `approvals`
--

CREATE TABLE `approvals` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `approvable_type` enum('task','project','lead') NOT NULL,
  `approvable_id` bigint(20) UNSIGNED NOT NULL,
  `requested_by` bigint(20) UNSIGNED NOT NULL,
  `approver_id` bigint(20) UNSIGNED NOT NULL,
  `status` enum('pending','approved','rejected') NOT NULL DEFAULT 'pending',
  `reason` varchar(255) DEFAULT NULL,
  `next_step_hint` varchar(255) DEFAULT NULL,
  `decided_at` datetime DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `archived_product_logs`
--

CREATE TABLE `archived_product_logs` (
  `id` int(10) UNSIGNED NOT NULL,
  `product_id` int(10) UNSIGNED NOT NULL,
  `quantity` decimal(10,2) NOT NULL,
  `type` int(11) NOT NULL,
  `seller_id` int(10) UNSIGNED NOT NULL,
  `branch_id` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `archived_stock_batches`
--

CREATE TABLE `archived_stock_batches` (
  `id` int(10) UNSIGNED NOT NULL,
  `product_id` int(10) UNSIGNED NOT NULL,
  `branch_id` int(10) UNSIGNED NOT NULL,
  `quantity` decimal(10,2) NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `assets`
--

CREATE TABLE `assets` (
  `id` int(11) NOT NULL,
  `asset_name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `purchase_price` decimal(15,2) NOT NULL,
  `additional_costs` decimal(15,2) DEFAULT 0.00,
  `total_cost` decimal(15,2) GENERATED ALWAYS AS (`purchase_price` + `additional_costs`) STORED,
  `salvage_value` decimal(15,2) DEFAULT 0.00,
  `book_value` decimal(15,2) NOT NULL,
  `accumulated_depreciation` decimal(15,2) NOT NULL,
  `useful_life` int(11) NOT NULL,
  `commencement_date` date DEFAULT NULL,
  `depreciation_method` enum('straight_line','declining_balance','units_of_production') NOT NULL,
  `depreciation_rate` decimal(5,2) DEFAULT NULL,
  `invoice_number` varchar(100) DEFAULT NULL,
  `purchase_date` date DEFAULT NULL,
  `location` varchar(255) DEFAULT NULL,
  `status` enum('active','maintenance','disposed','sold','closed') DEFAULT 'active',
  `code` varchar(255) NOT NULL,
  `branch_id` bigint(20) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `attendances`
--

CREATE TABLE `attendances` (
  `id` bigint(20) NOT NULL,
  `admin_id` bigint(20) NOT NULL,
  `date` date NOT NULL,
  `check_in` time NOT NULL,
  `check_out` time DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `time_late` varchar(255) NOT NULL DEFAULT '0',
  `expected_hours` varchar(255) NOT NULL DEFAULT '0',
  `worked_hours` varchar(255) NOT NULL DEFAULT '0',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `lang` double DEFAULT NULL,
  `late` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `bills_of_materials`
--

CREATE TABLE `bills_of_materials` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `version` varchar(50) NOT NULL DEFAULT 'v1',
  `description` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `bom_components`
--

CREATE TABLE `bom_components` (
  `id` bigint(20) UNSIGNED NOT NULL COMMENT 'المفتاح الأساسي لكل مكون في قائمة المواد',
  `bom_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يرتبط برأس قائمة المواد في جدول bills_of_materials',
  `component_product_id` bigint(20) UNSIGNED NOT NULL COMMENT 'معرّف الصنف (مادة خام أو وسيط) من جدول products',
  `quantity` decimal(16,4) NOT NULL COMMENT 'الكمية المطلوبة من هذا الصنف لكل وحدة من المنتج النهائي',
  `unit` bigint(20) UNSIGNED NOT NULL COMMENT 'وحدة القياس صغري=0وكبري=1',
  `created_at` timestamp NULL DEFAULT NULL COMMENT 'تاريخ إضافة السطر',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT 'تاريخ آخر تعديل للسطر'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `branches`
--

CREATE TABLE `branches` (
  `id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `lang` mediumtext DEFAULT NULL,
  `code` varchar(255) NOT NULL,
  `account_stock_Id` bigint(20) NOT NULL,
  `lat` mediumtext DEFAULT NULL,
  `active` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `branches`
--

INSERT INTO `branches` (`id`, `name`, `lang`, `code`, `account_stock_Id`, `lat`, `active`, `created_at`, `updated_at`) VALUES
(1, 'فرع الرياض الفرع الرئيسي', '0', '1', 16, '0', 1, '2025-02-21 04:09:29', '2025-09-09 17:25:33'),
(9, 'فرع حفر الباطن', '0', '2', 153, '0', 1, '2025-09-09 17:24:13', '2025-09-09 17:26:12'),
(10, 'فرع عرعر', NULL, '3', 154, NULL, 1, '2025-09-09 17:26:39', '2025-09-09 17:26:39');

-- --------------------------------------------------------

--
-- Table structure for table `brands`
--

CREATE TABLE `brands` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `brands`
--

INSERT INTO `brands` (`id`, `local_id`, `name`, `image`, `insert_flag`, `created_at`, `update_flag`, `updated_at`, `company_id`) VALUES
(1, 1, 'كواليتى', '', 1, '2024-08-28 23:43:22', 0, '2024-09-01 11:40:32', 1),
(2, 2, 'دايموند ', '', 1, '2024-08-28 23:43:22', 0, NULL, 1),
(3, 3, 'ساين', '', 1, '2024-08-28 23:43:22', 0, NULL, 1),
(4, 4, 'اكسبشن', '', 1, '2024-08-28 23:49:10', 0, NULL, 1),
(5, 5, 'مارين', '', 1, '2024-08-28 23:49:10', 0, NULL, 1);

-- --------------------------------------------------------

--
-- Table structure for table `business_settings`
--

CREATE TABLE `business_settings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `key` varchar(255) NOT NULL,
  `value` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `business_settings`
--

INSERT INTO `business_settings` (`id`, `key`, `value`, `created_at`, `updated_at`, `company_id`) VALUES
(1, 'shop_logo', '2025-09-11-68c2e9dced961.png', NULL, NULL, 1),
(2, 'pagination_limit', '100000', NULL, NULL, 1),
(3, 'currency', 'SAR', NULL, NULL, 1),
(4, 'shop_name', 'شركة الامتياز للاستقدام', NULL, NULL, 1),
(5, 'shop_address', 'الرياض', NULL, NULL, 1),
(6, 'shop_phone', '011421806', NULL, NULL, 1),
(7, 'shop_email', 'alemtayaz@gmail.com', NULL, NULL, 1),
(8, 'footer_text', 'شركة الامتياز للاستقدام', NULL, NULL, 1),
(9, 'country', 'AF', NULL, NULL, 1),
(10, 'stock_limit', '10', NULL, NULL, 1),
(11, 'time_zone', 'Pacific/Midway', NULL, NULL, 1),
(12, 'vat_reg_no', '302251044300003', NULL, NULL, 1),
(13, 'kilometer', '0', NULL, NULL, 1),
(14, 'number_tax', '302251044300003', NULL, NULL, 1),
(15, 'color1', '#000000', NULL, NULL, 1),
(16, 'color2', '#f2ba02', NULL, NULL, 1),
(17, 'base_url', 'https://testnewpos.iqbrandx.com/', NULL, NULL, 1),
(18, 'cash', '1', NULL, NULL, 1),
(19, 'shabaka', '1', NULL, NULL, 1),
(20, 'agel', '1', NULL, NULL, 1),
(21, 'credit', NULL, NULL, NULL, 1),
(22, 'tax', NULL, '2025-02-23 17:10:02', '2025-02-23 17:10:02', 1),
(23, 'opening_balance_account_id', '297', '2025-09-11 18:20:00', '2025-09-11 18:20:00', 1);

-- --------------------------------------------------------

--
-- Table structure for table `call_logs`
--

CREATE TABLE `call_logs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `lead_id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `direction` enum('inbound','outbound') NOT NULL DEFAULT 'outbound',
  `started_at` datetime NOT NULL,
  `ended_at` datetime DEFAULT NULL,
  `duration_sec` int(11) GENERATED ALWAYS AS (if(`ended_at` is null,NULL,timestampdiff(SECOND,`started_at`,`ended_at`))) STORED,
  `outcome_id` bigint(20) UNSIGNED DEFAULT NULL,
  `phone_used` varchar(40) DEFAULT NULL,
  `channel` enum('phone','whatsapp','zoom','teams','other') NOT NULL DEFAULT 'phone',
  `recording_url` varchar(255) DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `call_outcomes`
--

CREATE TABLE `call_outcomes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `code` varchar(50) NOT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 1,
  `is_active` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `parent_id` int(11) NOT NULL,
  `position` int(11) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `image` varchar(255) NOT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `type` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `clients`
--

CREATE TABLE `clients` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `account_id` bigint(20) UNSIGNED DEFAULT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `tax_number` varchar(100) DEFAULT NULL,
  `company_name` varchar(255) DEFAULT NULL,
  `contact_person` varchar(255) DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `entity_type` enum('task','project','lead') NOT NULL,
  `entity_id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `body` text NOT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `entity_type`, `entity_id`, `admin_id`, `body`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 'task', 2, 100, 'wwqewq', NULL, '2025-09-07 23:07:24', '2025-09-07 23:07:24');

-- --------------------------------------------------------

--
-- Table structure for table `companies`
--

CREATE TABLE `companies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) DEFAULT NULL,
  `company_name` varchar(255) DEFAULT NULL,
  `sub_domain_prefix` varchar(255) DEFAULT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `companies`
--

INSERT INTO `companies` (`id`, `local_id`, `company_name`, `sub_domain_prefix`, `insert_flag`, `created_at`, `update_flag`, `updated_at`) VALUES
(1, 1, 'Quality', '1', 1, '2024-08-29 04:52:04', 0, '2024-09-01 11:40:34');

-- --------------------------------------------------------

--
-- Table structure for table `confirm_stocks`
--

CREATE TABLE `confirm_stocks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `stock` int(11) NOT NULL,
  `main_stock` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `contracts`
--

CREATE TABLE `contracts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `contract_number` varchar(255) NOT NULL,
  `client_id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `total_value` decimal(15,2) NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date DEFAULT NULL,
  `description` text DEFAULT NULL,
  `receivable_account_id` bigint(20) UNSIGNED NOT NULL,
  `revenue_account_id` bigint(20) UNSIGNED NOT NULL,
  `status` enum('draft','active','completed','canceled') NOT NULL DEFAULT 'draft',
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cost_centers`
--

CREATE TABLE `cost_centers` (
  `id` bigint(20) NOT NULL,
  `name` varchar(2555) NOT NULL,
  `code` varchar(255) NOT NULL,
  `description` mediumtext NOT NULL,
  `parent_id` bigint(20) DEFAULT NULL,
  `active` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `cost_centers`
--

INSERT INTO `cost_centers` (`id`, `name`, `code`, `description`, `parent_id`, `active`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'فرع حفرالباطن', '123', 'فرع حفرالباطن', 1, 1, '2025-04-28 05:19:45', '2025-09-12 11:05:17', NULL),
(14, 'فرع الرياض', '1', '', 14, 1, '2025-09-11 17:20:44', '2025-09-11 17:50:25', NULL),
(15, 'فرع الرياض', '1111', 'فرع الرياض', 15, 1, '2025-09-11 17:21:20', '2025-09-12 11:04:35', NULL),
(16, 'فرع الرياض', '11111', '', NULL, 1, '2025-09-11 18:08:30', '2025-09-13 11:07:05', NULL),
(18, 'فرع حفرالباطن', '22222', '', NULL, 1, '2025-09-13 11:06:51', '2025-09-13 11:06:51', NULL),
(19, 'فرع عرعر', '33333', '', NULL, 1, '2025-09-13 11:07:21', '2025-09-13 11:07:21', NULL),
(20, 'عام', '44444', '', NULL, 1, '2025-09-13 11:07:43', '2025-09-13 11:07:43', NULL),
(21, 'الوكالات الرجالية', '55555', '', NULL, 1, '2025-09-13 11:08:01', '2025-09-13 11:08:01', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `coupons`
--

CREATE TABLE `coupons` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(100) DEFAULT NULL,
  `coupon_type` varchar(255) NOT NULL DEFAULT 'default',
  `user_limit` int(11) DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `start_date` date DEFAULT NULL,
  `expire_date` date DEFAULT NULL,
  `min_purchase` decimal(8,2) NOT NULL DEFAULT 0.00,
  `max_discount` decimal(8,2) NOT NULL DEFAULT 0.00,
  `discount` decimal(8,2) NOT NULL DEFAULT 0.00,
  `discount_type` varchar(15) NOT NULL DEFAULT 'percentage',
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `course_sellers`
--

CREATE TABLE `course_sellers` (
  `id` int(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(500) NOT NULL DEFAULT 'غير معروف',
  `link` mediumtext DEFAULT NULL,
  `img` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`img`)),
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `currencies`
--

CREATE TABLE `currencies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `country` varchar(255) DEFAULT NULL,
  `currency_code` varchar(255) DEFAULT NULL,
  `currency_symbol` varchar(255) DEFAULT NULL,
  `exchange_rate` decimal(8,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `currencies`
--

INSERT INTO `currencies` (`id`, `country`, `currency_code`, `currency_symbol`, `exchange_rate`, `created_at`, `updated_at`) VALUES
(1, 'US Dollar', 'USD', '$', 1.00, NULL, NULL),
(2, 'Canadian Dollar', 'CAD', 'CA$', 1.00, NULL, NULL),
(3, 'Euro', 'EUR', '€', 1.00, NULL, NULL),
(4, 'United Arab Emirates Dirham', 'AED', 'د.إ.‏', 1.00, NULL, NULL),
(5, 'Afghan Afghani', 'AFN', '؋', 1.00, NULL, NULL),
(6, 'Albanian Lek', 'ALL', 'L', 1.00, NULL, NULL),
(7, 'Armenian Dram', 'AMD', '֏', 1.00, NULL, NULL),
(8, 'Argentine Peso', 'ARS', '$', 1.00, NULL, NULL),
(9, 'Australian Dollar', 'AUD', '$', 1.00, NULL, NULL),
(10, 'Azerbaijani Manat', 'AZN', '₼', 1.00, NULL, NULL),
(11, 'Bosnia-Herzegovina Convertible Mark', 'BAM', 'KM', 1.00, NULL, NULL),
(12, 'Bangladeshi Taka', 'BDT', '৳', 1.00, NULL, NULL),
(13, 'Bulgarian Lev', 'BGN', 'лв.', 1.00, NULL, NULL),
(14, 'Bahraini Dinar', 'BHD', 'د.ب.‏', 1.00, NULL, NULL),
(15, 'Burundian Franc', 'BIF', 'FBu', 1.00, NULL, NULL),
(16, 'Brunei Dollar', 'BND', 'B$', 1.00, NULL, NULL),
(17, 'Bolivian Boliviano', 'BOB', 'Bs', 1.00, NULL, NULL),
(18, 'Brazilian Real', 'BRL', 'R$', 1.00, NULL, NULL),
(19, 'Botswanan Pula', 'BWP', 'P', 1.00, NULL, NULL),
(20, 'Belarusian Ruble', 'BYN', 'Br', 1.00, NULL, NULL),
(21, 'Belize Dollar', 'BZD', '$', 1.00, NULL, NULL),
(22, 'Congolese Franc', 'CDF', 'FC', 1.00, NULL, NULL),
(23, 'Swiss Franc', 'CHF', 'CHf', 1.00, NULL, NULL),
(24, 'Chilean Peso', 'CLP', '$', 1.00, NULL, NULL),
(25, 'Chinese Yuan', 'CNY', '¥', 1.00, NULL, NULL),
(26, 'Colombian Peso', 'COP', '$', 1.00, NULL, NULL),
(27, 'Costa Rican Colón', 'CRC', '₡', 1.00, NULL, NULL),
(28, 'Cape Verdean Escudo', 'CVE', '$', 1.00, NULL, NULL),
(29, 'Czech Republic Koruna', 'CZK', 'Kč', 1.00, NULL, NULL),
(30, 'Djiboutian Franc', 'DJF', 'Fdj', 1.00, NULL, NULL),
(31, 'Danish Krone', 'DKK', 'Kr.', 1.00, NULL, NULL),
(32, 'Dominican Peso', 'DOP', 'RD$', 1.00, NULL, NULL),
(33, 'Algerian Dinar', 'DZD', 'د.ج.‏', 1.00, NULL, NULL),
(34, 'Estonian Kroon', 'EEK', 'kr', 1.00, NULL, NULL),
(35, 'Egyptian Pound', 'EGP', 'E£‏', 1.00, NULL, NULL),
(36, 'Eritrean Nakfa', 'ERN', 'Nfk', 1.00, NULL, NULL),
(37, 'Ethiopian Birr', 'ETB', 'Br', 1.00, NULL, NULL),
(38, 'British Pound Sterling', 'GBP', '£', 1.00, NULL, NULL),
(39, 'Georgian Lari', 'GEL', 'GEL', 1.00, NULL, NULL),
(40, 'Ghanaian Cedi', 'GHS', 'GH¢', 1.00, NULL, NULL),
(41, 'Guinean Franc', 'GNF', 'FG', 1.00, NULL, NULL),
(42, 'Guatemalan Quetzal', 'GTQ', 'Q', 1.00, NULL, NULL),
(43, 'Hong Kong Dollar', 'HKD', 'HK$', 1.00, NULL, NULL),
(44, 'Honduran Lempira', 'HNL', 'L', 1.00, NULL, NULL),
(45, 'Croatian Kuna', 'HRK', 'kn', 1.00, NULL, NULL),
(46, 'Hungarian Forint', 'HUF', 'Ft', 1.00, NULL, NULL),
(47, 'Indonesian Rupiah', 'IDR', 'Rp', 1.00, NULL, NULL),
(48, 'Israeli New Sheqel', 'ILS', '₪', 1.00, NULL, NULL),
(49, 'Indian Rupee', 'INR', '₹', 1.00, NULL, NULL),
(50, 'Iraqi Dinar', 'IQD', 'ع.د', 1.00, NULL, NULL),
(51, 'Iranian Rial', 'IRR', '﷼', 1.00, NULL, NULL),
(52, 'Icelandic Króna', 'ISK', 'kr', 1.00, NULL, NULL),
(53, 'Jamaican Dollar', 'JMD', '$', 1.00, NULL, NULL),
(54, 'Jordanian Dinar', 'JOD', 'د.ا‏', 1.00, NULL, NULL),
(55, 'Japanese Yen', 'JPY', '¥', 1.00, NULL, NULL),
(56, 'Kenyan Shilling', 'KES', 'Ksh', 1.00, NULL, NULL),
(57, 'Cambodian Riel', 'KHR', '៛', 1.00, NULL, NULL),
(58, 'Comorian Franc', 'KMF', 'FC', 1.00, NULL, NULL),
(59, 'South Korean Won', 'KRW', 'CF', 1.00, NULL, NULL),
(60, 'Kuwaiti Dinar', 'KWD', 'د.ك.‏', 1.00, NULL, NULL),
(61, 'Kazakhstani Tenge', 'KZT', '₸.', 1.00, NULL, NULL),
(62, 'Lebanese Pound', 'LBP', 'ل.ل.‏', 1.00, NULL, NULL),
(63, 'Sri Lankan Rupee', 'LKR', 'Rs', 1.00, NULL, NULL),
(64, 'Lithuanian Litas', 'LTL', 'Lt', 1.00, NULL, NULL),
(65, 'Latvian Lats', 'LVL', 'Ls', 1.00, NULL, NULL),
(66, 'Libyan Dinar', 'LYD', 'د.ل.‏', 1.00, NULL, NULL),
(67, 'Moroccan Dirham', 'MAD', 'د.م.‏', 1.00, NULL, NULL),
(68, 'Moldovan Leu', 'MDL', 'L', 1.00, NULL, NULL),
(69, 'Malagasy Ariary', 'MGA', 'Ar', 1.00, NULL, NULL),
(70, 'Macedonian Denar', 'MKD', 'Ден', 1.00, NULL, NULL),
(71, 'Myanma Kyat', 'MMK', 'K', 1.00, NULL, NULL),
(72, 'Macanese Pataca', 'MOP', 'MOP$', 1.00, NULL, NULL),
(73, 'Mauritian Rupee', 'MUR', 'Rs', 1.00, NULL, NULL),
(74, 'Mexican Peso', 'MXN', '$', 1.00, NULL, NULL),
(75, 'Malaysian Ringgit', 'MYR', 'RM', 1.00, NULL, NULL),
(76, 'Mozambican Metical', 'MZN', 'MT', 1.00, NULL, NULL),
(77, 'Namibian Dollar', 'NAD', 'N$', 1.00, NULL, NULL),
(78, 'Nigerian Naira', 'NGN', '₦', 1.00, NULL, NULL),
(79, 'Nicaraguan Córdoba', 'NIO', 'C$', 1.00, NULL, NULL),
(80, 'Norwegian Krone', 'NOK', 'kr', 1.00, NULL, NULL),
(81, 'Nepalese Rupee', 'NPR', 'Re.', 1.00, NULL, NULL),
(82, 'New Zealand Dollar', 'NZD', '$', 1.00, NULL, NULL),
(83, 'Omani Rial', 'OMR', 'ر.ع.‏', 1.00, NULL, NULL),
(84, 'Panamanian Balboa', 'PAB', 'B/.', 1.00, NULL, NULL),
(85, 'Peruvian Nuevo Sol', 'PEN', 'S/', 1.00, NULL, NULL),
(86, 'Philippine Peso', 'PHP', '₱', 1.00, NULL, NULL),
(87, 'Pakistani Rupee', 'PKR', 'Rs', 1.00, NULL, NULL),
(88, 'Polish Zloty', 'PLN', 'zł', 1.00, NULL, NULL),
(89, 'Paraguayan Guarani', 'PYG', '₲', 1.00, NULL, NULL),
(90, 'Qatari Rial', 'QAR', 'ر.ق.‏', 1.00, NULL, NULL),
(91, 'Romanian Leu', 'RON', 'lei', 1.00, NULL, NULL),
(92, 'Serbian Dinar', 'RSD', 'din.', 1.00, NULL, NULL),
(93, 'Russian Ruble', 'RUB', '₽.', 1.00, NULL, NULL),
(94, 'Rwandan Franc', 'RWF', 'FRw', 1.00, NULL, NULL),
(95, 'Saudi Riyal', 'SAR', 'ر.س.‏', 1.00, NULL, NULL),
(96, 'Sudanese Pound', 'SDG', 'ج.س.', 1.00, NULL, NULL),
(97, 'Swedish Krona', 'SEK', 'kr', 1.00, NULL, NULL),
(98, 'Singapore Dollar', 'SGD', '$', 1.00, NULL, NULL),
(99, 'Somali Shilling', 'SOS', 'Sh.so.', 1.00, NULL, NULL),
(100, 'Syrian Pound', 'SYP', 'LS‏', 1.00, NULL, NULL),
(101, 'Thai Baht', 'THB', '฿', 1.00, NULL, NULL),
(102, 'Tunisian Dinar', 'TND', 'د.ت‏', 1.00, NULL, NULL),
(103, 'Tongan Paʻanga', 'TOP', 'T$', 1.00, NULL, NULL),
(104, 'Turkish Lira', 'TRY', '₺', 1.00, NULL, NULL),
(105, 'Trinidad and Tobago Dollar', 'TTD', '$', 1.00, NULL, NULL),
(106, 'New Taiwan Dollar', 'TWD', 'NT$', 1.00, NULL, NULL),
(107, 'Tanzanian Shilling', 'TZS', 'TSh', 1.00, NULL, NULL),
(108, 'Ukrainian Hryvnia', 'UAH', '₴', 1.00, NULL, NULL),
(109, 'Ugandan Shilling', 'UGX', 'USh', 1.00, NULL, NULL),
(110, 'Uruguayan Peso', 'UYU', '$', 1.00, NULL, NULL),
(111, 'Uzbekistan Som', 'UZS', 'so\'m', 1.00, NULL, NULL),
(112, 'Venezuelan Bolívar', 'VEF', 'Bs.F.', 1.00, NULL, NULL),
(113, 'Vietnamese Dong', 'VND', '₫', 1.00, NULL, NULL),
(114, 'CFA Franc BEAC', 'XAF', 'FCFA', 1.00, NULL, NULL),
(115, 'CFA Franc BCEAO', 'XOF', 'CFA', 1.00, NULL, NULL),
(116, 'Yemeni Rial', 'YER', '﷼‏', 1.00, NULL, NULL),
(117, 'South African Rand', 'ZAR', 'R', 1.00, NULL, NULL),
(118, 'Zambian Kwacha', 'ZMK', 'ZK', 1.00, NULL, NULL),
(119, 'Zimbabwean Dollar', 'ZWL', 'Z$', 1.00, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `current_orders`
--

CREATE TABLE `current_orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `stock_id` bigint(20) UNSIGNED DEFAULT NULL,
  `owner_id` bigint(20) UNSIGNED DEFAULT NULL,
  `owner_role` varchar(10) NOT NULL DEFAULT 'admin',
  `order_amount` double NOT NULL DEFAULT 0,
  `total_tax` double NOT NULL,
  `collected_cash` double DEFAULT NULL,
  `extra_discount` double DEFAULT NULL,
  `coupon_code` varchar(255) DEFAULT NULL,
  `coupon_discount_amount` double NOT NULL DEFAULT 0,
  `coupon_discount_title` varchar(255) DEFAULT NULL,
  `payment_id` bigint(20) UNSIGNED DEFAULT NULL,
  `transaction_reference` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `type` tinyint(1) DEFAULT 4,
  `cash` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `current_reserve_products`
--

CREATE TABLE `current_reserve_products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `data` text NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED DEFAULT NULL,
  `date` varchar(200) DEFAULT NULL,
  `type` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `name_en` varchar(255) DEFAULT 'Default Customer',
  `mobile` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `state` varchar(255) DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `zip_code` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `balance` double DEFAULT NULL,
  `credit` double DEFAULT 0,
  `type` int(11) DEFAULT 0,
  `latitude` varchar(2000) DEFAULT NULL,
  `longitude` varchar(2000) DEFAULT NULL,
  `active` int(11) NOT NULL DEFAULT 1,
  `limit` double NOT NULL DEFAULT 0,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `category_id` bigint(20) UNSIGNED DEFAULT NULL,
  `specialist` int(11) DEFAULT 1,
  `region_id` bigint(20) NOT NULL DEFAULT 1,
  `pharmacy_name` varchar(5000) DEFAULT NULL,
  `tax_number` varchar(255) NOT NULL DEFAULT '0',
  `c_history` varchar(255) NOT NULL DEFAULT '0',
  `discount` double NOT NULL DEFAULT 0,
  `account_id` bigint(20) DEFAULT NULL,
  `guarantor_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `customers`
--

INSERT INTO `customers` (`id`, `local_id`, `name`, `name_en`, `mobile`, `email`, `image`, `state`, `city`, `zip_code`, `address`, `balance`, `credit`, `type`, `latitude`, `longitude`, `active`, `limit`, `insert_flag`, `created_at`, `update_flag`, `updated_at`, `company_id`, `category_id`, `specialist`, `region_id`, `pharmacy_name`, `tax_number`, `c_history`, `discount`, `account_id`, `guarantor_id`) VALUES
(1, 0, 'الكاشير', 'Default Customer', '1', NULL, NULL, NULL, NULL, NULL, NULL, 1235.938, 7450.6944117147, 0, NULL, NULL, 1, 0, 1, NULL, 0, '2025-08-15 04:24:53', 1, NULL, 1, 1, NULL, '0', '0', 0, 92, NULL),
(15, 0, 'سالم فهد عبدالخالق الزهراني', NULL, '0568708838', 'alemtayaz@gmail.com', 'def.png', '1', 'الرياض', '12244', 'الأمير فيصل بن سعد بن عبدالرحمن', NULL, 0, 1, '30.0444', '31.2357', 1, 0, 1, '2025-09-29 18:50:11', 0, '2025-09-29 18:52:31', 1, NULL, 1, 0, NULL, '1', '1', 0, 363, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `customer_prices`
--

CREATE TABLE `customer_prices` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `customer_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `price` double NOT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `customer_products`
--

CREATE TABLE `customer_products` (
  `id` bigint(20) NOT NULL,
  `product_id` bigint(20) NOT NULL,
  `customer_id` bigint(20) NOT NULL,
  `price` double NOT NULL DEFAULT 0,
  `tax` double NOT NULL DEFAULT 0,
  `discount` double NOT NULL DEFAULT 0,
  `quantity` double NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `custom_fields`
--

CREATE TABLE `custom_fields` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `key` varchar(255) NOT NULL,
  `type` varchar(50) NOT NULL,
  `options` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`options`)),
  `default_value` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`default_value`)),
  `is_required` tinyint(1) NOT NULL DEFAULT 0,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `sort_order` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `applies_to` varchar(255) NOT NULL,
  `group` varchar(255) DEFAULT NULL,
  `help_text` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `custom_fields`
--

INSERT INTO `custom_fields` (`id`, `name`, `key`, `type`, `options`, `default_value`, `is_required`, `is_active`, `sort_order`, `applies_to`, `group`, `help_text`, `created_at`, `updated_at`) VALUES
(1, 'رقم الجواز', 'nationality_Id', 'text', NULL, NULL, 1, 1, 1, 'App\\Models\\Lead', NULL, NULL, '2025-08-23 20:27:52', '2025-09-10 01:15:54'),
(2, 'الجنسية', 'nationality', 'text', NULL, NULL, 1, 0, 2, 'App\\Models\\Lead', NULL, NULL, '2025-08-23 20:28:40', '2025-09-09 18:15:48'),
(3, 'مدة الوقت للرد', 'response_time', 'datetime', NULL, NULL, 1, 1, 1, 'App\\Models\\CallLog', NULL, NULL, '2025-08-23 21:10:39', '2025-09-09 18:15:21'),
(4, 'رقم الجوال الاخير', 'last_phone', 'text', NULL, NULL, 1, 0, 0, 'App\\Models\\LeadNote', NULL, NULL, '2025-08-23 22:21:12', '2025-09-09 18:15:46'),
(5, 'رقم الهوية', 'number_Identity', 'number', NULL, NULL, 0, 1, 0, 'App\\Models\\Customer', NULL, NULL, '2025-09-29 18:20:43', '2025-09-29 18:20:43'),
(6, 'الاعتماد', '5', 'text', NULL, NULL, 0, 1, 0, 'App\\Models\\Lead', NULL, NULL, '2025-12-09 00:41:49', '2025-12-09 00:41:49');

-- --------------------------------------------------------

--
-- Table structure for table `custom_field_values`
--

CREATE TABLE `custom_field_values` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `custom_field_id` bigint(20) UNSIGNED NOT NULL,
  `fieldable_type` varchar(255) NOT NULL,
  `fieldable_id` bigint(20) UNSIGNED NOT NULL,
  `value` longtext DEFAULT NULL,
  `value_json` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`value_json`)),
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `custom_field_values`
--

INSERT INTO `custom_field_values` (`id`, `custom_field_id`, `fieldable_type`, `fieldable_id`, `value`, `value_json`, `created_at`, `updated_at`) VALUES
(1, 1, 'App\\Models\\Lead', 7, 'ffggf3434', NULL, '2025-08-23 20:52:44', '2025-09-10 01:16:14'),
(2, 2, 'App\\Models\\Lead', 7, '', NULL, '2025-08-23 20:52:44', '2025-08-23 20:52:44'),
(3, 1, 'App\\Models\\Lead', 8, '12345678', NULL, '2025-08-23 20:53:25', '2025-08-23 20:53:25'),
(4, 2, 'App\\Models\\Lead', 8, 'سعودي', NULL, '2025-08-23 20:53:25', '2025-08-23 20:53:25'),
(5, 3, 'App\\Models\\CallLog', 3, '2025-09-05T21:46', NULL, '2025-08-23 21:46:49', '2025-08-23 21:46:49'),
(6, 4, 'App\\Models\\LeadNote', 2, '012254877897', NULL, '2025-08-23 22:21:39', '2025-08-23 22:21:39'),
(7, 3, 'App\\Models\\CallLog', 6, '2025-09-06T22:23', NULL, '2025-08-23 22:23:07', '2025-08-23 22:23:07'),
(19, 5, 'App\\Models\\Customer', 15, '569498779879', NULL, '2025-09-29 18:50:11', '2025-09-29 18:52:31');

-- --------------------------------------------------------

--
-- Table structure for table `departments`
--

CREATE TABLE `departments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `parent_id` bigint(20) UNSIGNED DEFAULT NULL,
  `name` varchar(191) NOT NULL,
  `code` varchar(64) NOT NULL,
  `active` tinyint(1) NOT NULL DEFAULT 1,
  `level` smallint(5) UNSIGNED NOT NULL DEFAULT 0,
  `path` varchar(1024) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `departments`
--

INSERT INTO `departments` (`id`, `parent_id`, `name`, `code`, `active`, `level`, `path`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, NULL, 'قسم المحاسبين', '999', 1, 0, '/1', '2025-09-07 16:05:08', '2025-09-09 17:32:22', '2025-09-09 17:32:22'),
(2, 1, 'فريق محاسبين الرياض', '888', 1, 1, '/1/2', '2025-09-07 16:20:00', '2025-09-09 17:32:25', '2025-09-09 17:32:25'),
(3, NULL, 'المحسابين', '1', 1, 0, '/3', '2025-09-09 17:32:53', '2025-09-09 17:32:53', NULL),
(4, 3, 'محاسبين الرياض', '11', 1, 1, '/3/4', '2025-09-09 17:33:30', '2025-09-09 17:33:30', NULL),
(5, 3, 'محاسبين الحفر', '12', 1, 1, '/3/5', '2025-09-09 17:33:54', '2025-09-09 17:33:54', NULL),
(6, 3, 'محاسبين عرعر', '13', 1, 1, '/3/6', '2025-09-09 17:34:18', '2025-09-09 17:34:18', NULL),
(7, NULL, 'منسقين', '2', 1, 0, '/7', '2025-09-09 17:34:45', '2025-09-09 17:34:45', NULL),
(8, 7, 'منسقين الرياض', '21', 1, 1, '/7/8', '2025-09-09 17:35:01', '2025-09-09 17:35:01', NULL),
(9, 7, 'منسقين الحفر', '22', 1, 1, '/7/9', '2025-09-09 17:35:20', '2025-09-09 17:35:20', NULL),
(10, 7, 'منسقين عرعر', '23', 1, 1, '/7/10', '2025-09-09 17:35:34', '2025-09-09 17:35:34', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `develop_sellers`
--

CREATE TABLE `develop_sellers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `note` text NOT NULL,
  `type` int(11) NOT NULL DEFAULT 0,
  `active` int(11) NOT NULL DEFAULT 0,
  `date` date DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `expenses`
--

CREATE TABLE `expenses` (
  `id` int(11) NOT NULL,
  `account_id` int(11) DEFAULT NULL,
  `seller_id` bigint(20) NOT NULL,
  `branch_id` bigint(20) NOT NULL,
  `cost_center_id` int(11) DEFAULT NULL,
  `description` varchar(255) NOT NULL,
  `amount` decimal(15,2) DEFAULT NULL,
  `date` date DEFAULT NULL,
  `attachment` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `faqs`
--

CREATE TABLE `faqs` (
  `id` bigint(20) NOT NULL,
  `question` longtext NOT NULL,
  `answer` longtext NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `faqs`
--

INSERT INTO `faqs` (`id`, `question`, `answer`, `created_at`, `updated_at`) VALUES
(1, 'كيف أطلب خدمة؟', 'يمكنك طلب الخدمة عبر الموقع الإلكتروني أو التطبيق الخاص بنا.', '2025-02-24 00:13:05', '2025-02-24 00:13:05'),
(2, 'ما هي طرق الدفع؟', 'نقبل الدفع عبر بطاقات الائتمان، التحويل البنكي، والمحافظ الإلكترونية.', '2025-02-24 00:13:05', '2025-02-24 00:13:05'),
(3, 'هل يمكنني استرداد الأموال؟', 'نعم، يمكنك استرداد الأموال خلال 14 يومًا وفقًا لسياسة الاسترداد لدينا.', '2025-02-24 00:13:05', '2025-02-24 00:13:05'),
(4, 'كم تستغرق الخدمة؟', 'يعتمد وقت تنفيذ الخدمة على نوعها، ولكننا نعمل على توفيرها بأسرع وقت ممكن.', '2025-02-24 00:13:05', '2025-02-24 00:13:05'),
(5, 'هل يوجد دعم فني؟', 'نعم، يتوفر دعم فني على مدار الساعة من خلال الهاتف، البريد الإلكتروني، والدردشة المباشرة.', '2025-02-24 00:13:05', '2025-02-24 00:13:05'),
(6, 'ما هي خدماتكم؟', 'نقدم مجموعة واسعة من الخدمات، بما في ذلك حلول أنظمة نقاط البيع، إدارة المخزون، الفواتير الإلكترونية، وإدارة العملاء. كما نوفر دعمًا فنيًا متميزًا لضمان أفضل تجربة للمستخدمين.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(7, 'كيف يمكنني التواصل؟', 'يمكنك التواصل معنا عبر الهاتف، البريد الإلكتروني، أو الدردشة المباشرة على موقعنا. كما يمكنك زيارة أقرب فرع لدينا للحصول على المساعدة شخصيًا.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(8, 'هل لديكم تطبيق؟', 'نعم، نوفر تطبيقًا مخصصًا لأنظمة نقاط البيع، والذي يمكنك تحميله من متجر Google Play أو App Store لإدارة عمليات البيع بسهولة من أي مكان.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(9, 'ما هي ساعات العمل؟', 'نحن نعمل على مدار الساعة لتقديم الدعم الفني. أما المكاتب الإدارية، فهي متاحة من الأحد إلى الخميس من الساعة 9:00 صباحًا حتى 6:00 مساءً.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(10, 'كيف يمكنني تقديم شكوى؟', 'يمكنك تقديم شكوى عبر قسم \"الدعم الفني\" في موقعنا، أو عن طريق التواصل مع خدمة العملاء عبر البريد الإلكتروني أو الهاتف. نحن نحرص على مراجعة الشكاوى وحلها في أسرع وقت ممكن.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(11, 'ما هو نظام نقاط البيع (POS)؟', 'نظام نقاط البيع هو برنامج وأجهزة متكاملة تساعد المتاجر والمطاعم والشركات على إدارة عمليات البيع، الدفع، وإدارة المخزون بسهولة وفعالية.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(12, 'ما هي مميزات نظام نقاط البيع؟', 'إدارة المبيعات بسهولة، دعم الفواتير الإلكترونية، تتبع المخزون في الوقت الفعلي، تحليل البيانات والتقارير، دعم وسائل دفع متعددة (بطاقات، نقدي، تحويل بنكي).', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(13, 'هل يدعم النظام الدفع الإلكتروني؟', 'نعم، يدعم النظام الدفع الإلكتروني عبر بطاقات الائتمان، المحافظ الرقمية، وخدمات الدفع عبر QR Code.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(14, 'هل يمكن ربط النظام بالمخزون؟', 'بالتأكيد! يتيح لك النظام تتبع المخزون وإدارته بشكل مباشر، مع إشعارات في حال اقتراب نفاد المنتجات.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(15, 'هل يتطلب النظام اتصالًا دائمًا بالإنترنت؟', 'لا، بعض الأنظمة تدعم العمل دون اتصال بالإنترنت، وعند إعادة الاتصال، يتم مزامنة البيانات تلقائيًا.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(16, 'هل يمكنني استخدام النظام على الهاتف أو التابلت؟', 'نعم، لدينا تطبيق متوافق مع الهواتف الذكية والأجهزة اللوحية لسهولة الاستخدام أثناء التنقل.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(17, 'هل يدعم النظام الفواتير الضريبية؟', 'نعم، يدعم النظام الفواتير الإلكترونية وفقًا للمعايير الضريبية المحلية والدولية.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(18, 'هل يوجد دعم فني؟', 'نعم، نوفر دعمًا فنيًا متاحًا 24/7 عبر الهاتف، البريد الإلكتروني، والدردشة المباشرة.', '2025-02-24 00:15:43', '2025-02-24 00:15:43'),
(19, 'كيف أضيف منتجًا جديدًا إلى النظام؟', 'يمكنك إضافة منتج جديد عبر لوحة التحكم في النظام من خلال قسم \"إدارة المنتجات\"، ثم الضغط على زر \"إضافة منتج جديد\" وإدخال تفاصيل المنتج مثل الاسم، السعر، الفئة، والصورة.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(20, 'كيف يمكنني تعديل أو حذف منتج؟', 'يمكنك تعديل أي منتج عبر الذهاب إلى \"إدارة المنتجات\"، ثم تحديد المنتج المطلوب وتحديث بياناته. لحذف منتج، اضغط على زر الحذف بجوار المنتج، وسيتم إزالته نهائيًا.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(21, 'كيف يمكنني إدارة صلاحيات المستخدمين؟', 'يمكنك إدارة صلاحيات المستخدمين من خلال قسم \"إدارة المستخدمين\"، حيث يمكنك إنشاء مستخدم جديد، تعديل صلاحياته، أو تعطيله. يتيح لك النظام تعيين أدوار مختلفة مثل مدير، موظف مبيعات، أو محاسب.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(22, 'ما هي الصلاحيات المتاحة في النظام؟', 'يمكنك تحديد صلاحيات مختلفة مثل الوصول إلى الفواتير، تعديل المنتجات، الاطلاع على التقارير المالية، أو إدارة المستخدمين. يمكنك تخصيص كل دور وفقًا لاحتياجات العمل.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(23, 'كيف أتحقق من المخزون؟', 'يمكنك التحقق من المخزون من خلال قسم \"إدارة المخزون\"، حيث يعرض لك النظام كمية كل منتج، المنتجات منخفضة الكمية، وإشعارات عند الحاجة إلى إعادة الطلب.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(24, 'كيف يمكنني إنشاء فاتورة جديدة؟', 'لإنشاء فاتورة، انتقل إلى قسم \"إدارة الفواتير\"، ثم اضغط على \"فاتورة جديدة\"، وأضف المنتجات المطلوبة، حدد طريقة الدفع، واضغط على \"إتمام الطلب\".', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(25, 'هل يمكنني طباعة الفواتير؟', 'نعم، يتيح لك النظام طباعة الفواتير مباشرة بعد إنشائها، كما يمكنك إرسالها عبر البريد الإلكتروني أو تحميلها بصيغة PDF.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(26, 'كيف يمكنني إصدار تقارير المبيعات؟', 'يمكنك إصدار تقارير المبيعات من خلال قسم \"التقارير\"، حيث يمكنك تحديد الفترة الزمنية وعرض الإيرادات، عدد الفواتير، والأرباح بشكل مفصل.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(27, 'هل يدعم النظام العملة المحلية؟', 'نعم، يمكنك ضبط العملة المحلية من خلال الإعدادات، كما يمكنك تغييرها إذا كنت تعمل في أكثر من دولة.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(28, 'كيف يمكنني ضبط الضرائب في النظام؟', 'يمكنك تفعيل الضرائب وتحديد نسبتها من خلال الإعدادات، وسيتم احتسابها تلقائيًا في الفواتير وفقًا للنظام الضريبي المحلي.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(29, 'كيف يمكنني استعادة البيانات بعد فقدانها؟', 'يتم حفظ نسخة احتياطية تلقائيًا من البيانات، ويمكنك استعادتها من خلال قسم \"النسخ الاحتياطي\" في الإعدادات.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(30, 'هل يمكنني استخدام النظام من أكثر من جهاز؟', 'نعم، يمكنك تسجيل الدخول إلى النظام من أي جهاز يدعم المتصفح أو من خلال تطبيق الهاتف المحمول.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(31, 'هل يمكن ربط النظام مع الطابعات الحرارية؟', 'نعم، يدعم النظام الطابعات الحرارية لطباعة الفواتير والإيصالات بسهولة.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(32, 'ما هي طرق الدفع المدعومة؟', 'يدعم النظام عدة طرق دفع، بما في ذلك الدفع النقدي، البطاقات البنكية، والمحافظ الرقمية مثل Apple Pay وGoogle Pay.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(33, 'كيف أطلب دعم فني؟', 'يمكنك طلب دعم فني عبر الدردشة المباشرة، الاتصال الهاتفي، أو إرسال بريد إلكتروني إلى فريق الدعم، وسنقوم بالرد عليك في أقرب وقت ممكن.', '2025-02-24 00:18:40', '2025-02-24 00:18:40'),
(34, 'كيف أطلب خدمة؟', 'لطلب خدمة، قم بتسجيل الدخول، ثم اختر الخدمة المطلوبة، واتبع الخطوات لإتمام الطلب.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(35, 'ما هي طرق الدفع؟', 'نقبل الدفع عبر البطاقات الائتمانية، والتحويل البنكي، والمحافظ الإلكترونية.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(36, 'هل يمكنني استرداد الأموال؟', 'نعم، يمكنك طلب استرداد الأموال خلال 7 أيام من الشراء وفقًا لشروط الاسترداد لدينا.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(37, 'كم تستغرق الخدمة؟', 'مدة الخدمة تعتمد على نوعها، وستجد المدة المحددة داخل تفاصيل كل خدمة.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(38, 'هل يوجد دعم فني؟', 'نعم، لدينا دعم فني متاح 24/7 لمساعدتك في أي مشكلة تواجهها.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(39, 'ما هي خدماتكم؟', 'نقدم مجموعة من الخدمات تشمل إدارة نقاط البيع، التقارير المالية، وإدارة المخزون.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(40, 'كيف يمكنني التواصل؟', 'يمكنك التواصل معنا عبر الهاتف، البريد الإلكتروني، أو الدردشة المباشرة.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(41, 'هل لديكم تطبيق؟', 'نعم، لدينا تطبيق متاح على App Store و Google Play.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(42, 'ما هي ساعات العمل؟', 'نحن نعمل من الساعة 9 صباحًا حتى 9 مساءً يوميًا.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(43, 'كيف يمكنني تقديم شكوى؟', 'يمكنك تقديم شكوى عبر نموذج التواصل أو عبر البريد الإلكتروني الخاص بالدعم.', '2025-02-24 00:21:58', '2025-02-24 00:21:58'),
(44, 'كيف يمكنني إضافة دليل محاسبي جديد؟', 'يمكنك إضافة دليل محاسبي جديد من خلال الذهاب إلى قسم \"إضافة دليل محاسبي جديد\" في القائمة الجانبية.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(45, 'كيف يمكنني عرض قائمة الحسابات؟', 'يمكنك عرض قائمة الحسابات بالانتقال إلى \"أرصدة الحسابات\" ضمن القائمة الجانبية.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(46, 'ما هي طريقة إضافة الأرصدة الافتتاحية؟', 'لإضافة الأرصدة الافتتاحية، انتقل إلى قسم \"الأرصدة الافتتاحية\" وأدخل البيانات المطلوبة.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(47, 'كيف يمكنني عرض تقرير الأصول الثابتة؟', 'لرؤية تقرير الأصول الثابتة، اضغط على \"تقرير أصول ثابتة\" في القائمة الجانبية.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(48, 'كيف أضيف مصروفات جديدة؟', 'لإضافة مصروفات جديدة، انتقل إلى \"تقرير مصروفات\" وأدخل التفاصيل المطلوبة.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(49, 'كيف يمكنني مراجعة المرتبات؟', 'يمكنك مراجعة المرتبات عبر قسم \"مراجعة المرتبات\" في القائمة الجانبية.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(50, 'ما هي طريقة دفع الرواتب؟', 'للدفع، انتقل إلى \"دفع مرتب\"، وأدخل بيانات الموظف والمبلغ المستحق.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(51, 'كيف أضيف دخل جديد؟', 'يمكنك إضافة دخل جديد من خلال \"تقرير الإيرادات\" في القائمة الجانبية.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(52, 'كيف يمكنني تحويل الأموال بين الحسابات؟', 'يمكنك إجراء التحويلات المالية من خلال \"تقرير التحويلات بين الحسابات\".', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(53, 'أين يمكنني رؤية كشف الحساب؟', 'يمكنك رؤية كشف الحساب عبر \"قائمة المعاملات\" التي تعرض جميع العمليات المالية الخاصة بك.', '2025-02-24 01:07:39', '2025-02-24 01:07:39'),
(54, 'كيف يمكنني تسجيل سند صرف؟', 'يمكنك تسجيل سند الصرف من خلال \"سندات الصرف\"، وإدخال التفاصيل الخاصة بالعملية المالية.', '2025-02-24 01:08:58', '2025-02-24 01:08:58'),
(55, 'ما الفرق بين سند الصرف وسند القبض؟', 'سند الصرف هو مستند مالي يتم إصداره عند دفع مبلغ مالي، بينما سند القبض يستخدم لتوثيق استلام الأموال.', '2025-02-24 01:08:58', '2025-02-24 01:08:58'),
(56, 'كيف يمكنني الاطلاع على جميع السندات المالية؟', 'يمكنك الاطلاع على جميع السندات المالية من خلال قسم \"سندات الصرف\" و \"سندات القبض\".', '2025-02-24 01:08:58', '2025-02-24 01:08:58'),
(57, 'هل يمكنني إلغاء سند مالي تم تسجيله بالخطأ؟', 'يمكنك إلغاء السند المالي قبل اعتماده، ولكن بعد الاعتماد يجب الرجوع إلى المسؤول المالي لإجراء التعديلات.', '2025-02-24 01:08:58', '2025-02-24 01:08:58'),
(58, 'كيف يمكنني تحويل الأموال بين الحسابات؟', 'لتحويل الأموال، انتقل إلى \"تقرير التحويلات بين الحسابات\" وأدخل التفاصيل المطلوبة.', '2025-02-24 01:08:58', '2025-02-24 01:08:58'),
(59, 'كيف يمكنني إضافة مخزن جديد؟', 'لإضافة مخزن جديد، انتقل إلى \"قائمة الخزن\" ثم اختر \"إضافة مخزن جديد\" وأدخل التفاصيل المطلوبة.', '2025-02-24 01:09:09', '2025-02-24 01:09:09'),
(60, 'كيف يمكنني تعديل بيانات المخزن؟', 'يمكنك تعديل بيانات المخزن عبر \"قائمة الخزن\" واختيار المخزن الذي تريد تحديث بياناته.', '2025-02-24 01:09:09', '2025-02-24 01:09:09'),
(61, 'كيف يتم تسجيل المنتجات داخل المخزن؟', 'يمكنك تسجيل المنتجات داخل المخزن عبر قسم \"إدارة المخزون\"، حيث يتم إدخال التفاصيل لكل منتج.', '2025-02-24 01:09:09', '2025-02-24 01:09:09'),
(62, 'كيف يمكنني تتبع كمية المخزون المتاحة؟', 'يمكنك معرفة كمية المخزون المتاحة من خلال صفحة \"إدارة المخزون\"، حيث يتم عرض الكميات الحالية لكل منتج.', '2025-02-24 01:09:09', '2025-02-24 01:09:09'),
(63, 'ما هي طريقة استخراج تقرير بالمخزون؟', 'يمكنك استخراج تقرير بالمخزون من خلال \"تقرير المخزون\"، حيث يمكنك تصفية البيانات وتنزيل التقرير.', '2025-02-24 01:09:09', '2025-02-24 01:09:09'),
(64, 'كيف يمكنني إضافة مرتب جديد للموظفين؟', 'يمكنك إضافة مرتب جديد عبر قسم \"دفع مرتب\"، ثم اختيار الموظف وإدخال المبلغ المستحق.', '2025-02-24 01:09:22', '2025-02-24 01:09:22'),
(65, 'كيف يتم حساب المرتبات في النظام؟', 'يتم حساب المرتبات بناءً على البيانات المدخلة في النظام، مثل الراتب الأساسي والخصومات والإضافات.', '2025-02-24 01:09:22', '2025-02-24 01:09:22'),
(66, 'كيف يمكنني مراجعة المرتبات؟', 'يمكنك مراجعة المرتبات من خلال \"مراجعة المرتبات\" حيث يتم عرض جميع المدفوعات السابقة.', '2025-02-24 01:09:22', '2025-02-24 01:09:22'),
(67, 'هل يمكنني تعديل بيانات المرتب بعد تسجيله؟', 'نعم، يمكنك تعديل المرتب قبل اعتماده نهائيًا، ولكن بعد الصرف لا يمكن التعديل إلا من خلال سجل المعاملات.', '2025-02-24 01:09:22', '2025-02-24 01:09:22'),
(68, 'كيف يمكنني استخراج تقرير الرواتب؟', 'يمكنك استخراج تقرير الرواتب عبر \"مراجعة المرتبات\"، حيث يمكنك تحميل البيانات بتنسيق Excel أو PDF.', '2025-02-24 01:09:22', '2025-02-24 01:09:22'),
(69, 'هل يمكنني تصفية المرتبات حسب الموظف؟', 'نعم، يمكنك البحث عن المرتب باستخدام اسم الموظف أو رقمه الوظيفي.', '2025-02-24 01:09:22', '2025-02-24 01:09:22'),
(70, 'ما هي طريقة تسجيل البدلات والمكافآت؟', 'يمكنك إضافة البدلات والمكافآت من خلال قسم \"دفع مرتب\" أو من إعدادات الحساب الوظيفي للموظف.', '2025-02-24 01:09:22', '2025-02-24 01:09:22'),
(71, 'كيف يمكنني إنشاء حساب جديد في النظام؟', 'يمكنك إنشاء حساب جديد من خلال الانتقال إلى \"إضافة دليل محاسبي جديد\" وإدخال البيانات المطلوبة.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(72, 'ما هي طريقة تعديل بيانات الحساب؟', 'يمكنك تعديل بيانات الحساب عبر قسم \"أرصدة الحسابات\" ثم اختيار الحساب المطلوب تحديثه.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(73, 'كيف يمكنني معرفة الرصيد الافتتاحي للحسابات؟', 'لرؤية الأرصدة الافتتاحية، انتقل إلى \"الأرصدة الافتتاحية\" من القائمة الجانبية.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(74, 'كيف يتم تسجيل الأرصدة الافتتاحية؟', 'يمكنك تسجيل الأرصدة الافتتاحية عند إنشاء الحساب أو من خلال قسم \"إضافة الأرصدة الافتتاحية\".', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(75, 'كيف يتم إضافة المصروفات إلى النظام؟', 'يمكنك إضافة المصروفات عبر \"تقرير مصروفات\"، وإدخال التفاصيل المطلوبة وحفظها.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(76, 'هل يمكنني تعديل أو حذف المصروفات؟', 'نعم، يمكنك تعديل أو حذف المصروفات عبر \"تقرير مصروفات\" ثم اختيار العملية التي تريد تنفيذها.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(77, 'ما هي طريقة تسجيل الإيرادات الجديدة؟', 'يمكنك تسجيل الإيرادات من خلال قسم \"تقرير الإيرادات\"، وإدخال البيانات المطلوبة.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(78, 'كيف يمكنني تحويل الأموال بين الحسابات؟', 'لتحويل الأموال، انتقل إلى \"تقرير التحويلات بين الحسابات\" وأدخل التفاصيل المطلوبة.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(79, 'كيف يمكنني الاطلاع على كشف الحساب؟', 'يمكنك الاطلاع على كشف الحساب عبر \"قائمة المعاملات\" التي تعرض جميع العمليات المالية.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(80, 'هل يمكنني تصفية المعاملات حسب التاريخ؟', 'نعم، يمكنك تحديد فترة زمنية محددة في \"كشف الحساب\" للحصول على البيانات المطلوبة.', '2025-02-24 01:09:42', '2025-02-24 01:09:42'),
(81, 'ما هو Apl Documentation؟', 'Apl Documentation هو جزء من نظام ERP يتيح لك إدارة ومتابعة Apl Documentation بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(82, 'ما هو أرصدة الأصناف؟', 'أرصدة الأصناف هو جزء من نظام ERP يتيح لك إدارة ومتابعة أرصدة الأصناف بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(83, 'ما هو أرصدة العملاء؟', 'أرصدة العملاء هو جزء من نظام ERP يتيح لك إدارة ومتابعة أرصدة العملاء بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(84, 'ما هو أرصدة الموردين؟', 'أرصدة الموردين هو جزء من نظام ERP يتيح لك إدارة ومتابعة أرصدة الموردين بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(85, 'ما هو أسعار صرف العملات؟', 'أسعار صرف العملات هو جزء من نظام ERP يتيح لك إدارة ومتابعة أسعار صرف العملات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(86, 'ما هو إعدادات النظام؟', 'إعدادات النظام هو جزء من نظام ERP يتيح لك إدارة ومتابعة إعدادات النظام بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(87, 'ما هو التحديثات؟', 'التحديثات هو جزء من نظام ERP يتيح لك إدارة ومتابعة التحديثات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(88, 'ما هو الحسابات؟', 'الحسابات هو جزء من نظام ERP يتيح لك إدارة ومتابعة الحسابات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(89, 'ما هو الرسائل والإشعارات؟', 'الرسائل والإشعارات هو جزء من نظام ERP يتيح لك إدارة ومتابعة الرسائل والإشعارات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(90, 'ما هو العروض والتخفيضات؟', 'العروض والتخفيضات هو جزء من نظام ERP يتيح لك إدارة ومتابعة العروض والتخفيضات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(91, 'ما هو العملاء والموردين؟', 'العملاء والموردين هو جزء من نظام ERP يتيح لك إدارة ومتابعة العملاء والموردين بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(92, 'ما هو العملات؟', 'العملات هو جزء من نظام ERP يتيح لك إدارة ومتابعة العملات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(93, 'ما هو القيود اليومية؟', 'القيود اليومية هو جزء من نظام ERP يتيح لك إدارة ومتابعة القيود اليومية بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(94, 'ما هو المركز المالي؟', 'المركز المالي هو جزء من نظام ERP يتيح لك إدارة ومتابعة المركز المالي بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(95, 'ما هو المستخدمين والكاشير؟', 'المستخدمين والكاشير هو جزء من نظام ERP يتيح لك إدارة ومتابعة المستخدمين والكاشير بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(96, 'ما هو النظام المحاسبي؟', 'النظام المحاسبي هو جزء من نظام ERP يتيح لك إدارة ومتابعة النظام المحاسبي بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(97, 'ما هو اهتلاكات الأصول؟', 'اهتلاكات الأصول هو جزء من نظام ERP يتيح لك إدارة ومتابعة اهتلاكات الأصول بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(98, 'ما هو تحويلات المخازن؟', 'تحويلات المخازن هو جزء من نظام ERP يتيح لك إدارة ومتابعة تحويلات المخازن بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(99, 'ما هو تصميم قوالب الفواتير؟', 'تصميم قوالب الفواتير هو جزء من نظام ERP يتيح لك إدارة ومتابعة تصميم قوالب الفواتير بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(100, 'ما هو تطبيق خاص المناديب؟', 'تطبيق خاص المناديب هو جزء من نظام ERP يتيح لك إدارة ومتابعة تطبيق خاص المناديب بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(101, 'ما هو تقارير مالية وإحصائية؟', 'تقارير مالية وإحصائية هو جزء من نظام ERP يتيح لك إدارة ومتابعة تقارير مالية وإحصائية بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(102, 'ما هو سندات التحويل؟', 'سندات التحويل هو جزء من نظام ERP يتيح لك إدارة ومتابعة سندات التحويل بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(103, 'ما هو سندات الصرف؟', 'سندات الصرف هو جزء من نظام ERP يتيح لك إدارة ومتابعة سندات الصرف بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(104, 'ما هو سندات القبض؟', 'سندات القبض هو جزء من نظام ERP يتيح لك إدارة ومتابعة سندات القبض بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(105, 'ما هو شجرة الحسابات؟', 'شجرة الحسابات هو جزء من نظام ERP يتيح لك إدارة ومتابعة شجرة الحسابات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(106, 'ما هو طرق الدفع؟', 'طرق الدفع هو جزء من نظام ERP يتيح لك إدارة ومتابعة طرق الدفع بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(107, 'ما هو قائمة الدخل؟', 'قائمة الدخل هو جزء من نظام ERP يتيح لك إدارة ومتابعة قائمة الدخل بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(108, 'ما هو مراكز التكلفة؟', 'مراكز التكلفة هو جزء من نظام ERP يتيح لك إدارة ومتابعة مراكز التكلفة بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(109, 'ما هو مركز التكلفة؟', 'مركز التكلفة هو جزء من نظام ERP يتيح لك إدارة ومتابعة مركز التكلفة بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(110, 'ما هو ميزان المراجعة؟', 'ميزان المراجعة هو جزء من نظام ERP يتيح لك إدارة ومتابعة ميزان المراجعة بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(111, 'ما هو نظام إدارة المهام والمشاريع؟', 'نظام إدارة المهام والمشاريع هو جزء من نظام ERP يتيح لك إدارة ومتابعة نظام إدارة المهام والمشاريع بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(112, 'ما هو نظام الاقساط؟', 'نظام الاقساط هو جزء من نظام ERP يتيح لك إدارة ومتابعة نظام الاقساط بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(113, 'ما هو نظام المبيعات؟', 'نظام المبيعات هو جزء من نظام ERP يتيح لك إدارة ومتابعة نظام المبيعات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(114, 'ما هو نظام المخزون؟', 'نظام المخزون هو جزء من نظام ERP يتيح لك إدارة ومتابعة نظام المخزون بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(115, 'ما هو نظام المشتريات؟', 'نظام المشتريات هو جزء من نظام ERP يتيح لك إدارة ومتابعة نظام المشتريات بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(116, 'ما هو نظام شؤون الموظفين HR؟', 'نظام شؤون الموظفين HR هو جزء من نظام ERP يتيح لك إدارة ومتابعة نظام شؤون الموظفين HR بطريقة فعالة وسهلة.', '2025-04-23 11:32:03', '2025-04-23 11:32:03'),
(117, 'ما هو Apl Documentation في نظام ERP؟', 'Apl Documentation هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ Apl Documentation بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(118, 'كيف أستخدم Apl Documentation بشكل فعال؟', 'يمكنك استخدام Apl Documentation من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(119, 'ما الفائدة من استخدام Apl Documentation؟', 'يساعد Apl Documentation في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(120, 'أين يمكنني العثور على إعدادات Apl Documentation؟', 'تجد إعدادات Apl Documentation ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(121, 'هل يمكن تخصيص Apl Documentation حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص Apl Documentation من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(122, 'ما هو أرصدة الأصناف في نظام ERP؟', 'أرصدة الأصناف هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ أرصدة الأصناف بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(123, 'كيف أستخدم أرصدة الأصناف بشكل فعال؟', 'يمكنك استخدام أرصدة الأصناف من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(124, 'ما الفائدة من استخدام أرصدة الأصناف؟', 'يساعد أرصدة الأصناف في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(125, 'أين يمكنني العثور على إعدادات أرصدة الأصناف؟', 'تجد إعدادات أرصدة الأصناف ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(126, 'هل يمكن تخصيص أرصدة الأصناف حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص أرصدة الأصناف من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(127, 'ما هو أرصدة العملاء في نظام ERP؟', 'أرصدة العملاء هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ أرصدة العملاء بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(128, 'كيف أستخدم أرصدة العملاء بشكل فعال؟', 'يمكنك استخدام أرصدة العملاء من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(129, 'ما الفائدة من استخدام أرصدة العملاء؟', 'يساعد أرصدة العملاء في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(130, 'أين يمكنني العثور على إعدادات أرصدة العملاء؟', 'تجد إعدادات أرصدة العملاء ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(131, 'هل يمكن تخصيص أرصدة العملاء حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص أرصدة العملاء من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(132, 'ما هو أرصدة الموردين في نظام ERP؟', 'أرصدة الموردين هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ أرصدة الموردين بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(133, 'كيف أستخدم أرصدة الموردين بشكل فعال؟', 'يمكنك استخدام أرصدة الموردين من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(134, 'ما الفائدة من استخدام أرصدة الموردين؟', 'يساعد أرصدة الموردين في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(135, 'أين يمكنني العثور على إعدادات أرصدة الموردين؟', 'تجد إعدادات أرصدة الموردين ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(136, 'هل يمكن تخصيص أرصدة الموردين حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص أرصدة الموردين من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(137, 'ما هو أسعار صرف العملات في نظام ERP؟', 'أسعار صرف العملات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ أسعار صرف العملات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(138, 'كيف أستخدم أسعار صرف العملات بشكل فعال؟', 'يمكنك استخدام أسعار صرف العملات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(139, 'ما الفائدة من استخدام أسعار صرف العملات؟', 'يساعد أسعار صرف العملات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(140, 'أين يمكنني العثور على إعدادات أسعار صرف العملات؟', 'تجد إعدادات أسعار صرف العملات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(141, 'هل يمكن تخصيص أسعار صرف العملات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص أسعار صرف العملات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(142, 'ما هو إعدادات النظام في نظام ERP؟', 'إعدادات النظام هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ إعدادات النظام بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(143, 'كيف أستخدم إعدادات النظام بشكل فعال؟', 'يمكنك استخدام إعدادات النظام من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(144, 'ما الفائدة من استخدام إعدادات النظام؟', 'يساعد إعدادات النظام في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(145, 'أين يمكنني العثور على إعدادات إعدادات النظام؟', 'تجد إعدادات إعدادات النظام ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(146, 'هل يمكن تخصيص إعدادات النظام حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص إعدادات النظام من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(147, 'ما هو التحديثات في نظام ERP؟', 'التحديثات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ التحديثات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(148, 'كيف أستخدم التحديثات بشكل فعال؟', 'يمكنك استخدام التحديثات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(149, 'ما الفائدة من استخدام التحديثات؟', 'يساعد التحديثات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(150, 'أين يمكنني العثور على إعدادات التحديثات؟', 'تجد إعدادات التحديثات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(151, 'هل يمكن تخصيص التحديثات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص التحديثات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(152, 'ما هو الحسابات في نظام ERP؟', 'الحسابات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ الحسابات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(153, 'كيف أستخدم الحسابات بشكل فعال؟', 'يمكنك استخدام الحسابات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(154, 'ما الفائدة من استخدام الحسابات؟', 'يساعد الحسابات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(155, 'أين يمكنني العثور على إعدادات الحسابات؟', 'تجد إعدادات الحسابات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(156, 'هل يمكن تخصيص الحسابات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص الحسابات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(157, 'ما هو الرسائل والإشعارات في نظام ERP؟', 'الرسائل والإشعارات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ الرسائل والإشعارات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(158, 'كيف أستخدم الرسائل والإشعارات بشكل فعال؟', 'يمكنك استخدام الرسائل والإشعارات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(159, 'ما الفائدة من استخدام الرسائل والإشعارات؟', 'يساعد الرسائل والإشعارات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(160, 'أين يمكنني العثور على إعدادات الرسائل والإشعارات؟', 'تجد إعدادات الرسائل والإشعارات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(161, 'هل يمكن تخصيص الرسائل والإشعارات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص الرسائل والإشعارات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(162, 'ما هو العروض والتخفيضات في نظام ERP؟', 'العروض والتخفيضات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ العروض والتخفيضات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(163, 'كيف أستخدم العروض والتخفيضات بشكل فعال؟', 'يمكنك استخدام العروض والتخفيضات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(164, 'ما الفائدة من استخدام العروض والتخفيضات؟', 'يساعد العروض والتخفيضات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(165, 'أين يمكنني العثور على إعدادات العروض والتخفيضات؟', 'تجد إعدادات العروض والتخفيضات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(166, 'هل يمكن تخصيص العروض والتخفيضات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص العروض والتخفيضات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(167, 'ما هو العملاء والموردين في نظام ERP؟', 'العملاء والموردين هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ العملاء والموردين بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(168, 'كيف أستخدم العملاء والموردين بشكل فعال؟', 'يمكنك استخدام العملاء والموردين من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(169, 'ما الفائدة من استخدام العملاء والموردين؟', 'يساعد العملاء والموردين في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(170, 'أين يمكنني العثور على إعدادات العملاء والموردين؟', 'تجد إعدادات العملاء والموردين ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(171, 'هل يمكن تخصيص العملاء والموردين حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص العملاء والموردين من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(172, 'ما هو العملات في نظام ERP؟', 'العملات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ العملات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(173, 'كيف أستخدم العملات بشكل فعال؟', 'يمكنك استخدام العملات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(174, 'ما الفائدة من استخدام العملات؟', 'يساعد العملات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(175, 'أين يمكنني العثور على إعدادات العملات؟', 'تجد إعدادات العملات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(176, 'هل يمكن تخصيص العملات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص العملات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(177, 'ما هو القيود اليومية في نظام ERP؟', 'القيود اليومية هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ القيود اليومية بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(178, 'كيف أستخدم القيود اليومية بشكل فعال؟', 'يمكنك استخدام القيود اليومية من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(179, 'ما الفائدة من استخدام القيود اليومية؟', 'يساعد القيود اليومية في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(180, 'أين يمكنني العثور على إعدادات القيود اليومية؟', 'تجد إعدادات القيود اليومية ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(181, 'هل يمكن تخصيص القيود اليومية حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص القيود اليومية من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(182, 'ما هو المركز المالي في نظام ERP؟', 'المركز المالي هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ المركز المالي بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(183, 'كيف أستخدم المركز المالي بشكل فعال؟', 'يمكنك استخدام المركز المالي من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(184, 'ما الفائدة من استخدام المركز المالي؟', 'يساعد المركز المالي في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(185, 'أين يمكنني العثور على إعدادات المركز المالي؟', 'تجد إعدادات المركز المالي ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(186, 'هل يمكن تخصيص المركز المالي حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص المركز المالي من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(187, 'ما هو المستخدمين والكاشير في نظام ERP؟', 'المستخدمين والكاشير هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ المستخدمين والكاشير بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(188, 'كيف أستخدم المستخدمين والكاشير بشكل فعال؟', 'يمكنك استخدام المستخدمين والكاشير من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(189, 'ما الفائدة من استخدام المستخدمين والكاشير؟', 'يساعد المستخدمين والكاشير في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(190, 'أين يمكنني العثور على إعدادات المستخدمين والكاشير؟', 'تجد إعدادات المستخدمين والكاشير ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(191, 'هل يمكن تخصيص المستخدمين والكاشير حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص المستخدمين والكاشير من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(192, 'ما هو النظام المحاسبي في نظام ERP؟', 'النظام المحاسبي هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ النظام المحاسبي بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(193, 'كيف أستخدم النظام المحاسبي بشكل فعال؟', 'يمكنك استخدام النظام المحاسبي من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(194, 'ما الفائدة من استخدام النظام المحاسبي؟', 'يساعد النظام المحاسبي في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(195, 'أين يمكنني العثور على إعدادات النظام المحاسبي؟', 'تجد إعدادات النظام المحاسبي ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(196, 'هل يمكن تخصيص النظام المحاسبي حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص النظام المحاسبي من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(197, 'ما هو اهتلاكات الأصول في نظام ERP؟', 'اهتلاكات الأصول هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ اهتلاكات الأصول بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(198, 'كيف أستخدم اهتلاكات الأصول بشكل فعال؟', 'يمكنك استخدام اهتلاكات الأصول من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(199, 'ما الفائدة من استخدام اهتلاكات الأصول؟', 'يساعد اهتلاكات الأصول في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(200, 'أين يمكنني العثور على إعدادات اهتلاكات الأصول؟', 'تجد إعدادات اهتلاكات الأصول ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(201, 'هل يمكن تخصيص اهتلاكات الأصول حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص اهتلاكات الأصول من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(202, 'ما هو تحويلات المخازن في نظام ERP؟', 'تحويلات المخازن هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ تحويلات المخازن بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(203, 'كيف أستخدم تحويلات المخازن بشكل فعال؟', 'يمكنك استخدام تحويلات المخازن من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(204, 'ما الفائدة من استخدام تحويلات المخازن؟', 'يساعد تحويلات المخازن في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(205, 'أين يمكنني العثور على إعدادات تحويلات المخازن؟', 'تجد إعدادات تحويلات المخازن ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(206, 'هل يمكن تخصيص تحويلات المخازن حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص تحويلات المخازن من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(207, 'ما هو تصميم قوالب الفواتير في نظام ERP؟', 'تصميم قوالب الفواتير هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ تصميم قوالب الفواتير بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(208, 'كيف أستخدم تصميم قوالب الفواتير بشكل فعال؟', 'يمكنك استخدام تصميم قوالب الفواتير من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(209, 'ما الفائدة من استخدام تصميم قوالب الفواتير؟', 'يساعد تصميم قوالب الفواتير في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(210, 'أين يمكنني العثور على إعدادات تصميم قوالب الفواتير؟', 'تجد إعدادات تصميم قوالب الفواتير ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(211, 'هل يمكن تخصيص تصميم قوالب الفواتير حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص تصميم قوالب الفواتير من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(212, 'ما هو تطبيق خاص المناديب في نظام ERP؟', 'تطبيق خاص المناديب هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ تطبيق خاص المناديب بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(213, 'كيف أستخدم تطبيق خاص المناديب بشكل فعال؟', 'يمكنك استخدام تطبيق خاص المناديب من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(214, 'ما الفائدة من استخدام تطبيق خاص المناديب؟', 'يساعد تطبيق خاص المناديب في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(215, 'أين يمكنني العثور على إعدادات تطبيق خاص المناديب؟', 'تجد إعدادات تطبيق خاص المناديب ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(216, 'هل يمكن تخصيص تطبيق خاص المناديب حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص تطبيق خاص المناديب من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(217, 'ما هو تقارير مالية وإحصائية في نظام ERP؟', 'تقارير مالية وإحصائية هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ تقارير مالية وإحصائية بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(218, 'كيف أستخدم تقارير مالية وإحصائية بشكل فعال؟', 'يمكنك استخدام تقارير مالية وإحصائية من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(219, 'ما الفائدة من استخدام تقارير مالية وإحصائية؟', 'يساعد تقارير مالية وإحصائية في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(220, 'أين يمكنني العثور على إعدادات تقارير مالية وإحصائية؟', 'تجد إعدادات تقارير مالية وإحصائية ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(221, 'هل يمكن تخصيص تقارير مالية وإحصائية حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص تقارير مالية وإحصائية من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(222, 'ما هو سندات التحويل في نظام ERP؟', 'سندات التحويل هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ سندات التحويل بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(223, 'كيف أستخدم سندات التحويل بشكل فعال؟', 'يمكنك استخدام سندات التحويل من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(224, 'ما الفائدة من استخدام سندات التحويل؟', 'يساعد سندات التحويل في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(225, 'أين يمكنني العثور على إعدادات سندات التحويل؟', 'تجد إعدادات سندات التحويل ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(226, 'هل يمكن تخصيص سندات التحويل حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص سندات التحويل من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(227, 'ما هو سندات الصرف في نظام ERP؟', 'سندات الصرف هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ سندات الصرف بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(228, 'كيف أستخدم سندات الصرف بشكل فعال؟', 'يمكنك استخدام سندات الصرف من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(229, 'ما الفائدة من استخدام سندات الصرف؟', 'يساعد سندات الصرف في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(230, 'أين يمكنني العثور على إعدادات سندات الصرف؟', 'تجد إعدادات سندات الصرف ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(231, 'هل يمكن تخصيص سندات الصرف حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص سندات الصرف من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(232, 'ما هو سندات القبض في نظام ERP؟', 'سندات القبض هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ سندات القبض بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(233, 'كيف أستخدم سندات القبض بشكل فعال؟', 'يمكنك استخدام سندات القبض من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(234, 'ما الفائدة من استخدام سندات القبض؟', 'يساعد سندات القبض في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(235, 'أين يمكنني العثور على إعدادات سندات القبض؟', 'تجد إعدادات سندات القبض ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(236, 'هل يمكن تخصيص سندات القبض حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص سندات القبض من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(237, 'ما هو شجرة الحسابات في نظام ERP؟', 'شجرة الحسابات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ شجرة الحسابات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(238, 'كيف أستخدم شجرة الحسابات بشكل فعال؟', 'يمكنك استخدام شجرة الحسابات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(239, 'ما الفائدة من استخدام شجرة الحسابات؟', 'يساعد شجرة الحسابات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(240, 'أين يمكنني العثور على إعدادات شجرة الحسابات؟', 'تجد إعدادات شجرة الحسابات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(241, 'هل يمكن تخصيص شجرة الحسابات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص شجرة الحسابات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(242, 'ما هو طرق الدفع في نظام ERP؟', 'طرق الدفع هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ طرق الدفع بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(243, 'كيف أستخدم طرق الدفع بشكل فعال؟', 'يمكنك استخدام طرق الدفع من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(244, 'ما الفائدة من استخدام طرق الدفع؟', 'يساعد طرق الدفع في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(245, 'أين يمكنني العثور على إعدادات طرق الدفع؟', 'تجد إعدادات طرق الدفع ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(246, 'هل يمكن تخصيص طرق الدفع حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص طرق الدفع من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(247, 'ما هو قائمة الدخل في نظام ERP؟', 'قائمة الدخل هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ قائمة الدخل بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(248, 'كيف أستخدم قائمة الدخل بشكل فعال؟', 'يمكنك استخدام قائمة الدخل من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(249, 'ما الفائدة من استخدام قائمة الدخل؟', 'يساعد قائمة الدخل في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(250, 'أين يمكنني العثور على إعدادات قائمة الدخل؟', 'تجد إعدادات قائمة الدخل ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(251, 'هل يمكن تخصيص قائمة الدخل حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص قائمة الدخل من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(252, 'ما هو مراكز التكلفة في نظام ERP؟', 'مراكز التكلفة هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ مراكز التكلفة بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(253, 'كيف أستخدم مراكز التكلفة بشكل فعال؟', 'يمكنك استخدام مراكز التكلفة من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(254, 'ما الفائدة من استخدام مراكز التكلفة؟', 'يساعد مراكز التكلفة في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(255, 'أين يمكنني العثور على إعدادات مراكز التكلفة؟', 'تجد إعدادات مراكز التكلفة ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(256, 'هل يمكن تخصيص مراكز التكلفة حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص مراكز التكلفة من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(257, 'ما هو مركز التكلفة في نظام ERP؟', 'مركز التكلفة هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ مركز التكلفة بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07');
INSERT INTO `faqs` (`id`, `question`, `answer`, `created_at`, `updated_at`) VALUES
(258, 'كيف أستخدم مركز التكلفة بشكل فعال؟', 'يمكنك استخدام مركز التكلفة من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(259, 'ما الفائدة من استخدام مركز التكلفة؟', 'يساعد مركز التكلفة في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(260, 'أين يمكنني العثور على إعدادات مركز التكلفة؟', 'تجد إعدادات مركز التكلفة ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(261, 'هل يمكن تخصيص مركز التكلفة حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص مركز التكلفة من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(262, 'ما هو ميزان المراجعة في نظام ERP؟', 'ميزان المراجعة هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ ميزان المراجعة بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(263, 'كيف أستخدم ميزان المراجعة بشكل فعال؟', 'يمكنك استخدام ميزان المراجعة من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(264, 'ما الفائدة من استخدام ميزان المراجعة؟', 'يساعد ميزان المراجعة في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(265, 'أين يمكنني العثور على إعدادات ميزان المراجعة؟', 'تجد إعدادات ميزان المراجعة ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(266, 'هل يمكن تخصيص ميزان المراجعة حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص ميزان المراجعة من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(267, 'ما هو نظام إدارة المهام والمشاريع في نظام ERP؟', 'نظام إدارة المهام والمشاريع هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام إدارة المهام والمشاريع بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(268, 'كيف أستخدم نظام إدارة المهام والمشاريع بشكل فعال؟', 'يمكنك استخدام نظام إدارة المهام والمشاريع من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(269, 'ما الفائدة من استخدام نظام إدارة المهام والمشاريع؟', 'يساعد نظام إدارة المهام والمشاريع في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(270, 'أين يمكنني العثور على إعدادات نظام إدارة المهام والمشاريع؟', 'تجد إعدادات نظام إدارة المهام والمشاريع ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(271, 'هل يمكن تخصيص نظام إدارة المهام والمشاريع حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص نظام إدارة المهام والمشاريع من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(272, 'ما هو نظام الاقساط في نظام ERP؟', 'نظام الاقساط هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام الاقساط بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(273, 'كيف أستخدم نظام الاقساط بشكل فعال؟', 'يمكنك استخدام نظام الاقساط من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(274, 'ما الفائدة من استخدام نظام الاقساط؟', 'يساعد نظام الاقساط في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(275, 'أين يمكنني العثور على إعدادات نظام الاقساط؟', 'تجد إعدادات نظام الاقساط ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(276, 'هل يمكن تخصيص نظام الاقساط حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص نظام الاقساط من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(277, 'ما هو نظام المبيعات في نظام ERP؟', 'نظام المبيعات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام المبيعات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(278, 'كيف أستخدم نظام المبيعات بشكل فعال؟', 'يمكنك استخدام نظام المبيعات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(279, 'ما الفائدة من استخدام نظام المبيعات؟', 'يساعد نظام المبيعات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(280, 'أين يمكنني العثور على إعدادات نظام المبيعات؟', 'تجد إعدادات نظام المبيعات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(281, 'هل يمكن تخصيص نظام المبيعات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص نظام المبيعات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(282, 'ما هو نظام المخزون في نظام ERP؟', 'نظام المخزون هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام المخزون بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(283, 'كيف أستخدم نظام المخزون بشكل فعال؟', 'يمكنك استخدام نظام المخزون من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(284, 'ما الفائدة من استخدام نظام المخزون؟', 'يساعد نظام المخزون في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(285, 'أين يمكنني العثور على إعدادات نظام المخزون؟', 'تجد إعدادات نظام المخزون ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(286, 'هل يمكن تخصيص نظام المخزون حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص نظام المخزون من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(287, 'ما هو نظام المشتريات في نظام ERP؟', 'نظام المشتريات هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام المشتريات بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(288, 'كيف أستخدم نظام المشتريات بشكل فعال؟', 'يمكنك استخدام نظام المشتريات من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(289, 'ما الفائدة من استخدام نظام المشتريات؟', 'يساعد نظام المشتريات في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(290, 'أين يمكنني العثور على إعدادات نظام المشتريات؟', 'تجد إعدادات نظام المشتريات ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(291, 'هل يمكن تخصيص نظام المشتريات حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص نظام المشتريات من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(292, 'ما هو نظام شؤون الموظفين HR في نظام ERP؟', 'نظام شؤون الموظفين HR هو مكون رئيسي في نظام ERP يساعد على تنظيم وإدارة العمليات المتعلقة بـ نظام شؤون الموظفين HR بطريقة منظمة وآلية.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(293, 'كيف أستخدم نظام شؤون الموظفين HR بشكل فعال؟', 'يمكنك استخدام نظام شؤون الموظفين HR من خلال لوحة التحكم، حيث توفر واجهات سهلة الاستخدام لإدخال البيانات وعرض التقارير.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(294, 'ما الفائدة من استخدام نظام شؤون الموظفين HR؟', 'يساعد نظام شؤون الموظفين HR في تحسين الكفاءة وتقليل الأخطاء من خلال التشغيل الآلي والتكامل مع باقي مكونات النظام.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(295, 'أين يمكنني العثور على إعدادات نظام شؤون الموظفين HR؟', 'تجد إعدادات نظام شؤون الموظفين HR ضمن قسم الإعدادات أو الإعدادات المتقدمة، ويمكن تعديلها حسب صلاحيات المستخدم.', '2025-04-23 11:34:07', '2025-04-23 11:34:07'),
(296, 'هل يمكن تخصيص نظام شؤون الموظفين HR حسب احتياجاتي؟', 'نعم، يتيح النظام إمكانية تخصيص نظام شؤون الموظفين HR من خلال الإعدادات أو عن طريق دعم مخصص من الفريق الفني.', '2025-04-23 11:34:07', '2025-04-23 11:34:07');

-- --------------------------------------------------------

--
-- Table structure for table `follow_ups`
--

CREATE TABLE `follow_ups` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `task_id` bigint(20) UNSIGNED DEFAULT NULL,
  `project_id` bigint(20) UNSIGNED DEFAULT NULL,
  `lead_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_by` bigint(20) UNSIGNED NOT NULL,
  `assigned_to` bigint(20) UNSIGNED DEFAULT NULL,
  `next_follow_up_at` datetime NOT NULL,
  `status` enum('scheduled','done','skipped','lost') NOT NULL DEFAULT 'scheduled',
  `comment` text DEFAULT NULL,
  `lost_at` datetime DEFAULT NULL,
  `lost_reason` varchar(255) DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `follow_ups`
--

INSERT INTO `follow_ups` (`id`, `task_id`, `project_id`, `lead_id`, `created_by`, `assigned_to`, `next_follow_up_at`, `status`, `comment`, `lost_at`, `lost_reason`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 2, NULL, NULL, 100, NULL, '2025-09-18 22:35:00', 'done', 'jbjnun', NULL, NULL, NULL, '2025-09-07 22:36:04', '2025-09-07 23:14:32'),
(2, 1, NULL, NULL, 100, NULL, '2025-09-18 22:35:00', 'scheduled', 'jbjnun', NULL, NULL, NULL, '2025-09-07 22:36:24', '2025-09-07 19:50:36'),
(3, NULL, NULL, NULL, 100, NULL, '2025-10-01 22:38:00', 'scheduled', 'jbjnun', NULL, NULL, NULL, '2025-09-07 22:38:27', '2025-09-07 22:38:27'),
(4, NULL, NULL, NULL, 100, NULL, '2025-10-01 22:38:00', 'scheduled', 'jbjnun', NULL, NULL, NULL, '2025-09-07 22:38:41', '2025-09-07 22:38:41'),
(5, NULL, NULL, NULL, 100, NULL, '2025-09-02 22:41:00', 'scheduled', 'jbjnun', NULL, NULL, NULL, '2025-09-07 22:41:14', '2025-09-07 22:41:14'),
(6, NULL, NULL, NULL, 100, NULL, '2025-09-06 22:49:00', 'scheduled', 'jbjnun', NULL, NULL, NULL, '2025-09-07 22:50:00', '2025-09-07 22:50:00'),
(7, 2, NULL, NULL, 100, NULL, '2025-09-09 10:27:00', 'done', 'ddd', NULL, NULL, NULL, '2025-09-09 10:27:48', '2025-09-09 10:32:07');

-- --------------------------------------------------------

--
-- Table structure for table `guarantors`
--

CREATE TABLE `guarantors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `contract_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `job` varchar(255) DEFAULT NULL,
  `monthly_income` decimal(10,2) DEFAULT NULL,
  `relation` varchar(255) DEFAULT NULL,
  `images` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`images`)),
  `national_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `history_installments`
--

CREATE TABLE `history_installments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED DEFAULT NULL,
  `customer_id` bigint(20) UNSIGNED NOT NULL,
  `supplier_id` bigint(20) DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `total_price` int(11) NOT NULL DEFAULT 0,
  `note` mediumtext NOT NULL,
  `contract_id` bigint(20) DEFAULT NULL,
  `scheduled_installment_id` bigint(20) DEFAULT NULL,
  `notification` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `img` mediumtext DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `history_transections`
--

CREATE TABLE `history_transections` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tran_type` varchar(255) DEFAULT NULL,
  `account_id` bigint(20) UNSIGNED DEFAULT NULL,
  `seller_id` bigint(20) UNSIGNED DEFAULT NULL,
  `amount` double DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `debit` tinyint(1) DEFAULT NULL,
  `credit` tinyint(1) DEFAULT NULL,
  `balance` double DEFAULT 0,
  `date` date DEFAULT NULL,
  `customer_id` int(10) UNSIGNED DEFAULT NULL,
  `supplier_id` int(10) UNSIGNED DEFAULT NULL,
  `order_id` int(10) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT NULL,
  `img` mediumtext DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `installments`
--

CREATE TABLE `installments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED DEFAULT NULL,
  `customer_id` bigint(20) UNSIGNED DEFAULT NULL,
  `supplier_id` bigint(20) DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `scheduled_installment_id` bigint(20) DEFAULT NULL,
  `contract_id` bigint(20) DEFAULT NULL,
  `total_price` int(11) NOT NULL DEFAULT 0,
  `note` mediumtext NOT NULL,
  `active` int(11) NOT NULL DEFAULT 1,
  `notification` int(11) NOT NULL DEFAULT 0,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `img` mediumtext DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `installment_contracts`
--

CREATE TABLE `installment_contracts` (
  `id` bigint(20) NOT NULL,
  `customer_id` bigint(20) NOT NULL,
  `guarantor_id` bigint(20) DEFAULT NULL,
  `total_amount` decimal(12,2) DEFAULT NULL,
  `start_date` date DEFAULT NULL,
  `duration_months` int(11) DEFAULT NULL,
  `interest_percent` decimal(5,2) DEFAULT 0.00,
  `status` enum('active','completed','cancelled') DEFAULT 'active',
  `order_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `interview_evaluations`
--

CREATE TABLE `interview_evaluations` (
  `id` int(11) NOT NULL,
  `job_applicant_id` bigint(20) NOT NULL,
  `interviewer` varchar(255) NOT NULL,
  `interview_date` date NOT NULL,
  `evaluation_notes` text DEFAULT NULL,
  `score` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `inventory_adjustments`
--

CREATE TABLE `inventory_adjustments` (
  `id` int(10) UNSIGNED NOT NULL,
  `inventory_count_id` int(10) UNSIGNED DEFAULT NULL,
  `branch_id` int(10) UNSIGNED NOT NULL,
  `adjustment_date` date NOT NULL,
  `status` varchar(50) NOT NULL,
  `created_by` int(10) UNSIGNED NOT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `inventory_adjustment_items`
--

CREATE TABLE `inventory_adjustment_items` (
  `id` int(10) UNSIGNED NOT NULL,
  `inventory_adjustment_id` int(10) UNSIGNED NOT NULL,
  `product_id` int(10) UNSIGNED NOT NULL,
  `adjustment_amount` decimal(10,2) NOT NULL,
  `new_system_quantity` decimal(10,2) NOT NULL,
  `reason` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `inventory_counts`
--

CREATE TABLE `inventory_counts` (
  `id` int(10) UNSIGNED NOT NULL,
  `branch_id` int(10) UNSIGNED NOT NULL,
  `count_date` date NOT NULL,
  `status` varchar(50) NOT NULL,
  `created_by` int(10) UNSIGNED NOT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `inventory_count_items`
--

CREATE TABLE `inventory_count_items` (
  `id` int(10) UNSIGNED NOT NULL,
  `inventory_count_id` int(10) UNSIGNED NOT NULL,
  `product_id` int(10) UNSIGNED NOT NULL,
  `system_quantity` decimal(10,2) NOT NULL,
  `counted_quantity` decimal(10,2) NOT NULL,
  `difference` decimal(10,2) GENERATED ALWAYS AS (`counted_quantity` - `system_quantity`) STORED,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_applicants`
--

CREATE TABLE `job_applicants` (
  `id` bigint(20) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `resume_pdf` varchar(255) DEFAULT NULL,
  `status` enum('new','screening','interview','accepted','rejected') DEFAULT 'new',
  `applied_date` date NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `journal_entries`
--

CREATE TABLE `journal_entries` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `entry_date` date NOT NULL,
  `reference` varchar(100) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_by` bigint(20) UNSIGNED DEFAULT NULL,
  `payment_voucher_id` bigint(20) UNSIGNED DEFAULT NULL,
  `type` varchar(255) NOT NULL DEFAULT 'entry',
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `asset_id` bigint(20) DEFAULT NULL,
  `reversal` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL,
  `reversal_of_id` bigint(20) DEFAULT NULL,
  `head_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `ref` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `journal_entries`
--

INSERT INTO `journal_entries` (`id`, `entry_date`, `reference`, `description`, `created_by`, `payment_voucher_id`, `type`, `branch_id`, `asset_id`, `reversal`, `created_at`, `updated_at`, `deleted_at`, `reversal_of_id`, `head_date`, `ref`) VALUES
(1, '2025-01-01', 'OB-20250911-182000-YIL8', 'رصيد افتتاحي', 160, NULL, '1', 1, NULL, 1, '2025-09-11 18:20:00', '2025-09-13 14:40:16', '2025-09-13 14:40:16', NULL, '2025-09-11 15:20:00', NULL),
(2, '2025-01-01', 'OB-20250911-183107-Q0S9', 'رصيد افتتاحي', 160, NULL, '1', 1, NULL, 1, '2025-09-11 18:31:07', '2025-09-13 14:40:38', '2025-09-13 14:40:38', NULL, '2025-09-11 15:31:07', NULL),
(3, '2025-09-12', NULL, 'صص', 163, NULL, 'entry', 1, NULL, 1, '2025-09-12 14:24:05', '2025-09-12 14:30:32', '2025-09-12 14:30:32', NULL, '2025-09-12 11:24:05', NULL),
(4, '2025-09-13', NULL, 'تست', 163, NULL, 'entry', 1, NULL, 1, '2025-09-13 15:40:13', '2025-09-13 16:01:53', '2025-09-13 16:01:53', NULL, '2025-09-13 12:40:13', NULL),
(5, '2025-11-01', NULL, 'حوالة ايراد مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:06:22', '2025-11-12 03:09:14', '2025-11-12 03:09:14', NULL, '2025-11-12 00:06:22', NULL),
(6, '2025-01-10', NULL, 'حوالة ايراد مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:10:06', '2025-11-12 03:10:06', NULL, NULL, '2025-11-12 00:10:06', NULL),
(7, '2025-01-10', NULL, 'ايراد من الاستقدام عوض', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:12:46', '2025-11-12 03:12:46', NULL, NULL, '2025-11-12 00:12:46', NULL),
(8, '2025-10-01', NULL, 'ياسمين علي هادي - استلام سلسك - رسوم استلام عاملة هدي احمد عطيه بجازان 200 اتعاب المندوب + 239 قيمة التذكرة', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, NULL, '2025-11-12 00:34:44', NULL),
(9, '2025-10-01', NULL, 'شحن نت سكن العاملات مكتب المتميز 287.5 ريال', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:35:59', '2025-11-12 03:35:59', NULL, NULL, '2025-11-12 00:35:59', NULL),
(10, '2025-10-01', NULL, 'ابوفواز - ارسال عامله من الحفر الي الرياض -اثيوبيا عاملة ملاك محمد الشمري', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, NULL, '2025-11-12 00:40:05', NULL),
(11, '2025-10-01', NULL, 'بدريه خيران عيفان الرشيدي - مطالبة مالية - تمت المفاهمه مع العميل ومستمر معنا وتخصم الغرامة علي مكتب سنترال بنجلادش', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, NULL, '2025-11-12 00:42:58', NULL),
(12, '2025-10-01', NULL, 'ابوصقر - استلام 23 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, NULL, '2025-11-12 00:46:53', NULL),
(13, '2025-10-02', NULL, 'ايراد من العميل فيصل', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, NULL, '2025-11-12 00:50:10', NULL),
(14, '2025-10-02', NULL, 'عهدة البطاقة الائتمانية رقم 151', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:51:57', '2025-11-12 03:51:57', NULL, NULL, '2025-11-12 00:51:57', NULL),
(15, '2025-10-02', NULL, 'فيصل قاسم بن محمد العنزي - سداد مساند - العميل مسدد 3500 ريال خصم خاص من ابوسلطان', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:53:10', '2025-11-12 03:53:10', NULL, NULL, '2025-11-12 00:53:10', NULL),
(16, '2025-10-02', NULL, 'فيصل سالم سعيد القثمي - سداد الإقامة - العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL, '2025-11-12 00:56:35', NULL),
(17, '2025-10-05', NULL, 'ايراد من العميلة غادة راشد', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 03:57:39', '2025-11-12 03:57:39', NULL, NULL, '2025-11-12 00:57:39', NULL),
(18, '2025-10-05', NULL, 'عهدة فيزا 0236', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, NULL, '2025-11-12 01:00:19', NULL),
(19, '2025-10-05', NULL, 'ابوفيصل - سداد فاتورة جوال المكتب', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL, '2025-11-12 01:08:50', NULL),
(20, '2025-10-06', NULL, 'دفعة من مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL, '2025-11-12 01:14:05', NULL),
(21, '2025-10-07', NULL, 'دفعة من مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:16:32', '2025-11-12 04:16:32', NULL, NULL, '2025-11-12 01:16:32', NULL),
(22, '2025-10-07', NULL, 'عياس العيسي - تحويل مبلغ 35000 من مبلغ التقبيل مكتب الامتياز فرع الربوه متبقي نصف المبلغ', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, NULL, '2025-11-12 01:21:07', NULL),
(23, '2025-10-08', NULL, 'دفعة من مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, NULL, '2025-11-12 01:26:18', NULL),
(24, '2025-10-08', NULL, 'راكان نوار محمد المطيري - مطالبة مالية رجالية علي يوزر الامتياز', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, NULL, '2025-11-12 01:35:28', NULL),
(25, '2025-10-08', NULL, 'مندوبة الفلبين ANALYN FISHER - ادخال 3 عقود للبولو2 امتياز+1 انجاز (نايف السيف+محمد سلمان+منال الحميد)', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL, '2025-11-12 01:41:54', NULL),
(26, '2025-10-08', NULL, 'رواتب مكتب الإنجاز شهر سبتمبر', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL, '2025-11-12 01:54:49', NULL),
(27, '2025-10-08', NULL, 'سداد دراسة الجدوى ترخيص مكتب العمل - يوسف سداد بطاقة ائتمانية 7808', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 04:56:25', '2025-11-12 04:56:25', NULL, NULL, '2025-11-12 01:56:25', NULL),
(28, '2025-10-09', NULL, 'استرداد من الموظفة نجلاء', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL, '2025-11-12 02:50:37', NULL),
(29, '2025-10-09', NULL, 'تامينات مؤسسة سلطان', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL, '2025-11-12 03:04:01', NULL),
(30, '2025-10-09', NULL, 'عهدة فيزا رقم 9748', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL, '2025-11-12 03:08:41', NULL),
(31, '2025-10-11', NULL, 'عهدة فيزا 9151', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL, '2025-11-12 03:14:45', NULL),
(32, '2025-10-12', NULL, 'محمود عاصم - طباعة خطه العمل وتغليفها لتقديمها لمكتب العمل', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, NULL, '2025-11-12 03:16:21', NULL),
(33, '2025-10-12', NULL, 'فيصل مترجم عرعر - سداد رخصة العمل 12 شهور تخصم مناصفه', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL, '2025-11-12 03:26:55', NULL),
(34, '2025-10-13', NULL, 'دفعة من مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL, '2025-11-12 03:31:35', NULL),
(35, '2025-10-14', NULL, 'عياس العيسي - تحويل مبلغ 35000 المتبقي من مبلغ التقبيل مكتب الامتياز فرع الربوه الإجمالي 70000 ريال', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, NULL, '2025-11-12 03:47:58', NULL),
(36, '2025-10-14', NULL, 'مشاعل صالح سفر النفيعي - مطالبه ماليه علي يوزر الإنجاز', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL, '2025-11-12 03:56:05', NULL),
(37, '2025-10-15', NULL, 'ايراد من العميل عبد الرحمن', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, NULL, '2025-11-12 04:20:25', NULL),
(38, '2025-10-15', NULL, 'مندوبة الفلبين ANALYN FISHER - ادخال 5عقود للبولو2متميز +2 امتياز+1 انجاز (عبدالله لواص+طلال الرويلي+عبدالله العنزي+هديه الشمري+وليد الديب)', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL, '2025-11-12 04:27:17', NULL),
(39, '2025-10-16', NULL, 'شحن فيزا رقم 9151', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL, '2025-11-12 04:35:57', NULL),
(40, '2025-10-18', NULL, 'شحن فيزا رقم 9748', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, NULL, '2025-11-12 04:37:34', NULL),
(41, '2025-10-19', NULL, 'عهدة فيزا 9151 - شحن', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, NULL, '2025-11-12 12:42:05', NULL),
(42, '2025-10-19', NULL, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 تحويل 1500 ريال', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, NULL, '2025-11-12 12:44:18', NULL),
(43, '2025-10-20', NULL, 'دفعة من مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, NULL, '2025-11-12 12:47:03', NULL),
(44, '2025-10-20', NULL, 'سداد فاتورة مكتب نيشن سريلانكا', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL, '2025-11-12 13:10:48', NULL),
(45, '2025-10-21', NULL, 'دفعة من مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, NULL, '2025-11-12 13:37:38', NULL),
(46, '2025-10-21', NULL, 'ابوفواز - تحويل رسوم استلام عاملات من شركة سلسك الدمام 167 ريال +رسوم المندوب 150 ريال اماني رمضان الظفيري', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL, '2025-11-12 13:50:41', NULL),
(47, '2025-10-22', NULL, 'دفعة من مساند', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL, '2025-11-12 13:54:40', NULL),
(48, '2025-10-22', NULL, 'فاطمه عطيه حزيم العنزي - سداد الإقامة - العاملة نقل الي العميل حنان حليس الشمري مسدد 2000 ريال باقي 7000 تم اصدار كمبيالة', 160, NULL, 'entry', 1, NULL, 1, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL, '2025-11-12 14:10:14', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `journal_entries_details`
--

CREATE TABLE `journal_entries_details` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `journal_entry_id` bigint(20) UNSIGNED NOT NULL,
  `account_id` bigint(20) UNSIGNED NOT NULL,
  `debit` decimal(15,2) DEFAULT 0.00,
  `credit` decimal(15,2) DEFAULT 0.00,
  `cost_center_id` bigint(20) UNSIGNED DEFAULT NULL,
  `description` text DEFAULT NULL,
  `attachment_path` varchar(255) DEFAULT NULL,
  `entry_date` date NOT NULL DEFAULT current_timestamp(),
  `asset_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL,
  `reversal_of_detail_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `journal_entries_details`
--

INSERT INTO `journal_entries_details` (`id`, `journal_entry_id`, `account_id`, `debit`, `credit`, `cost_center_id`, `description`, `attachment_path`, `entry_date`, `asset_id`, `created_at`, `updated_at`, `deleted_at`, `reversal_of_detail_id`) VALUES
(5, 3, 59, 0.10, 0.00, NULL, 'صص', NULL, '2025-09-12', NULL, '2025-09-12 14:24:05', '2025-09-12 14:30:32', '2025-09-12 14:30:32', NULL),
(6, 3, 59, 0.00, 0.10, NULL, 'صص', NULL, '2025-09-12', NULL, '2025-09-12 14:24:05', '2025-09-12 14:30:32', '2025-09-12 14:30:32', NULL),
(11, 6, 151, 39218.41, 0.00, NULL, 'حوالة ايراد مساند', NULL, '2025-11-12', NULL, '2025-11-12 03:10:06', '2025-11-12 03:10:06', NULL, NULL),
(12, 6, 364, 0.00, 39218.41, NULL, 'حوالة ايراد مساند', NULL, '2025-11-12', NULL, '2025-11-12 03:10:06', '2025-11-12 03:10:06', NULL, NULL),
(13, 7, 151, 1500.00, 0.00, NULL, 'ايراد من الاستقدام عوض', NULL, '2025-11-12', NULL, '2025-11-12 03:12:46', '2025-11-12 03:12:46', NULL, NULL),
(14, 7, 304, 0.00, 1500.00, NULL, 'ايراد من الاستقدام عوض', NULL, '2025-11-12', NULL, '2025-11-12 03:12:46', '2025-11-12 03:12:46', NULL, NULL),
(15, 8, 365, 439.00, 0.00, 19, 'ياسمين علي هادي - استلام سلسك - رسوم استلام عاملة هدي احمد عطيه بجازان 200 اتعاب المندوب + 239 قيمة التذكرة', NULL, '2025-11-12', NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, NULL),
(16, 8, 151, 0.00, 439.00, 19, 'ياسمين علي هادي - استلام سلسك - رسوم استلام عاملة هدي احمد عطيه بجازان 200 اتعاب المندوب + 239 قيمة التذكرة', NULL, '2025-11-12', NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, NULL),
(17, 8, 337, 46.00, 0.00, 20, 'ﺧﻠﻴﻞ شويعي - شراء حبارة لطابعه الحسابات', NULL, '2025-11-12', NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, NULL),
(18, 8, 151, 0.00, 46.00, 20, 'ﺧﻠﻴﻞ شويعي - شراء حبارة لطابعه الحسابات', NULL, '2025-11-12', NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, NULL),
(19, 8, 349, 0.58, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, NULL),
(20, 8, 151, 0.00, 0.58, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, NULL),
(21, 9, 338, 287.50, 0.00, 19, 'شحن نت سكن العاملات مكتب المتميز 287.5 ريال', NULL, '2025-11-12', NULL, '2025-11-12 03:35:59', '2025-11-12 03:35:59', NULL, NULL),
(22, 9, 151, 0.00, 287.50, NULL, 'شحن نت سكن العاملات مكتب المتميز 287.5 ريال', NULL, '2025-11-12', NULL, '2025-11-12 03:35:59', '2025-11-12 03:35:59', NULL, NULL),
(23, 10, 181, 137.00, 0.00, 18, 'ابوفواز - ارسال عامله من الحفر الي الرياض -اثيوبيا عاملة ملاك محمد الشمري', NULL, '2025-11-12', NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, NULL),
(24, 10, 365, 700.00, 0.00, 18, 'ابوفواز - مندوب الدمام - استلام 6 اثيوبيا 300 ريال+ 1سريلانكا 100 ريال +1 بنجلادش 100 ريال+2 اوغندا 200 ريال -الإجمالي 700 ريال', NULL, '2025-11-12', NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, NULL),
(25, 10, 365, 800.00, 0.00, 18, 'ابوفواز - مندوب الدمام - استلام 12 اثيوبيا 800 ريال إيواء + ترحيل العدد زياده + محمد اخد 14 عامله وخليل اخد 5 للرياض', NULL, '2025-11-12', NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, NULL),
(26, 10, 334, 160.00, 0.00, 18, 'ابوفواز - اعاشة السكن 160 ريال شراء رز لسكن العاملات', NULL, '2025-11-12', NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, NULL),
(27, 10, 305, 1400.00, 0.00, 20, 'ابوفواز - راتب سومي عاملة كينيا عند ابوسلطان', NULL, '2025-11-12', NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, NULL),
(28, 10, 151, 0.00, 3197.00, NULL, 'مصروفات فرع حفر الباطن حولت الى حساب ابوفواز - مجمع', NULL, '2025-11-12', NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, NULL),
(29, 11, 367, 1589.00, 0.00, 18, 'بدريه خيران عيفان الرشيدي - مطالبة مالية - تمت المفاهمه مع العميل ومستمر معنا وتخصم الغرامة علي مكتب سنترال بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, NULL),
(30, 11, 341, 2520.00, 0.00, 19, 'مندوبة الفلبين ANALYN FISHER - ادخال 9 عقود للبولو1متميز +5 امتياز+3 انجاز (هيا الرويلي+حمود العنزي+غاده الجميعه+عبدالرحمن الشمري+وليد العتيبي+خديجه فضائلي+عبدالله آل سعود+سعيد القرني+الجازي الحربي)', NULL, '2025-11-12', NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, NULL),
(31, 11, 151, 0.00, 1589.00, NULL, 'بدريه خيران عيفان الرشيدي - مطالبة مالية - تمت المفاهمه مع العميل ومستمر معنا وتخصم الغرامة علي مكتب سنترال بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, NULL),
(32, 11, 151, 0.00, 2520.00, NULL, 'مندوبة الفلبين ANALYN FISHER - ادخال 9 عقود للبولو1متميز +5 امتياز+3 انجاز (هيا الرويلي+حمود العنزي+غاده الجميعه+عبدالرحمن الشمري+وليد العتيبي+خديجه فضائلي+عبدالله آل سعود+سعيد القرني+الجازي الحربي)', NULL, '2025-11-12', NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, NULL),
(33, 12, 365, 950.00, 0.00, 19, 'ابوصقر - استلام 23 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر', NULL, '2025-11-12', NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, NULL),
(34, 12, 366, 850.00, 0.00, 19, 'ابوصقر- تذكرة عاملة خلود علي احمد حكمي - تم خصم التذكرة علي خليل شويعي لانه نسي جواز العاملة في السكن وتاخر عن ميعاد الرحلة', NULL, '2025-11-12', NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, NULL),
(35, 12, 365, 316.00, 0.00, 19, 'ابوصقر -تحويل رسوم استلام عاملات من شركة سلسك الدمام+ تذكرة نقل - هياء محمد نايف الهاجري', NULL, '2025-11-12', NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, NULL),
(36, 12, 151, 0.00, 2116.00, NULL, 'تحويل ابوصقر مصروفات فرع عرعر بتاريخ 1 / 10 / 2025 م\r\nابوصقر - استلام 23 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر\r\nابوصقر- تذكرة عاملة خلود علي احمد حكمي - تم خصم التذكرة علي خليل شويعي لانه نسي جواز العاملة في السكن وتاخر عن ميعاد الرحلة\r\nابوصقر -تحويل رسوم استلام عاملات من شركة سلسك الدمام+ تذكرة نقل - هياء محمد نايف الهاجري', NULL, '2025-11-12', NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, NULL),
(37, 13, 151, 3500.00, 0.00, NULL, 'ايراد من العميل فيصل', NULL, '2025-11-12', NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, NULL),
(38, 13, 151, 34968.10, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, NULL),
(39, 13, 151, 500.00, 0.00, NULL, 'ايراد من العميل خلف', NULL, '2025-11-12', NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, NULL),
(40, 13, 304, 0.00, 3500.00, NULL, 'ايراد من العميل فيصل', NULL, '2025-11-12', NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, NULL),
(41, 13, 364, 0.00, 34968.10, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, NULL),
(42, 13, 304, 0.00, 500.00, NULL, 'ايراد من العميل فيصل', NULL, '2025-11-12', NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, NULL),
(43, 14, 306, 2000.00, 0.00, NULL, 'عهدة البطاقة الائتمانية رقم 151', NULL, '2025-11-12', NULL, '2025-11-12 03:51:57', '2025-11-12 03:51:57', NULL, NULL),
(44, 14, 151, 0.00, 2000.00, NULL, 'عهدة البطاقة الائتمانية رقم 151', NULL, '2025-11-12', NULL, '2025-11-12 03:51:57', '2025-11-12 03:51:57', NULL, NULL),
(45, 15, 176, 4249.85, 0.00, 20, 'فيصل قاسم بن محمد العنزي - سداد مساند - العميل مسدد 3500 ريال خصم خاص من ابوسلطان', NULL, '2025-11-12', NULL, '2025-11-12 03:53:10', '2025-11-12 03:53:10', NULL, NULL),
(46, 15, 151, 0.00, 4249.85, NULL, 'فيصل قاسم بن محمد العنزي - سداد مساند - العميل مسدد 3500 ريال خصم خاص من ابوسلطان', NULL, '2025-11-12', NULL, '2025-11-12 03:53:10', '2025-11-12 03:53:10', NULL, NULL),
(47, 16, 342, 600.00, 0.00, 20, 'فيصل سالم سعيد القثمي - سداد الإقامة - العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(48, 16, 151, 0.00, 600.00, NULL, 'فيصل سالم سعيد القثمي - سداد الإقامة - العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(49, 16, 179, 90.00, 0.00, 18, 'نور الدين  - فحص طبي - عاملة فيصل سالم سعيد القثمي العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(50, 16, 151, 0.00, 90.00, NULL, 'نور الدين  - فحص طبي - عاملة فيصل سالم سعيد القثمي العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(51, 16, 185, 4000.00, 0.00, 20, 'سلفة ابواسيل تخصم من شهر اكتوبر 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(52, 16, 151, 0.00, 4000.00, NULL, 'سلفة ابواسيل تخصم من شهر اكتوبر 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(53, 16, 349, 1.15, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(54, 16, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, NULL),
(55, 17, 151, 5000.00, 0.00, NULL, 'ايراد من العميلة غادة راشد', NULL, '2025-11-12', NULL, '2025-11-12 03:57:39', '2025-11-12 03:57:39', NULL, NULL),
(56, 17, 304, 0.00, 5000.00, NULL, 'ايراد من العميلة غادة راشد', NULL, '2025-11-12', NULL, '2025-11-12 03:57:39', '2025-11-12 03:57:39', NULL, NULL),
(57, 18, 311, 2000.00, 0.00, NULL, 'عهدة فيزا 0236', NULL, '2025-11-12', NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, NULL),
(58, 18, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 0236', NULL, '2025-11-12', NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, NULL),
(59, 18, 310, 2000.00, 0.00, NULL, 'عهدة فيزا 9726', NULL, '2025-11-12', NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, NULL),
(60, 18, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9726', NULL, '2025-11-12', NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, NULL),
(61, 19, 338, 200.00, 0.00, 18, 'ابوفيصل - سداد فاتورة جوال المكتب', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(62, 19, 151, 0.00, 200.00, NULL, 'ابوفيصل - سداد فاتورة جوال المكتب', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(63, 19, 338, 65.00, 0.00, 18, 'نور الدين - شراء ذاكرة تخزين خارجية لسنترال للكول سنتر بالحفر 65 ريال', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(64, 19, 151, 0.00, 65.00, NULL, 'نور الدين - شراء ذاكرة تخزين خارجية لسنترال للكول سنتر بالحفر 65 ريال', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(65, 19, 347, 2500.00, 0.00, 20, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل 24-09', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(66, 19, 151, 0.00, 2500.00, NULL, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل 24-09', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(67, 19, 331, 5600.00, 0.00, 18, 'سعود عسكر - سداد ايجار مكتب انجاز +ملحق الموظفين', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(68, 19, 151, 0.00, 5600.00, NULL, 'سعود عسكر - سداد ايجار مكتب انجاز +ملحق الموظفين', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(69, 19, 301, 2700.00, 0.00, NULL, 'سعود عسكر - سداد ايجار 3 محلات حدود الذكاء', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(70, 19, 151, 0.00, 2700.00, NULL, 'سعود عسكر - سداد ايجار 3 محلات حدود الذكاء', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(71, 19, 338, 1188.33, 0.00, 16, 'سداد فاتورة نت مكتب الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(72, 19, 151, 0.00, 383.33, NULL, 'سداد فاتورة نت مكتب الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(73, 19, 151, 0.00, 805.00, NULL, 'سداد فاتورة نت مكتب الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(74, 19, 338, 383.94, 0.00, 16, 'مصطفي - سداد فاتورة ال 4 جوالات ب اسم الشركة (مصطفي + محمود + 2 جوال استقبال )', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(75, 19, 151, 0.00, 383.94, NULL, 'مصطفي - سداد فاتورة ال 4 جوالات ب اسم الشركة (مصطفي + محمود + 2 جوال استقبال )', NULL, '2025-11-12', NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, NULL),
(76, 20, 151, 85889.88, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(77, 20, 364, 0.00, 85889.88, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(78, 20, 155, 10000.00, 0.00, NULL, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(79, 20, 155, 18270.00, 0.00, NULL, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(80, 20, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(81, 20, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(82, 20, 151, 0.00, 10000.00, NULL, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(83, 20, 151, 0.00, 18270.00, NULL, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(84, 20, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(85, 20, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(86, 20, 151, 1000.00, 0.00, NULL, 'ايراد من العميل نواف محمد العنزى', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(87, 20, 304, 0.00, 1000.00, NULL, 'ايراد من العميل نواف محمد العنزى', NULL, '2025-11-12', NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, NULL),
(88, 21, 151, 52356.39, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 04:16:32', '2025-11-12 04:16:32', NULL, NULL),
(89, 21, 364, 0.00, 52356.39, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 04:16:32', '2025-11-12 04:16:32', NULL, NULL),
(90, 22, 370, 35000.00, 0.00, NULL, 'عياس العيسي - تحويل مبلغ 35000 من مبلغ التقبيل مكتب الامتياز فرع الربوه متبقي نصف المبلغ', NULL, '2025-11-12', NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, NULL),
(91, 22, 151, 0.00, 35000.00, NULL, 'عياس العيسي - تحويل مبلغ 35000 من مبلغ التقبيل مكتب الامتياز فرع الربوه متبقي نصف المبلغ', NULL, '2025-11-12', NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, NULL),
(92, 22, 349, 8.05, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, NULL),
(93, 22, 151, 0.00, 8.05, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, NULL),
(94, 22, 151, 2000.00, 0.00, NULL, 'ايراد من العميل خالد صالح حمود', NULL, '2025-11-12', NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, NULL),
(95, 22, 304, 0.00, 2000.00, NULL, 'ايراد من العميل خالد صالح حمود', NULL, '2025-11-12', NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, NULL),
(96, 23, 151, 60822.28, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, NULL),
(97, 23, 364, 0.00, 60822.28, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, NULL),
(98, 23, 307, 2000.00, 0.00, NULL, 'عهدة فيزا 9151', NULL, '2025-11-12', NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, NULL),
(99, 23, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9151', NULL, '2025-11-12', NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, NULL),
(100, 23, 151, 1000.00, 0.00, NULL, 'استرداد مدفوعات سداد حكومية', NULL, '2025-11-12', NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, NULL),
(101, 23, 304, 0.00, 1000.00, NULL, 'استرداد مدفوعات سداد حكومية', NULL, '2025-11-12', NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, NULL),
(102, 24, 367, 2090.95, 0.00, 16, 'راكان نوار محمد المطيري - مطالبة مالية رجالية علي يوزر الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, NULL),
(103, 24, 151, 0.00, 2090.95, 15, 'راكان نوار محمد المطيري - مطالبة مالية رجالية علي يوزر الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, NULL),
(104, 24, 367, 3611.85, 0.00, 18, 'نوره عطاالله محمد المطيري - مطالبة مالية - العميل الغي العقد العاملة منسحبه وتم خصم الغرامة علي العميل', NULL, '2025-11-12', NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, NULL),
(105, 24, 151, 0.00, 3611.85, NULL, 'نوره عطاالله محمد المطيري - مطالبة مالية - العميل الغي العقد العاملة منسحبه وتم خصم الغرامة علي العميل', NULL, '2025-11-12', NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, NULL),
(106, 25, 368, 840.00, 0.00, 16, 'مندوبة الفلبين ANALYN FISHER - ادخال 3 عقود للبولو2 امتياز+1 انجاز (نايف السيف+محمد سلمان+منال الحميد)', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(107, 25, 151, 0.00, 840.00, NULL, 'مندوبة الفلبين ANALYN FISHER - ادخال 3 عقود للبولو2 امتياز+1 انجاز (نايف السيف+محمد سلمان+منال الحميد)', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(108, 25, 365, 167.00, 0.00, 16, 'اسامه - استلام سلسك - رسوم استلام عاملة بشركة سلسك عاملة ناصر مجري المطيري', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(109, 25, 151, 0.00, 167.00, NULL, 'اسامه - استلام سلسك - رسوم استلام عاملة بشركة سلسك عاملة ناصر مجري المطيري', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(110, 25, 367, 12683.00, 0.00, 19, 'خلود مفضي ربيعان العنزي - استرجاع تسفير - تم خصم العاملة + التذكرة من مكتب ورلد اير سريلانكا وتم خصم مده العمل', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(111, 25, 151, 0.00, 12683.00, NULL, 'خلود مفضي ربيعان العنزي - استرجاع تسفير - تم خصم العاملة + التذكرة من مكتب ورلد اير سريلانكا وتم خصم مده العمل', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(112, 25, 305, 500.00, 0.00, NULL, 'فيصل ﻗﺎﻃﻊ العنزي تحويل 500 ﺭﻳﺎﻝ ﺣﺴﺐ ﺗﻮﺟﻴﻬﺎﺕ ﺍﺑﻮﺳﻠﻄﺎﻥ', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(113, 25, 151, 0.00, 500.00, NULL, 'فيصل ﻗﺎﻃﻊ العنزي تحويل 500 ﺭﻳﺎﻝ ﺣﺴﺐ ﺗﻮﺟﻴﻬﺎﺕ ﺍﺑﻮﺳﻠﻄﺎﻥ', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(114, 25, 349, 0.58, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(115, 25, 151, 0.00, 0.58, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(116, 25, 371, 485.00, 0.00, NULL, 'خليل شويعي - عهده باركينج المطار + غاز السكن + مياه لسكن العاملات حسب توجيه ابوفيصل', NULL, '2025-11-12', NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, NULL),
(117, 25, 151, 0.00, 485.00, NULL, 'خليل شويعي - عهده باركينج المطار + غاز السكن + مياه لسكن العاملات حسب توجيه ابوفيصل', NULL, '2025-11-12', NULL, '2025-11-12 04:41:55', '2025-11-12 04:41:55', NULL, NULL),
(118, 25, 349, 0.58, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:41:55', '2025-11-12 04:41:55', NULL, NULL),
(119, 25, 151, 0.00, 0.58, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 04:41:55', '2025-11-12 04:41:55', NULL, NULL),
(120, 26, 185, 91000.00, 0.00, 19, 'رواتب مكتب الإنجاز شهر سبتمبر', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(121, 26, 185, 49400.00, 0.00, 16, 'رواتب مكتب الامتياز شهر سبتمبر', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(122, 26, 185, 19300.00, 0.00, 19, 'رواتب مكتب المتميز شهر سبتمبر', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(123, 26, 301, 9500.00, 0.00, NULL, 'رواتب وكالة حدود الذكاء شهر سبتمبر', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(124, 26, 302, 4000.00, 0.00, NULL, 'رواتب 2 عمال تبع ابورنا + 1 عامل طرف ابوسلطان وبيتم استرجاع المبلغ بعد التحويل', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(125, 26, 151, 0.00, 4000.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(126, 26, 151, 0.00, 36500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(127, 26, 151, 0.00, 15950.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(128, 26, 151, 0.00, 10000.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(129, 26, 151, 0.00, 4500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(130, 26, 151, 0.00, 4500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(131, 26, 151, 0.00, 2800.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(132, 26, 151, 0.00, 2000.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(133, 26, 151, 0.00, 6550.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(134, 26, 151, 0.00, 3600.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(135, 26, 151, 0.00, 2000.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(136, 26, 151, 0.00, 4500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(137, 26, 151, 0.00, 1500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(138, 26, 151, 0.00, 4500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(139, 26, 151, 0.00, 1500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(140, 26, 151, 0.00, 4000.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(141, 26, 151, 0.00, 58300.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(142, 26, 151, 0.00, 1500.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(143, 26, 151, 0.00, 5000.00, NULL, 'سداد مرتبات شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(144, 26, 349, 48.30, 0.00, 20, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(145, 26, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(146, 26, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(147, 26, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(148, 26, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(149, 26, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(150, 26, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(151, 26, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(152, 26, 151, 0.00, 40.25, NULL, 'رسوم وعمولات بنكية تحويلات المرتبات', NULL, '2025-11-12', NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, NULL),
(153, 27, 206, 5000.00, 0.00, 20, 'سداد دراسة الجدوى ترخيص مكتب العمل - يوسف سداد بطاقة ائتمانية 7808', NULL, '2025-11-12', NULL, '2025-11-12 04:56:25', '2025-11-12 04:56:25', NULL, NULL),
(154, 27, 151, 0.00, 5000.00, NULL, 'سداد دراسة الجدوى ترخيص مكتب العمل - يوسف سداد بطاقة ائتمانية 7808', NULL, '2025-11-12', NULL, '2025-11-12 04:56:25', '2025-11-12 04:56:25', NULL, NULL),
(155, 28, 151, 2500.00, 0.00, NULL, 'استرداد من الموظفة نجلاء', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(156, 28, 151, 5000.00, 0.00, NULL, 'استرداد من الموظفة مى - ريم', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(157, 28, 151, 2500.00, 0.00, NULL, 'استرداد من الموظفة امل', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(158, 28, 151, 71954.73, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(159, 28, 151, 600.00, 0.00, NULL, 'استرداد من فيصل', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(160, 28, 151, 2500.00, 0.00, NULL, 'استرداد من خالد', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(161, 28, 364, 0.00, 71954.73, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(162, 28, 372, 0.00, 13100.00, NULL, 'استرداد مرتبات شهر 9 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, NULL),
(163, 29, 339, 1944.17, 0.00, 20, 'تامينات مؤسسة سلطان', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(164, 29, 301, 1836.67, 0.00, NULL, 'تامينات حدود الذكاء', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(165, 29, 302, 2112.73, 0.00, NULL, 'تامينات ليان وان', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(166, 29, 339, 5889.83, 0.00, 16, 'تامينات الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(167, 29, 339, 61.60, 0.00, 18, 'تامينات الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(168, 29, 335, 1626.46, 0.00, 16, 'سداد كهرباء سكن الرياض', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(169, 29, 343, 4000.00, 0.00, 19, 'ماجد الحميدي - سداد نقل الكفالة 4000 ريال نقل كفالة', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(170, 29, 185, 599.00, 0.00, 16, 'عمران - 300 ريال باقي الراتب + 299 ريال فواتير علاج ل رنا اخوه', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(171, 29, 367, 2185.95, 0.00, 16, 'بندر عوض حامد الثمالي - مطالبة مالية رجالية علي يوزر الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(172, 29, 155, 5446.80, 0.00, NULL, 'دعم مصرف الانماء سداد فاتورة مكتب كريستال اوغندا', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(173, 29, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(174, 29, 155, 3750.00, 0.00, NULL, 'دعم مصرف الانماء سداد انجاز 1000 دولار مكتب قولدن سيزون', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(175, 29, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(176, 29, 342, 600.00, 0.00, 20, 'مها عواد العنزي - سداد الإقامة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(177, 29, 151, 0.00, 1944.17, NULL, 'تامينات مؤسسة سلطان', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(178, 29, 151, 0.00, 1836.67, NULL, 'تامينات حدود الذكاء', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(179, 29, 151, 0.00, 2112.73, NULL, 'تامينات ليان وان', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(180, 29, 151, 0.00, 5889.83, NULL, 'تامينات الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(181, 29, 151, 0.00, 61.60, NULL, 'تامينات الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(182, 29, 151, 0.00, 1626.46, NULL, 'سداد كهرباء سكن الرياض', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(183, 29, 151, 0.00, 4000.00, NULL, 'ماجد الحميدي - سداد نقل الكفالة 4000 ريال نقل كفالة', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(184, 29, 151, 0.00, 599.00, NULL, 'عمران - 300 ريال باقي الراتب + 299 ريال فواتير علاج ل رنا اخوه', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(185, 29, 151, 0.00, 2185.95, NULL, 'بندر عوض حامد الثمالي - مطالبة مالية رجالية علي يوزر الامتياز', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(186, 29, 151, 0.00, 5446.80, NULL, 'دعم مصرف الانماء سداد فاتورة مكتب كريستال اوغندا', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(187, 29, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(188, 29, 151, 0.00, 3750.00, NULL, 'دعم مصرف الانماء سداد انجاز 1000 دولار مكتب قولدن سيزون', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(189, 29, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(190, 29, 151, 0.00, 600.00, NULL, 'مها عواد العنزي - سداد الإقامة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', NULL, '2025-11-12', NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, NULL),
(191, 30, 308, 2000.00, 0.00, NULL, 'عهدة فيزا رقم 9748', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(192, 30, 151, 0.00, 2000.00, NULL, 'عهدة فيزا رقم 9748', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(193, 30, 151, 3675.50, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(194, 30, 364, 0.00, 3675.50, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(195, 30, 309, 2000.00, 0.00, NULL, 'عهدة فيزا رقم 1705', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(196, 30, 151, 0.00, 2000.00, NULL, 'عهدة فيزا رقم 1705', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(197, 30, 151, 1700.00, 0.00, NULL, 'استرداد رواتب ليان ون', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(198, 30, 151, 1700.00, 0.00, NULL, 'استرداد رواتب ليان ون', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(199, 30, 302, 0.00, 1700.00, NULL, 'استرداد رواتب ليان ون', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(200, 30, 302, 0.00, 1700.00, NULL, 'استرداد رواتب ليان ون', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(201, 30, 151, 5000.00, 0.00, NULL, 'استرداد رواتب السعودة شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(202, 30, 372, 0.00, 5000.00, NULL, 'استرداد رواتب السعودة شهر 9 / 2025 م', NULL, '2025-11-12', NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, NULL),
(203, 31, 307, 2000.00, 0.00, NULL, 'عهدة فيزا 9151', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(204, 31, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9151', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(205, 31, 151, 175.00, 0.00, NULL, 'ايراد من العميل عبدالله', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(206, 31, 304, 0.00, 175.00, NULL, 'ايراد من العميل عبدالله', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(207, 31, 342, 4850.00, 0.00, 19, 'ماجد الحميدي - سداد رخصة العمل 9 شهور تخصم مناصفه', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(208, 31, 181, 102.00, 0.00, 20, 'احمد خطاب - انتقالات من المكتب الي السكن بالليل 59 ريال + انتقالات اليوم الصباح لان خليل في الحفر 43 ريال', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(209, 31, 305, 150.00, 0.00, NULL, 'محمود بشير - سداد كمبيالات خاصة ب ابوسلطان', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(210, 31, 342, 1237.00, 0.00, 19, 'ماجد الحميدي - سداد الاقامة 9 شهور', NULL, '2025-11-12', NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, NULL),
(211, 31, 343, 4000.00, 0.00, 19, 'فيصل مترجم عرعر - سداد نقل الكفالة 4000 ريال نقل كفالة', NULL, '2025-11-12', NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, NULL),
(212, 31, 151, 0.00, 4850.00, NULL, 'ماجد الحميدي - سداد رخصة العمل 9 شهور تخصم مناصفه', NULL, '2025-11-12', NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, NULL),
(213, 31, 151, 0.00, 102.00, NULL, 'احمد خطاب - انتقالات من المكتب الي السكن بالليل 59 ريال + انتقالات اليوم الصباح لان خليل في الحفر 43 ريال', NULL, '2025-11-12', NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, NULL),
(214, 31, 151, 0.00, 150.00, NULL, 'محمود بشير - سداد كمبيالات خاصة ب ابوسلطان', NULL, '2025-11-12', NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, NULL),
(215, 31, 151, 0.00, 1237.00, NULL, 'ماجد الحميدي - سداد الاقامة 9 شهور', NULL, '2025-11-12', NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, NULL),
(216, 31, 151, 0.00, 4000.00, NULL, 'فيصل مترجم عرعر - سداد نقل الكفالة 4000 ريال نقل كفالة', NULL, '2025-11-12', NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, NULL),
(217, 32, 206, 250.00, 0.00, 20, 'محمود عاصم - طباعة خطه العمل وتغليفها لتقديمها لمكتب العمل', NULL, '2025-11-12', NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, NULL),
(218, 32, 151, 0.00, 250.00, NULL, 'محمود عاصم - طباعة خطه العمل وتغليفها لتقديمها لمكتب العمل', NULL, '2025-11-12', NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, NULL),
(219, 32, 349, 0.58, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, NULL),
(220, 32, 151, 0.00, 0.58, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, NULL),
(221, 33, 342, 4850.00, 0.00, 19, 'فيصل مترجم عرعر - سداد رخصة العمل 12 شهور تخصم مناصفه', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(222, 33, 342, 600.00, 0.00, 19, 'عادل عوض الهزيمي - سداد الإقامة - العاملة معروضه نقل والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(223, 33, 342, 1650.00, 0.00, 19, 'فيصل مترجم عرعر - سداد الاقامة 12 شهور', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(224, 33, 334, 171.00, 0.00, 18, 'ابوفواز - مصروف اعاشة سكن عاملات مكتب انجاز 171 ريال', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(225, 33, 179, 90.00, 0.00, 18, 'نور الدين - فحص طبي عامله مها عواد العنزي العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(226, 33, 367, 3971.00, 0.00, 16, 'شويمي بن سعد بن شويمي السبيعي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة من مكتب سابولا اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(227, 33, 367, 14850.00, 0.00, 16, 'وليد عبدالله بجاد العتيبي - مطالبة مالية - العميل الغي العقد لخطا في راتب العاملة والعميل مستمر معنا بعقد جديد', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(228, 33, 367, 6760.65, 0.00, 16, 'وسميه محمد ناصر الخويتم - مطالبة مالية - العميل الغي العقد وتخصم من الغرامه من مكتب MAJORDOMO  كينيا', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(229, 33, 151, 0.00, 4850.00, NULL, 'فيصل مترجم عرعر - سداد رخصة العمل 12 شهور تخصم مناصفه', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(230, 33, 151, 0.00, 600.00, NULL, 'عادل عوض الهزيمي - سداد الإقامة - العاملة معروضه نقل والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(231, 33, 151, 0.00, 1650.00, NULL, 'فيصل مترجم عرعر - سداد الاقامة 12 شهور', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(232, 33, 151, 0.00, 171.00, NULL, 'ابوفواز - مصروف اعاشة سكن عاملات مكتب انجاز 171 ريال', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(233, 33, 151, 0.00, 90.00, NULL, 'نور الدين - فحص طبي عامله مها عواد العنزي العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(234, 33, 151, 0.00, 3971.00, NULL, 'شويمي بن سعد بن شويمي السبيعي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة من مكتب سابولا اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(235, 33, 151, 0.00, 14850.00, NULL, 'وليد عبدالله بجاد العتيبي - مطالبة مالية - العميل الغي العقد لخطا في راتب العاملة والعميل مستمر معنا بعقد جديد', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(236, 33, 151, 0.00, 6760.65, NULL, 'وسميه محمد ناصر الخويتم - مطالبة مالية - العميل الغي العقد وتخصم من الغرامه من مكتب MAJORDOMO  كينيا', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(237, 33, 151, 453.00, 0.00, NULL, 'ايراد من العميل جهز هاجد العازمة', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(238, 33, 304, 0.00, 453.00, NULL, 'ايراد من العميل جهز هاجد العازمة', NULL, '2025-11-12', NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, NULL),
(239, 34, 151, 116032.41, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(240, 34, 364, 0.00, 116032.41, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(241, 34, 338, 200.00, 0.00, 18, 'هاني - سداد فاتورة جوال المكتب 200', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(242, 34, 367, 5613.45, 0.00, 16, 'جواهر صبري بن رويشد الرويلي -  مطالبة مالية - العميل الغي العقد وتم خصم الغرامة', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(243, 34, 349, 1.15, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(244, 34, 151, 0.00, 200.00, NULL, 'هاني - سداد فاتورة جوال المكتب 200', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(245, 34, 151, 0.00, 5613.45, NULL, 'جواهر صبري بن رويشد الرويلي -  مطالبة مالية - العميل الغي العقد وتم خصم الغرامة', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(246, 34, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(247, 34, 151, 1000.00, 0.00, NULL, 'دفعة من العميلة مشاعل ساير حجى', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(248, 34, 151, 1000.00, 0.00, NULL, 'دفعة من العميلة مشاعل ساير حجى', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(249, 34, 304, 0.00, 2000.00, NULL, 'دفعة من العميلة مشاعل ساير حجى', NULL, '2025-11-12', NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, NULL),
(250, 35, 370, 35000.00, 0.00, NULL, 'عياس العيسي - تحويل مبلغ 35000 المتبقي من مبلغ التقبيل مكتب الامتياز فرع الربوه الإجمالي 70000 ريال', NULL, '2025-11-12', NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, NULL),
(251, 35, 349, 8.05, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, NULL),
(252, 35, 151, 0.00, 35000.00, NULL, 'عياس العيسي - تحويل مبلغ 35000 المتبقي من مبلغ التقبيل مكتب الامتياز فرع الربوه الإجمالي 70000 ريال', NULL, '2025-11-12', NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, NULL),
(253, 35, 151, 0.00, 8.05, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, NULL),
(254, 35, 151, 471.00, 0.00, NULL, 'ايراد من العميلة اوامر', NULL, '2025-11-12', NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, NULL),
(255, 35, 304, 0.00, 471.00, NULL, 'ايراد من العميلة اوامر', NULL, '2025-11-12', NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, NULL),
(256, 36, 305, 206.40, 0.00, NULL, 'مشاعل صالح سفر النفيعي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(257, 36, 305, 206.55, 0.00, NULL, 'عايض بن مهجي بن زائد العتيبي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(258, 36, 305, 206.40, 0.00, NULL, 'ماجد عطالله بن سمير الحربي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(259, 36, 305, 206.40, 0.00, NULL, 'مطلق بن فهد بن هادي الدوسري - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(260, 36, 305, 1500.00, 0.00, NULL, 'ابوصقر - راتب عاملة بنجلادش عملت في بيت ابوسلطان شهر ونص (امل رمضان)', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(261, 36, 305, 206.40, 0.00, NULL, 'نوف مقبول خميس الحازمي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(262, 36, 349, 0.58, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(263, 36, 176, 3750.00, 0.00, 20, 'سداد انجاز 1000 دولار مكتب رفيق بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(264, 36, 349, 1.15, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(265, 36, 182, 2000.00, 0.00, 18, 'مها عواد العنزي - سداد تأشيرة بديلة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(266, 36, 367, 4253.95, 0.00, 18, 'هاجد مبرك عوض العازمي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة من المكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(267, 36, 151, 0.00, 206.40, NULL, 'مشاعل صالح سفر النفيعي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(268, 36, 151, 0.00, 206.55, NULL, 'عايض بن مهجي بن زائد العتيبي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(269, 36, 151, 0.00, 206.40, NULL, 'ماجد عطالله بن سمير الحربي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(270, 36, 151, 0.00, 206.40, NULL, 'مطلق بن فهد بن هادي الدوسري - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(271, 36, 151, 0.00, 1500.00, NULL, 'ابوصقر - راتب عاملة بنجلادش عملت في بيت ابوسلطان شهر ونص (امل رمضان)', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(272, 36, 151, 0.00, 206.40, NULL, 'نوف مقبول خميس الحازمي - مطالبه ماليه علي يوزر الإنجاز', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(273, 36, 151, 0.00, 0.58, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(274, 36, 151, 0.00, 3750.00, NULL, 'سداد انجاز 1000 دولار مكتب رفيق بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(275, 36, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(276, 36, 151, 0.00, 2000.00, NULL, 'مها عواد العنزي - سداد تأشيرة بديلة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(277, 36, 151, 0.00, 4253.95, NULL, 'هاجد مبرك عوض العازمي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة من المكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, NULL),
(278, 37, 151, 4254.10, 0.00, NULL, 'ايراد من العميل عبد الرحمن', NULL, '2025-11-12', NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, NULL),
(279, 37, 151, 14493.80, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, NULL),
(280, 37, 304, 0.00, 4254.10, NULL, 'ايراد من العميل عبد الرحمن', NULL, '2025-11-12', NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, NULL),
(281, 37, 364, 0.00, 14493.80, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, NULL),
(282, 38, 368, 1400.00, 0.00, 16, 'مندوبة الفلبين ANALYN FISHER - ادخال 5عقود للبولو2متميز +2 امتياز+1 انجاز (عبدالله لواص+طلال الرويلي+عبدالله العنزي+هديه الشمري+وليد الديب)', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(283, 38, 151, 0.00, 1400.00, NULL, 'مندوبة الفلبين ANALYN FISHER - ادخال 5عقود للبولو2متميز +2 امتياز+1 انجاز (عبدالله لواص+طلال الرويلي+عبدالله العنزي+هديه الشمري+وليد الديب)', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(284, 38, 342, 200.00, 0.00, 16, 'محمد مرعي - تمديد خروج وعوده 200 ريال', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(285, 38, 151, 0.00, 200.00, NULL, 'محمد مرعي - تمديد خروج وعوده 200 ريال', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(286, 38, 367, 4871.45, 0.00, 19, 'فاطمه محمد حسن حمدي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب يونيك اوغندا', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(287, 38, 151, 0.00, 4871.45, NULL, 'فاطمه محمد حسن حمدي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب يونيك اوغندا', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(288, 38, 176, 32954.96, 0.00, 20, 'سداد فاتورة مكتب سابولا اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(289, 38, 151, 0.00, 32954.96, NULL, 'سداد فاتورة مكتب سابولا اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(290, 38, 349, 5.75, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(291, 38, 151, 0.00, 5.75, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(292, 38, 155, 19000.00, 0.00, NULL, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(293, 38, 151, 0.00, 19000.00, NULL, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(294, 38, 349, 1.15, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(295, 38, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(296, 38, 155, 16414.00, 0.00, NULL, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(297, 38, 151, 0.00, 16414.00, NULL, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(298, 38, 349, 1.15, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(299, 38, 151, 0.00, 1.15, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, NULL),
(300, 39, 307, 2000.00, 0.00, NULL, 'شحن فيزا رقم 9151', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL),
(301, 39, 308, 2000.00, 0.00, NULL, 'شحن فيزا رقم 9748', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL),
(302, 39, 309, 2000.00, 0.00, NULL, 'شحن فيزا رقم 1705', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL),
(303, 39, 310, 2000.00, 0.00, NULL, 'شحن فيزا رقم 9726', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL),
(304, 39, 151, 0.00, 2000.00, NULL, 'شحن فيزا رقم 9151', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL);
INSERT INTO `journal_entries_details` (`id`, `journal_entry_id`, `account_id`, `debit`, `credit`, `cost_center_id`, `description`, `attachment_path`, `entry_date`, `asset_id`, `created_at`, `updated_at`, `deleted_at`, `reversal_of_detail_id`) VALUES
(305, 39, 151, 0.00, 2000.00, NULL, 'شحن فيزا رقم 9748', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL),
(306, 39, 151, 0.00, 2000.00, NULL, 'شحن فيزا رقم 1705', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL),
(307, 39, 151, 0.00, 2000.00, NULL, 'شحن فيزا رقم 9726', NULL, '2025-11-12', NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, NULL),
(308, 40, 308, 2000.00, 0.00, NULL, 'شحن فيزا رقم 9748', NULL, '2025-11-12', NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, NULL),
(309, 40, 151, 0.00, 2000.00, NULL, 'شحن فيزا رقم 9748', NULL, '2025-11-12', NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, NULL),
(310, 40, 151, 5700.00, 0.00, NULL, 'ايراد من العميل محمد', NULL, '2025-11-12', NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, NULL),
(311, 40, 304, 0.00, 5700.00, NULL, 'ايراد من العميل محمد', NULL, '2025-11-12', NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, NULL),
(312, 41, 307, 2000.00, 0.00, NULL, 'عهدة فيزا 9151 - شحن', NULL, '2025-11-12', NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, NULL),
(313, 41, 308, 2000.00, 0.00, NULL, 'عهدة فيزا 9151 - شحن', NULL, '2025-11-12', NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, NULL),
(314, 41, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9151 - شحن', NULL, '2025-11-12', NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, NULL),
(315, 41, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9151 - شحن', NULL, '2025-11-12', NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, NULL),
(316, 42, 346, 1500.00, 0.00, 16, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 تحويل 1500 ريال', NULL, '2025-11-12', NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, NULL),
(317, 42, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, NULL),
(318, 42, 151, 0.00, 1500.00, NULL, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 تحويل 1500 ريال', NULL, '2025-11-12', NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, NULL),
(319, 42, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, NULL),
(320, 42, 206, 2500.00, 0.00, 20, 'خالد حويشي - تحويل 2500 ريال رسوم انهاء معاملة جمال من مكتب العمل', NULL, '2025-11-12', NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, NULL),
(321, 42, 151, 0.00, 2500.00, NULL, 'خالد حويشي - تحويل 2500 ريال رسوم انهاء معاملة جمال من مكتب العمل', NULL, '2025-11-12', NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, NULL),
(322, 43, 151, 164545.88, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, NULL),
(323, 43, 364, 0.00, 164545.88, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, NULL),
(324, 43, 307, 2000.00, 0.00, NULL, 'عهدة فيزا 9151 - عهدة', NULL, '2025-11-12', NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, NULL),
(325, 43, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9151 - عهدة', NULL, '2025-11-12', NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, NULL),
(326, 43, 151, 300.00, 0.00, NULL, 'ايراد من العميل محمد', NULL, '2025-11-12', NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, NULL),
(327, 43, 304, 0.00, 300.00, NULL, 'ايراد من العميل محمد', NULL, '2025-11-12', NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, NULL),
(328, 44, 176, 25020.00, 0.00, 20, 'سداد فاتورة مكتب نيشن سريلانكا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(329, 44, 349, 18.40, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(330, 44, 155, 18000.00, 0.00, NULL, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(331, 44, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(332, 44, 155, 19000.00, 0.00, NULL, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(333, 44, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(334, 44, 155, 12890.00, 0.00, NULL, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(335, 44, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(336, 44, 301, 1500.00, 0.00, NULL, 'محمد رشاد - محاسب قانوني تحويل مبلغ 1500 ريال راتب شهر سبتمبر (ملف الضرائب)', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(337, 44, 367, 7670.00, 0.00, 19, 'جواهر عايد ذعذاع العنزي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب سنترال بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(338, 44, 333, 6000.00, 0.00, 19, 'نايف محمد شويحط - ايجار سكن عاملات مكتب المتميز - من 01-10-2025 حتي31-12-2025 تم تغيير العقد الإجمالي 24000 ريال', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(339, 44, 365, 950.00, 0.00, 19, 'ابوصقر - استلام 9 + 12 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(340, 44, 176, 53206.32, 0.00, 20, 'سداد فاتورة مكتب رفيق بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(341, 44, 176, 8135.20, 0.00, 20, 'سداد فاتورة مكتب كريستال اوغندا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(342, 44, 176, 2965.20, 0.00, 20, 'سداد فاتورة مكتب ماجوردمو كينيا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(343, 44, 349, 5.75, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(344, 44, 367, 3800.00, 0.00, 16, 'حنين احمد محمد الجيزاني - استرجاع نقل - العامله معروضه نقل في مكتب الرياض والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(345, 44, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(346, 44, 331, 9000.00, 0.00, 19, 'ايجار مكتب المتميز سداد دفعه 9000 ريال عن 3 شهور من 01-10-2025 حتي31-12-2025علما بان الايجار السنوي 36000 ريال', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(347, 44, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(348, 44, 151, 0.00, 25020.00, NULL, 'سداد فاتورة مكتب نيشن سريلانكا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(349, 44, 151, 0.00, 18.40, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(350, 44, 151, 0.00, 18000.00, NULL, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(351, 44, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(352, 44, 151, 0.00, 19000.00, NULL, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(353, 44, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(354, 44, 151, 0.00, 12890.00, NULL, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(355, 44, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(356, 44, 151, 0.00, 1500.00, NULL, 'محمد رشاد - محاسب قانوني تحويل مبلغ 1500 ريال راتب شهر سبتمبر (ملف الضرائب)', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(357, 44, 151, 0.00, 7670.00, NULL, 'جواهر عايد ذعذاع العنزي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب سنترال بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(358, 44, 151, 0.00, 6000.00, NULL, 'نايف محمد شويحط - ايجار سكن عاملات مكتب المتميز - من 01-10-2025 حتي31-12-2025 تم تغيير العقد الإجمالي 24000 ريال', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(359, 44, 151, 0.00, 950.00, NULL, 'ابوصقر - استلام 9 + 12 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(360, 44, 151, 0.00, 64306.72, NULL, 'سداد فاتورة مكتب رفيق بنجلادش', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(361, 44, 151, 0.00, 5.75, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(362, 44, 151, 0.00, 3800.00, NULL, 'حنين احمد محمد الجيزاني - استرجاع نقل - العامله معروضه نقل في مكتب الرياض والعميل موقع علي إقرار نقل', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(363, 44, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(364, 44, 151, 0.00, 9000.00, NULL, 'ايجار مكتب المتميز سداد دفعه 9000 ريال عن 3 شهور من 01-10-2025 حتي31-12-2025علما بان الايجار السنوي 36000 ريال', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(365, 44, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, NULL),
(366, 45, 151, 131666.50, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, NULL),
(367, 45, 364, 0.00, 131666.50, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, NULL),
(368, 45, 349, 37.38, 0.00, 20, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, NULL),
(369, 45, 151, 0.00, 37.38, NULL, 'رسوم وعمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, NULL),
(370, 45, 151, 1270.00, 0.00, NULL, 'ايراد من العميلة خلود', NULL, '2025-11-12', NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, NULL),
(371, 45, 304, 0.00, 1270.00, NULL, 'ايراد من العميلة خلود', NULL, '2025-11-12', NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, NULL),
(372, 46, 365, 317.00, 0.00, 18, 'ابوفواز - تحويل رسوم استلام عاملات من شركة سلسك الدمام 167 ريال +رسوم المندوب 150 ريال اماني رمضان الظفيري', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(373, 46, 151, 0.00, 317.00, 18, 'ابوفواز - تحويل رسوم استلام عاملات من شركة سلسك الدمام 167 ريال +رسوم المندوب 150 ريال اماني رمضان الظفيري', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(374, 46, 347, 2500.00, 0.00, 18, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل05-10', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(375, 46, 151, 0.00, 2500.00, NULL, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل05-10', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(376, 46, 366, 950.00, 0.00, 18, 'وكالة نجد//تذكرة عاملة شويمي سعد شويمي السبيعي - داخل الضمان - تم خصم العاملة + التذكرة من مكتب سابولا اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(377, 46, 366, 950.00, 0.00, 18, 'وكالة نجد//تذكرة عاملة شويمي سعد شويمي السبيعي - داخل الضمان - تم خصم العاملة + التذكرة من مكتب سابولا اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(378, 46, 151, 0.00, 1900.00, NULL, 'وكالة نجد//تذكرة عاملة هاجد مبرك عوض العازمي - داخل الضمان - تم خصم العاملة + التذكرة من مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(379, 46, 366, 1600.00, 0.00, 19, 'ابوصقر- تذكرة عاملة اسامه بدر مطر ضاحي العنزي - تم خصم العاملة + التذكرة من مكتب ليلي الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(380, 46, 151, 0.00, 1600.00, NULL, 'ابوصقر- تذكرة عاملة اسامه بدر مطر ضاحي العنزي - تم خصم العاملة + التذكرة من مكتب ليلي الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(381, 46, 367, 3779.00, 0.00, 19, 'فصايل محمد عوده الصلبي - استرجاع تسفير - تم تسفير العاملة داخل الضمان و تم خصم العاملة + التذكرة من مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(382, 46, 151, 0.00, 3779.00, NULL, 'سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(383, 46, 176, 58209.44, 0.00, 20, 'سداد فاتورة مكتب ليلي الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(384, 46, 151, 0.00, 58209.44, NULL, 'سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا\r\n+ سداد فاتورة مكتب ليلي الفلبين', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(385, 46, 349, 5.75, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(386, 46, 151, 0.00, 5.75, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(387, 46, 346, 1375.00, 0.00, 16, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 المتبقي 1375 ريال', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(388, 46, 151, 0.00, 1375.00, NULL, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 المتبقي 1375 ريال', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(389, 46, 349, 1.15, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(390, 46, 151, 0.00, 1.15, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, NULL),
(391, 47, 151, 72437.30, 0.00, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(392, 47, 364, 0.00, 72437.30, NULL, 'دفعة من مساند', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(393, 47, 308, 2000.00, 0.00, NULL, 'عهدة فيزا 9748 - شحن', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(394, 47, 310, 2000.00, 0.00, NULL, 'عهدة فيزا 9726- شحن', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(395, 47, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9748 - شحن', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(396, 47, 151, 0.00, 2000.00, NULL, 'عهدة فيزا 9726- شحن', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(397, 47, 151, 10000.00, 0.00, NULL, 'ايراد من العميل سعود', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(398, 47, 304, 0.00, 10000.00, NULL, 'ايراد من العميل سعود', NULL, '2025-11-12', NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, NULL),
(399, 48, 342, 600.00, 0.00, 18, 'فاطمه عطيه حزيم العنزي - سداد الإقامة - العاملة نقل الي العميل حنان حليس الشمري مسدد 2000 ريال باقي 7000 تم اصدار كمبيالة', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(400, 48, 366, 300.00, 0.00, 16, 'وكالة أسبوع الطيران - تذكرة سفر - عاملة يوسف سطام العنزي الي سكاكا العميل مسدد 10000 ريال باقي 9000 (سعود وارد الرويلي)', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(401, 48, 338, 115.00, 0.00, 16, 'خليل - سداد فاتورة جوال المكتب 115 ريال', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(402, 48, 338, 200.00, 0.00, 18, 'ابوفواز - سداد فاتورة جوال المكتب 200', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(403, 48, 368, 840.00, 0.00, 16, 'مندوبة الفلبين ANALYN FISHER - ادخال 3عقود للبولو1متميز +2 امتياز (عبدالله لواص+وليد العتيبي+خالد الريض)', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(404, 48, 205, 129.00, 0.00, 16, 'اسامه - ضيافه مكتب أبو ريان وتم الاتفاق معاه علي العمل مرة اخري علي 600 دولار', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(405, 48, 338, 230.00, 0.00, 16, 'اسامه - سداد فاتورة جوال المكتب 230 ريال', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(406, 48, 176, 49890.00, 0.00, 20, 'سداد باقي فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(407, 48, 349, 5.75, 0.00, 20, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(408, 48, 151, 115.00, 0.00, NULL, 'عمران - سداد فاتورة جوال المكتب 115 ريال', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(409, 48, 151, 0.58, 0.00, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(410, 48, 151, 0.00, 600.00, NULL, 'فاطمه عطيه حزيم العنزي - سداد الإقامة - العاملة نقل الي العميل حنان حليس الشمري مسدد 2000 ريال باقي 7000 تم اصدار كمبيالة', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(411, 48, 151, 0.00, 300.00, NULL, 'وكالة أسبوع الطيران - تذكرة سفر - عاملة يوسف سطام العنزي الي سكاكا العميل مسدد 10000 ريال باقي 9000 (سعود وارد الرويلي)', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(412, 48, 151, 0.00, 115.00, NULL, 'خليل - سداد فاتورة جوال المكتب 115 ريال', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(413, 48, 151, 0.00, 200.00, NULL, 'ابوفواز - سداد فاتورة جوال المكتب 200', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(414, 48, 151, 0.00, 840.00, NULL, 'مندوبة الفلبين ANALYN FISHER - ادخال 3عقود للبولو1متميز +2 امتياز (عبدالله لواص+وليد العتيبي+خالد الريض)', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(415, 48, 151, 0.00, 129.00, NULL, 'اسامه - ضيافه مكتب أبو ريان وتم الاتفاق معاه علي العمل مرة اخري علي 600 دولار', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(416, 48, 151, 0.00, 230.00, NULL, 'اسامه - سداد فاتورة جوال المكتب 230 ريال', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(417, 48, 151, 0.00, 49890.00, NULL, 'سداد باقي فاتورة مكتب قولدن سيزون اثيوبيا', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(418, 48, 151, 0.00, 5.75, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(419, 48, 151, 0.00, 115.00, NULL, 'عمران - سداد فاتورة جوال المكتب 115 ريال', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL),
(420, 48, 151, 0.00, 0.58, NULL, 'عمولات بنكية', NULL, '2025-11-12', NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `leads`
--

CREATE TABLE `leads` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `owner_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_by_admin_id` bigint(20) UNSIGNED DEFAULT NULL,
  `updated_by_admin_id` bigint(20) UNSIGNED DEFAULT NULL,
  `status_id` bigint(20) UNSIGNED DEFAULT NULL,
  `source_id` bigint(20) UNSIGNED DEFAULT NULL,
  `company_name` varchar(190) DEFAULT NULL,
  `contact_name` varchar(190) DEFAULT NULL,
  `email` varchar(190) DEFAULT NULL,
  `country_code` varchar(10) DEFAULT NULL,
  `phone` varchar(40) DEFAULT NULL,
  `phone_normalized` varchar(60) GENERATED ALWAYS AS (concat(ifnull(`country_code`,''),' ',ifnull(`phone`,''))) STORED,
  `whatsapp` varchar(40) DEFAULT NULL,
  `potential_value` decimal(18,2) DEFAULT NULL,
  `currency` char(3) DEFAULT NULL,
  `rating` tinyint(4) DEFAULT NULL,
  `pipeline_notes` text DEFAULT NULL,
  `last_contact_at` datetime DEFAULT NULL,
  `next_action_at` datetime DEFAULT NULL,
  `is_archived` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `leads`
--

INSERT INTO `leads` (`id`, `owner_id`, `created_by_admin_id`, `updated_by_admin_id`, `status_id`, `source_id`, `company_name`, `contact_name`, `email`, `country_code`, `phone`, `whatsapp`, `potential_value`, `currency`, `rating`, `pipeline_notes`, `last_contact_at`, `next_action_at`, `is_archived`, `created_at`, `updated_at`) VALUES
(7, 166, 163, NULL, 5, 2, 'Elmashreq', 'Elmashreq', 'Elmashreq@gmail.com', '+966', '555237602', '555237602', NULL, 'SAR', 4, 'fgffggf', NULL, NULL, 0, '2025-09-10 01:15:09', '2025-09-10 01:15:09');

-- --------------------------------------------------------

--
-- Table structure for table `lead_assignments`
--

CREATE TABLE `lead_assignments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `lead_id` bigint(20) UNSIGNED NOT NULL,
  `assigned_to_admin_id` bigint(20) UNSIGNED NOT NULL,
  `assigned_by_admin_id` bigint(20) UNSIGNED DEFAULT NULL,
  `assigned_at` datetime NOT NULL,
  `reason` varchar(190) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `lead_notes`
--

CREATE TABLE `lead_notes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `lead_id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `note` text NOT NULL,
  `visibility` enum('private','team','public') NOT NULL DEFAULT 'team',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `lead_sources`
--

CREATE TABLE `lead_sources` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `code` varchar(50) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `lead_sources`
--

INSERT INTO `lead_sources` (`id`, `name`, `code`, `created_at`, `updated_at`) VALUES
(1, 'فيس بوك', '1234', '2025-08-23 03:36:01', '2025-09-09 18:18:16'),
(2, 'انستجرام', '12345', '2025-08-23 03:40:35', '2025-09-09 18:18:26'),
(3, 'تيك توك', '1221', '2025-08-23 14:43:54', '2025-08-23 14:43:54');

-- --------------------------------------------------------

--
-- Table structure for table `lead_statuses`
--

CREATE TABLE `lead_statuses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `code` varchar(50) NOT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 100,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `lead_statuses`
--

INSERT INTO `lead_statuses` (`id`, `name`, `code`, `sort_order`, `is_active`, `created_at`, `updated_at`) VALUES
(5, 'اصدار العقد', '1', 100, 1, '2025-09-09 17:57:24', '2025-09-09 17:57:24'),
(6, 'انتظار موافقة مكتب الارسال الخارجي', '2', 101, 1, '2025-09-09 17:59:17', '2025-09-09 17:59:17'),
(7, 'انتظار نتيجة الفحص الطبي', '3', 102, 1, '2025-09-09 17:59:43', '2025-09-09 17:59:43'),
(8, 'انتظار موافقة وزارة العمل الخارجيه', '104', 103, 1, '2025-09-09 18:00:11', '2025-09-09 18:00:11'),
(9, 'تصديق التاشيره', '105', 104, 1, '2025-09-09 18:01:13', '2025-09-09 18:01:13'),
(10, 'انتظار الحصول علي شهادة التدريب المدرسي', '106', 105, 1, '2025-09-09 18:02:42', '2025-09-09 18:02:42'),
(11, 'الحصول علي ورقة حسن السير والسلوك', '107', 106, 1, '2025-09-09 18:03:20', '2025-09-09 18:03:20'),
(12, 'تم اصدار التاشيره', '108', 109, 1, '2025-09-09 18:04:32', '2025-09-09 18:04:32'),
(13, 'الصحول علي تصريح السفر', '109', 108, 1, '2025-09-09 18:05:03', '2025-09-09 18:05:03'),
(14, 'انتظار حجز التذكره', '110', 109, 1, '2025-09-09 18:05:20', '2025-09-09 18:08:04'),
(15, 'موعد الوصول', '111', 110, 1, '2025-09-09 18:06:32', '2025-09-09 18:06:32');

-- --------------------------------------------------------

--
-- Table structure for table `lead_tasks`
--

CREATE TABLE `lead_tasks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `lead_id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(190) NOT NULL,
  `due_at` datetime DEFAULT NULL,
  `assigned_to_id` bigint(20) UNSIGNED DEFAULT NULL,
  `status` enum('pending','done','canceled') NOT NULL DEFAULT 'pending',
  `priority` enum('low','normal','high','urgent') NOT NULL DEFAULT 'normal',
  `created_by_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `maintenance_logs`
--

CREATE TABLE `maintenance_logs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `asset_id` bigint(20) UNSIGNED NOT NULL,
  `maintenance_date` date NOT NULL,
  `maintenance_type` enum('preventive','emergency') NOT NULL,
  `estimated_cost` decimal(12,2) DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `status` enum('scheduled','in progress','completed') NOT NULL DEFAULT 'scheduled',
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `added_by` bigint(20) DEFAULT NULL,
  `approved_by` bigint(20) DEFAULT NULL,
  `done_by` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2021_11_02_095022_create_business_settings_table', 1),
(6, '2021_11_02_114801_create_admins_table', 1),
(7, '2021_11_03_044923_create_categories_table', 1),
(8, '2021_11_03_090927_create_brands_table', 1),
(9, '2021_11_03_101237_create_products_table', 1),
(10, '2021_11_06_025604_create_currencies_table', 1),
(11, '2021_11_06_031804_create_orders_table', 1),
(12, '2021_11_06_084528_create_order_details_table', 1),
(13, '2021_11_08_094042_create_customers_table', 1),
(15, '2021_11_11_051704_create_coupons_table', 1),
(16, '2021_11_13_100539_create_units_table', 1),
(17, '2021_11_17_034203_create_accounts_table', 1),
(20, '2021_11_17_083502_create_transections_table', 2),
(21, '2021_11_09_064445_create_suppliers_table', 3),
(22, '2021_06_17_054551_create_soft_credentials_table', 4),
(23, '2021_12_01_141901_add_phone_col_admin', 4),
(24, '2021_12_02_092539_add_image_to_admin_tables', 4),
(25, '2016_06_01_000001_create_oauth_auth_codes_table', 5),
(26, '2016_06_01_000002_create_oauth_access_tokens_table', 5),
(27, '2016_06_01_000003_create_oauth_refresh_tokens_table', 5),
(28, '2016_06_01_000004_create_oauth_clients_table', 5),
(29, '2016_06_01_000005_create_oauth_personal_access_clients_table', 5),
(30, '2022_02_06_115834_create_companies_table', 5),
(31, '2022_02_06_121739_add_company_id_col_admin', 5),
(32, '2022_02_06_150041_add_company_id_category', 5),
(33, '2022_02_06_151731_add_company_id_brand', 5),
(34, '2022_02_06_152243_add_company_id_accounts', 5),
(35, '2022_02_06_152301_add_company_id_coupon', 5),
(36, '2022_02_06_152323_add_company_id_users', 5),
(37, '2022_02_06_152357_add_company_id_orders', 5),
(38, '2022_02_06_152412_add_company_id_order_details', 5),
(39, '2022_02_06_152429_add_company_id_products', 5),
(40, '2022_02_06_152453_add_company_id_suppliers', 5),
(41, '2022_02_06_152515_add_company_id_transactions', 5),
(42, '2022_02_06_152943_add_company_id_units', 5),
(43, '2022_02_06_154752_add_company_id_customers', 5),
(44, '2022_02_06_160446_add_company_id_business_settings', 5),
(45, '2022_06_19_194943_rename_columns_to_coupons_table', 5);

-- --------------------------------------------------------

--
-- Table structure for table `notifications`
--

CREATE TABLE `notifications` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `type` varchar(128) NOT NULL,
  `title` varchar(191) NOT NULL,
  `body` text DEFAULT NULL,
  `data` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`data`)),
  `read_at` datetime DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `notifications`
--

INSERT INTO `notifications` (`id`, `user_id`, `type`, `title`, `body`, `data`, `read_at`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 159, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: gfgf', '{\"task_id\":1,\"assigned_by\":100}', NULL, NULL, '2025-09-07 21:49:06', '2025-09-07 21:49:06'),
(2, 160, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: gfgf', '{\"task_id\":1,\"assigned_by\":100}', NULL, NULL, '2025-09-07 21:49:06', '2025-09-07 21:49:06'),
(3, 161, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: gfgf', '{\"task_id\":1,\"assigned_by\":100}', NULL, NULL, '2025-09-07 21:49:06', '2025-09-07 21:49:06'),
(4, 162, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: gfgf', '{\"task_id\":1,\"assigned_by\":100}', NULL, NULL, '2025-09-07 21:49:06', '2025-09-07 21:49:06'),
(5, 100, 'approval.request', 'طلب موافقة جديد', 'طلب موافقة على task #1', '{\"type\":\"task\",\"id\":1,\"requested_by\":100}', NULL, NULL, '2025-09-07 21:49:06', '2025-09-07 21:49:06'),
(6, 159, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: sfdsfsd', '{\"task_id\":2,\"assigned_by\":100}', NULL, NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30'),
(7, 160, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: sfdsfsd', '{\"task_id\":2,\"assigned_by\":100}', NULL, NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30'),
(8, 161, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: sfdsfsd', '{\"task_id\":2,\"assigned_by\":100}', NULL, NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30'),
(9, 162, 'task.assigned', 'تم إسناد مهمة جديدة', 'عنوان المهمة: sfdsfsd', '{\"task_id\":2,\"assigned_by\":100}', NULL, NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30'),
(10, 159, 'comment.task', 'تعليق جديد على مهمة', 'wwqewq', '{\"entity_type\":\"task\",\"entity_id\":2,\"comment_id\":1}', NULL, NULL, '2025-09-07 23:07:24', '2025-09-07 23:07:24'),
(11, 160, 'comment.task', 'تعليق جديد على مهمة', 'wwqewq', '{\"entity_type\":\"task\",\"entity_id\":2,\"comment_id\":1}', NULL, NULL, '2025-09-07 23:07:24', '2025-09-07 23:07:24'),
(12, 161, 'comment.task', 'تعليق جديد على مهمة', 'wwqewq', '{\"entity_type\":\"task\",\"entity_id\":2,\"comment_id\":1}', NULL, NULL, '2025-09-07 23:07:24', '2025-09-07 23:07:24'),
(13, 162, 'comment.task', 'تعليق جديد على مهمة', 'wwqewq', '{\"entity_type\":\"task\",\"entity_id\":2,\"comment_id\":1}', NULL, NULL, '2025-09-07 23:07:24', '2025-09-07 23:07:24');

-- --------------------------------------------------------

--
-- Table structure for table `oauth_access_tokens`
--

CREATE TABLE `oauth_access_tokens` (
  `id` varchar(100) NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `client_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `scopes` text DEFAULT NULL,
  `revoked` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `expires_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `oauth_access_tokens`
--

INSERT INTO `oauth_access_tokens` (`id`, `user_id`, `client_id`, `name`, `scopes`, `revoked`, `created_at`, `updated_at`, `expires_at`) VALUES
('00a877699420d8c9aa3b3a12d742201ce93a85c8af4d64afca78c5b705c5569f5e7408bbd37e1a9d', 121, 1, 'adminToken', '[]', 0, '2024-12-17 22:47:10', '2024-12-17 22:47:10', '2025-12-17 22:47:10'),
('00abee5baac35f4c0dabbfdaf9eb55e38fa9338d0d7ed6c0a23e5c82d2aadc53b331d1ec1a9fa9d5', 121, 1, 'adminToken', '[]', 0, '2025-03-02 21:28:53', '2025-03-02 21:28:53', '2026-03-02 21:28:53'),
('0118952a9cfacec5b71e8b1483c66ac81db4dbf94661c4e98b199c53160f507f8f044bed42e20b61', 125, 1, 'adminToken', '[]', 0, '2024-12-17 23:41:06', '2024-12-17 23:41:06', '2025-12-17 23:41:06'),
('03b5e45c5358e51fe17ffbda866592bcee0da17cd4f66614e60b59fd4a1147c732513b18f148914d', 121, 1, 'adminToken', '[]', 0, '2024-12-13 12:34:11', '2024-12-13 12:34:11', '2025-12-13 12:34:11'),
('03d7c3c0a92c07f8d9a9529c3308aff1939b0c5eca011590bc90918af1c26e40ff3eb7d9cd03e68c', 118, 1, 'adminToken', '[]', 0, '2024-11-18 17:29:35', '2024-11-18 17:29:35', '2025-11-18 17:29:35'),
('03db5c797b4421ada2d161e85b5908f61465b5dba7001fc980393f868973ecde977de1a9afb12518', 121, 1, 'adminToken', '[]', 0, '2025-03-08 03:12:40', '2025-03-08 03:12:40', '2026-03-08 03:12:40'),
('03e111fbc2b62ecd808c6d99ca42aa7921f69ea72788d02d40792ff0167d8e0630ecae71c2abc613', 121, 1, 'adminToken', '[]', 0, '2025-03-06 13:36:58', '2025-03-06 13:36:58', '2026-03-06 13:36:58'),
('041a575aff2085b7460390e53c4e42115db9b7e5017648748063949de162f52b7fd581ff9dc707f4', 5, 1, 'adminToken', '[]', 0, '2024-09-05 17:53:01', '2024-09-05 17:53:01', '2025-09-05 17:53:01'),
('062b3e7295bc705c9769ff525869c1d77fafc2b548ab7c86a00d8dc7fb2d8432c89046f23f17b250', 121, 1, 'adminToken', '[]', 0, '2025-04-07 17:54:59', '2025-04-07 17:54:59', '2026-04-07 17:54:59'),
('06682fcb0fcae6af44dac5f04fe8bc10f7e090549c07bf58687d44f85d2ed2ae357ce226e1f94f6c', 5, 1, 'adminToken', '[]', 0, '2024-09-11 17:57:16', '2024-09-11 17:57:16', '2025-09-11 17:57:16'),
('06a8f1ea34e2f1a351a0d4d5203207d94bb782662d73fb69d6f8ffe14023a9d8e7dbfc392c9f0324', 5, 1, 'adminToken', '[]', 0, '2024-09-02 00:55:14', '2024-09-02 00:55:14', '2025-09-02 00:55:14'),
('085933f597777c7f8fdae81f387465193cf63f965cdf33b823de255bce3cb10e682dc3ff1a7146fc', 124, 1, 'adminToken', '[]', 0, '2024-12-18 18:51:02', '2024-12-18 18:51:02', '2025-12-18 18:51:02'),
('088ec0a6e8fd7dcb9e942a91cc50880bdf244ded9ed437d43805bf73795d68408b8134a6ad1a7af6', 121, 1, 'adminToken', '[]', 0, '2025-04-15 00:04:12', '2025-04-15 00:04:12', '2026-04-15 00:04:12'),
('08f3d7121c888e56aec0910b6aabf5be6ade296ce8c5d657db874cf87c281eb6c09b8fb0b25c2771', 121, 1, 'adminToken', '[]', 0, '2024-12-17 22:12:05', '2024-12-17 22:12:05', '2025-12-17 22:12:05'),
('090ea742e1331745edc0061e650d84086e104bfd980c614babff4ca91acdf15de68569fc63746891', 124, 1, 'adminToken', '[]', 0, '2024-12-13 21:02:58', '2024-12-13 21:02:58', '2025-12-13 21:02:58'),
('0b0fed23226525f62b2aecc34d50989535a33999e495093b2825020390102fad067899653c4db244', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:04:57', '2025-04-09 18:04:57', '2026-04-09 18:04:57'),
('0c55dab876c29712f2bb58d6b7d345bddb688954ce563e269a36335ba8745a03897e5c333c742644', 121, 1, 'adminToken', '[]', 0, '2025-02-01 19:50:44', '2025-02-01 19:50:44', '2026-02-01 19:50:44'),
('0c97e8ffd92c64b151ff5c72ad1531113d3fdd11c07facddec9fc5d6ce240931145922b44d52c0b7', 120, 1, 'adminToken', '[]', 0, '2024-11-19 20:00:47', '2024-11-19 20:00:47', '2025-11-19 20:00:47'),
('0cf87a6c8d520fd97bd66db872e8fc9b0196968d98b04772f4331d407be9e25751b63abd90f55919', 121, 1, 'adminToken', '[]', 0, '2024-12-10 03:24:10', '2024-12-10 03:24:10', '2025-12-10 03:24:10'),
('0dc151c8c33caa0545dd15dc87d037dc7b43312146d11015e4fd87da8ed8ab08174a6c8c16b13675', 121, 1, 'adminToken', '[]', 0, '2025-02-01 19:50:45', '2025-02-01 19:50:45', '2026-02-01 19:50:45'),
('0ef202f9c1bd17ba952160eb0c83e5b94d2e293ba7bbecd8255023d9e04501c01cd3adfb891303c9', 121, 1, 'adminToken', '[]', 0, '2024-12-23 19:46:27', '2024-12-23 19:46:27', '2025-12-23 19:46:27'),
('0f3541ab22a67513b576a5b8a8987bf96a23956d44dfc644a7133328e95875c6b35df62dc6b45ff9', 5, 1, 'adminToken', '[]', 0, '2024-11-17 22:04:24', '2024-11-17 22:04:24', '2025-11-17 22:04:24'),
('0fb7de90310d0903d4555f0a9ff3e0614c0d2fd6ff4f687f3ea77dea238e3b2ac82b5c599cdb12a3', 121, 1, 'adminToken', '[]', 0, '2024-12-25 12:24:34', '2024-12-25 12:24:34', '2025-12-25 12:24:34'),
('10c247771cdc9f8af3da1a76ff4ce25679cc93b627672733f9396cc0606e82095db872c27d1822a3', 5, 1, 'adminToken', '[]', 0, '2024-11-15 17:53:36', '2024-11-15 17:53:36', '2025-11-15 17:53:36'),
('135cfaff42ab47986dfeb3ba49f14aaa17338154bd47682a8d514ae70f0aef668d60231d18391933', 5, 1, 'adminToken', '[]', 0, '2024-08-30 23:49:50', '2024-08-30 23:49:50', '2025-08-30 23:49:50'),
('14ec9f3221603d703bc5b823fc4b775c9206c3311bf0d9ac17784d7e2f4affa97b9d2a27c339e5e3', 121, 1, 'adminToken', '[]', 0, '2024-12-18 20:11:35', '2024-12-18 20:11:35', '2025-12-18 20:11:35'),
('15a31f6ab02c562e468b4696ecf376b0d1d7c39020f3355bda78a6e3636d5cf36f9858d829f5de53', 5, 1, 'adminToken', '[]', 0, '2024-09-07 15:22:31', '2024-09-07 15:22:31', '2025-09-07 15:22:31'),
('189917cc7aa40558625fe475aad6be290f464a9809047c41134654afbaf921fae23374df298c1ac9', 140, 1, 'adminToken', '[]', 0, '2025-04-23 01:18:26', '2025-04-23 01:18:26', '2026-04-23 01:18:26'),
('192409c3b1b856284cd9b16f0b49237f24008c1a8d265811a6b77403ce361858b5fa17ea27f358e4', 121, 1, 'adminToken', '[]', 0, '2024-12-16 23:08:36', '2024-12-16 23:08:36', '2025-12-16 23:08:36'),
('1ab41565cf66ca14ee4358a071494e2f5f9b0fa53eb527c9a5b0bb48e67b2e06a4e8ab442a439381', 121, 1, 'adminToken', '[]', 0, '2025-04-14 23:41:31', '2025-04-14 23:41:31', '2026-04-14 23:41:31'),
('1ae0bfb49ad6874625c6d023521a10203f84a5432e0455ce3e1841f6f09e9aa2adc72daacc19d715', 120, 1, 'adminToken', '[]', 0, '2024-11-19 19:45:53', '2024-11-19 19:45:53', '2025-11-19 19:45:53'),
('1af68b22702a6cc606d5be8b3b022bde591743f20574ade765527a83a183b7f103c35c917e98fde7', 140, 1, 'adminToken', '[]', 0, '2025-04-22 05:55:34', '2025-04-22 05:55:34', '2026-04-22 05:55:34'),
('1b7e688e4f92809bc3294b7866f67622be93f276a7cf3d8aeb78cdd646eccc1c33fcce924e00d797', 121, 1, 'adminToken', '[]', 0, '2024-12-18 20:13:28', '2024-12-18 20:13:28', '2025-12-18 20:13:28'),
('1c51340bfa85b55779b9d7fe0eee0afdf5ccf1a5ceb74ef4ed25deed5bce3d30b51708cffacc74ee', 101, 1, 'adminToken', '[]', 0, '2024-08-30 18:39:03', '2024-08-30 18:39:03', '2025-08-30 18:39:03'),
('1c715359880ecfc61c60851b41c389759ad98bef7822a46ed16595001c1013c9cd2a227eeb5b3999', 121, 1, 'adminToken', '[]', 0, '2025-02-25 19:35:25', '2025-02-25 19:35:25', '2026-02-25 19:35:25'),
('1d9fa90d7c98b4c02e742713e7dd94a0687cd6c22bc95daab31a988b0ff432f7f6bef7429c5ea0ba', 124, 1, 'adminToken', '[]', 0, '2025-01-22 19:19:01', '2025-01-22 19:19:01', '2026-01-22 19:19:01'),
('1f4230ccd1f11f43fbb4dccfe1601e3c1341a3f013ee6d3cb50e7d63651107fcbebde00acbc8a513', 117, 1, 'adminToken', '[]', 0, '2024-11-18 17:57:46', '2024-11-18 17:57:46', '2025-11-18 17:57:46'),
('1f7e1d53789eba397c8364319e626e8a55b4a41d4d6e81d4c953b6f30d414c19827f03b0d2f2efb6', 121, 1, 'adminToken', '[]', 0, '2025-02-02 03:19:12', '2025-02-02 03:19:12', '2026-02-02 03:19:12'),
('20ed8f563c571e2cabd523388906836d092b82fe2c0636a8a533005f80299a1034e174ab8610173d', 5, 1, 'adminToken', '[]', 0, '2024-09-03 17:01:38', '2024-09-03 17:01:38', '2025-09-03 17:01:38'),
('21ac563ccde958c4f7b5cb164fb968652702cf8398310abd1fb9f31bdcddb86f82af990ace1c4a6c', 8, 1, 'adminToken', '[]', 0, '2024-09-11 17:59:12', '2024-09-11 17:59:12', '2025-09-11 17:59:12'),
('21c5f1b72267b26f7e0a828975c1fde454c3bcfcb8b494a6084c56a7a4df7af34910a570d52a127b', 121, 1, 'adminToken', '[]', 0, '2024-12-19 03:35:35', '2024-12-19 03:35:35', '2025-12-19 03:35:35'),
('22fcfc8e7efc7fcd3dbbff55752b2ed4c5c9fc35a95ee299e127025eec6af96c87c6995f12d70a55', 5, 1, 'adminToken', '[]', 0, '2024-11-13 22:31:18', '2024-11-13 22:31:18', '2025-11-13 22:31:18'),
('2446aecfc12495c9bb30ee2e9c0712448ad99f4600d68b548e463ebbfb34b52d4b2f973f05dbc02c', 120, 1, 'adminToken', '[]', 0, '2024-11-18 23:14:31', '2024-11-18 23:14:31', '2025-11-18 23:14:31'),
('246ba3a298366a197c5f4ba4e37a8ed49bfedb75da56bdf12aa5c14fee4311183a408b2431f3f772', 121, 1, 'adminToken', '[]', 0, '2025-04-14 15:40:43', '2025-04-14 15:40:43', '2026-04-14 15:40:43'),
('25eae075b8ce726e45a662867bad56e2a7606b7304c628394f99584a8594c016c6308742f5a2e268', 5, 1, 'adminToken', '[]', 0, '2024-08-31 08:04:35', '2024-08-31 08:04:35', '2025-08-31 08:04:35'),
('26f0449e5b10763f745ede7128f01a157e13eb5d5343ace0dab7ac025b939737c31c7d10439554d9', 1, 1, 'adminToken', '[]', 0, '2024-09-08 16:09:19', '2024-09-08 16:09:19', '2025-09-08 16:09:19'),
('2817a0e1606aa1f75820f713217d4897236c115974432279ac684cbb8ab43c8f107c9afc9faeaf89', 121, 1, 'adminToken', '[]', 0, '2025-02-01 19:48:58', '2025-02-01 19:48:58', '2026-02-01 19:48:58'),
('2a7414a8bcf55ac284f3e42736d438f9c127b4797cc7a83a13e94fa19449c9528b0797ceda17bb4d', 125, 1, 'adminToken', '[]', 0, '2025-01-02 16:53:47', '2025-01-02 16:53:47', '2026-01-02 16:53:47'),
('2b5197fdbacdfaead146a2dc23a1100732984911ba3e15802c5a4e7feff04c0e3630b93293abde10', 120, 1, 'adminToken', '[]', 0, '2024-11-18 23:20:33', '2024-11-18 23:20:33', '2025-11-18 23:20:33'),
('2bed7cbb926b240e89b52a3c6327e3862ef940ca76903bb0830e4652433d789671543086925b76ec', 117, 1, 'adminToken', '[]', 0, '2024-11-17 22:39:36', '2024-11-17 22:39:36', '2025-11-17 22:39:36'),
('2d2148069469a3466e080bf3b1e9b228054910fec9be7264ee623b468f5eea0bb4cbb7c4a1dde7a0', 118, 1, 'adminToken', '[]', 0, '2024-11-18 00:54:38', '2024-11-18 00:54:38', '2025-11-18 00:54:38'),
('2e3e503ad383ecfbff5b1f02198e9ea2e9681d842107d91f2d89617b26d4936d17cd3ed4140e8cda', 125, 1, 'adminToken', '[]', 0, '2025-01-02 22:28:06', '2025-01-02 22:28:06', '2026-01-02 22:28:06'),
('2f4980c7a79430a8648dcde898940256ad6754f5fc0da46a993d1e3f636a3dcd3f9e6c0e30e53adc', 5, 1, 'adminToken', '[]', 0, '2024-11-16 17:19:44', '2024-11-16 17:19:44', '2025-11-16 17:19:44'),
('2fd6b3cf29713849b6b3628eab2d5469c662bde279f27a03e674992fa73a4631073425c40e46276b', 118, 1, 'adminToken', '[]', 0, '2024-11-18 18:00:16', '2024-11-18 18:00:16', '2025-11-18 18:00:16'),
('30ca04378386b3af7d572aa9fa19e8a0bc72fb6995fdfaeaa18823b56755f0c99b070451b4949a2c', 140, 1, 'adminToken', '[]', 0, '2025-04-22 02:08:12', '2025-04-22 02:08:12', '2026-04-22 02:08:12'),
('30e7d1fdf8e8655e5ecc8d5d7af9b61ead2cdacb33d3244a6fdba3f87b63853f844912d2cd09c8a1', 121, 1, 'adminToken', '[]', 0, '2025-02-25 19:42:54', '2025-02-25 19:42:54', '2026-02-25 19:42:54'),
('3136ed44f8b3a9483d2e16d44294149c71e5a32c8218d21c1b61e2369e5e1f29686240d1da9fbef8', 5, 1, 'adminToken', '[]', 0, '2024-09-05 19:20:27', '2024-09-05 19:20:27', '2025-09-05 19:20:27'),
('324b3d2626b00841bebb2a4254fbf0e8f427d5d5bcccc8b03ea45ef97e819d9cdd5e37d53cc1f15a', 117, 1, 'adminToken', '[]', 0, '2024-11-18 16:10:14', '2024-11-18 16:10:14', '2025-11-18 16:10:14'),
('3371f1ad755a1260b39a713f167ace6e8f4d88c12febbb1874a92ad5acbd876527ec1f9580941228', 121, 1, 'adminToken', '[]', 0, '2024-12-18 16:22:10', '2024-12-18 16:22:10', '2025-12-18 16:22:10'),
('34283a7a681fc032c7f2aee3d64a2096015ab5e4bd59c30da40ff2f4ea8d6d9520315c492c1045f2', 121, 1, 'adminToken', '[]', 0, '2024-12-21 17:47:55', '2024-12-21 17:47:55', '2025-12-21 17:47:55'),
('35134ac54ea5d17b26f115dadc17645054ed355a24c6552a79acab4337138eaeddadb89446be3f91', 5, 1, 'adminToken', '[]', 0, '2024-11-16 12:23:30', '2024-11-16 12:23:30', '2025-11-16 12:23:30'),
('356da9c6dec1e20f76987d73b0fd00e8437189e41952fa34a0e294f86bd55b2f52a6e8c134181c6b', 123, 1, 'adminToken', '[]', 0, '2024-12-24 10:31:09', '2024-12-24 10:31:09', '2025-12-24 10:31:09'),
('3588d2700e2859bb4075f2f7b7643d9d4b85860a8994408d90dde426ee8fd8b5426083d6e9ff91f8', 121, 1, 'adminToken', '[]', 0, '2025-01-27 01:56:36', '2025-01-27 01:56:36', '2026-01-27 01:56:36'),
('37124053f41e0dadc7bb5cb666476d86a574050ba6c462473a107f8b91bcbf932806e7d22584a29f', 121, 1, 'adminToken', '[]', 0, '2025-02-25 19:35:52', '2025-02-25 19:35:52', '2026-02-25 19:35:52'),
('3a5e94a1aac32f380a868154f9558a833ee95df0e116cdbd092dcb64e391064e4930ca7bce9ecc5c', 121, 1, 'adminToken', '[]', 0, '2025-04-07 20:21:20', '2025-04-07 20:21:20', '2026-04-07 20:21:20'),
('3c110762543901783b8e40482c4e874591d0c04a01716b7de2e17dcd33df981e819f31af34d40495', 5, 1, 'adminToken', '[]', 0, '2024-09-08 18:11:30', '2024-09-08 18:11:30', '2025-09-08 18:11:30'),
('3f5505dbf331a8e91e66e98ec9010a1908ad74a51511592950beeecbd1dfd23436d724a3d6040943', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:04:07', '2025-04-09 18:04:07', '2026-04-09 18:04:07'),
('401a455ce0274d6f5e3b73347141849fed884ffab410b274c5b12c4616ebfd23b40b7faa0b685540', 5, 1, 'adminToken', '[]', 0, '2024-09-09 18:31:44', '2024-09-09 18:31:44', '2025-09-09 18:31:44'),
('41107dd961c4d1b63d1c4ac2bd20b5c2de6ceef31406e8030c4d1790cf17c0c7f0ca52862aee25ec', 120, 1, 'adminToken', '[]', 0, '2024-11-19 00:00:10', '2024-11-19 00:00:10', '2025-11-19 00:00:10'),
('432dda487acf4bb15331e1771036f088e8168dfb96d09224afd837f8ebb949415696f5f957dd509c', 121, 1, 'adminToken', '[]', 0, '2024-12-23 19:39:25', '2024-12-23 19:39:25', '2025-12-23 19:39:25'),
('44534f447686d5f248dc7ed22647aafa20f10ab0319ecf87f56058087ec94abfc40b9124f25023cc', 121, 1, 'adminToken', '[]', 0, '2024-12-07 21:46:26', '2024-12-07 21:46:26', '2025-12-07 21:46:26'),
('447ac7948bf41625ee5ba5808aec900f9e48d0a17965f703cb565a87ceade7f1fa2d6f56f25fd122', 5, 1, 'adminToken', '[]', 0, '2024-09-03 15:20:53', '2024-09-03 15:20:53', '2025-09-03 15:20:53'),
('4483b54dfa6954290236d49f6b56c3c43610bd9e2366b7fa1c6821076cce1c816dd42769cce7c0aa', 121, 1, 'adminToken', '[]', 0, '2024-12-21 19:35:33', '2024-12-21 19:35:33', '2025-12-21 19:35:33'),
('450c9d40f32155c7a173a4a57e05862e64e4be0811f306beb221fc6bd56c37e6da3bb7a824913949', 121, 1, 'adminToken', '[]', 0, '2025-02-08 17:08:00', '2025-02-08 17:08:00', '2026-02-08 17:08:00'),
('451c0e6b67d546b50679b3e2ea49b7ac24c1ad1cfc67fdc23844bb19491bb01f55ba244c293c3675', 6, 1, 'adminToken', '[]', 0, '2024-09-11 18:15:21', '2024-09-11 18:15:21', '2025-09-11 18:15:21'),
('4708fe6a73d06eb02694a0bc0823add1f83abc9c8493528b40839fbd3ffa8bb08cb9a243696ea264', 5, 1, 'adminToken', '[]', 0, '2024-10-23 21:05:16', '2024-10-23 21:05:16', '2025-10-23 21:05:16'),
('474fbb72f840181af2a7d25fc09d543b2da787862c4d763df4e65eb744ab97248ffbea44bae916b2', 8, 1, 'adminToken', '[]', 0, '2024-09-12 15:41:10', '2024-09-12 15:41:10', '2025-09-12 15:41:10'),
('49228740a0a0aad10ef3674d504835137221e4c8db4b0d2f31d52d58200a4c056347a1c91e10e731', 5, 1, 'adminToken', '[]', 0, '2024-09-01 05:54:31', '2024-09-01 05:54:31', '2025-09-01 05:54:31'),
('497ccc79b1982395f1b40749b4cf5ed086f163cd8a6c22968e196fc13453e9308fa0d3e61f27f6f8', 5, 1, 'adminToken', '[]', 0, '2024-10-21 11:04:43', '2024-10-21 11:04:43', '2025-10-21 11:04:43'),
('4b885263455e232d5ae1c18aff39365a129bd8ae7aa35e29fac0fea0da5c1628667aaa63470725b7', 121, 1, 'adminToken', '[]', 0, '2025-01-28 02:58:59', '2025-01-28 02:58:59', '2026-01-28 02:58:59'),
('4e6319312b21aa79311bb6ee8a41489c3eef626339c42a93b747781152a8c97e2ae913c43fab17aa', 2, 1, 'adminToken', '[]', 0, '2024-09-12 15:38:38', '2024-09-12 15:38:38', '2025-09-12 15:38:38'),
('50195d76d5a8fb48c6c2aacfe05f1f9e768b368fb184db8dc75bcbc8b46cab43042f411823a4816b', 2, 1, 'adminToken', '[]', 0, '2024-09-11 18:51:19', '2024-09-11 18:51:19', '2025-09-11 18:51:19'),
('502741ded4d9fa21816103c4e7ccf6dee72a2a68c9933819d62c3d72a7e0c792d2d595f43af9780e', 121, 1, 'adminToken', '[]', 0, '2025-01-03 15:05:09', '2025-01-03 15:05:09', '2026-01-03 15:05:09'),
('503883d5982d0af0c78938cd2d3333859137e395cb6f28285c8865e940aaee93f9605365f201dcb8', 121, 1, 'adminToken', '[]', 0, '2024-12-14 15:37:44', '2024-12-14 15:37:44', '2025-12-14 15:37:44'),
('50f3ceb488a6847ec56c9529316363f0d8c114624b16b241bb47e50903b241c4906736a3ac4c7449', 120, 1, 'adminToken', '[]', 0, '2024-11-18 23:22:49', '2024-11-18 23:22:49', '2025-11-18 23:22:49'),
('510643a679ac39637397264cf56359f4e3081724f62e0a1c3137aaecfde7492e384425f16d1404cf', 121, 1, 'adminToken', '[]', 0, '2024-12-22 20:22:33', '2024-12-22 20:22:33', '2025-12-22 20:22:33'),
('513a5b046fa29d452da728bb696e8fcdf4297305ff99eee12e880b05f54594a4d94f8914ebd7e41f', 121, 1, 'adminToken', '[]', 0, '2025-01-23 08:50:55', '2025-01-23 08:50:55', '2026-01-23 08:50:55'),
('51e8854a1eeb5a4d901ed6422f348d0bec0d10e358467013f5f5475dc2a2298cec54723e25b1340f', 5, 1, 'adminToken', '[]', 0, '2024-09-11 18:02:01', '2024-09-11 18:02:01', '2025-09-11 18:02:01'),
('52a2422985f938f8bfd564a82d7d0460dac7d85f5b24d89158d720ff1fe845e039e5b1550aa258cc', 124, 1, 'adminToken', '[]', 0, '2024-12-25 06:16:53', '2024-12-25 06:16:53', '2025-12-25 06:16:53'),
('52e6a805dc6c4378416cf9e0f664dd2eb5bb1e86acda4a24efd8149f882656f6466ed69244a4a3f5', 5, 1, 'adminToken', '[]', 0, '2024-09-05 17:31:07', '2024-09-05 17:31:07', '2025-09-05 17:31:07'),
('53c2eb1a123b5d949d62ab499ba5093a75c5e2f2af404c552d0e2738ed52c83aa64ee197ffa87c7c', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:05:14', '2025-04-09 18:05:14', '2026-04-09 18:05:14'),
('55a612f29ba31308ee47fa6b5078c73d0c29150ff61e6298f8624bcd32aa96dd03c22b313de8282d', 124, 1, 'adminToken', '[]', 0, '2024-12-21 20:25:30', '2024-12-21 20:25:30', '2025-12-21 20:25:30'),
('560c355687b5fe44aaea888a922403c28f947ffe576b393c755596e33157d06e485187379295ed70', 121, 1, 'adminToken', '[]', 0, '2024-12-07 21:48:51', '2024-12-07 21:48:51', '2025-12-07 21:48:51'),
('57848353d7dafee16ed7c1b8c3e42e021d13b345fda47e2eaaf81d83ac5f4cb69d2b5b700141e59b', 121, 1, 'adminToken', '[]', 0, '2024-12-17 19:15:25', '2024-12-17 19:15:25', '2025-12-17 19:15:25'),
('5785674add98fadf105ecd0deaa5f8e9850bea99fe06fae84386203a582c411edf3151d0145e1011', 125, 1, 'adminToken', '[]', 0, '2024-12-25 21:10:56', '2024-12-25 21:10:56', '2025-12-25 21:10:56'),
('579888e5bac777b7270e3fb6e82a320808bb5dc260a376fcfe2fbbd8930b29e4ea8a8dcceb979acc', 5, 1, 'adminToken', '[]', 0, '2024-09-07 15:24:51', '2024-09-07 15:24:51', '2025-09-07 15:24:51'),
('58b643d78344dd9d69e1554f8400e1f1a315473975a5a81ddce5a51b469505b2e1748c3b48b12d78', 121, 1, 'adminToken', '[]', 0, '2024-12-14 10:13:15', '2024-12-14 10:13:15', '2025-12-14 10:13:15'),
('597aba78b8e89315fb9aafe48812f3e6f07a4a5a051031bb05e5787326f759b8b7bd2d6b24c3d30f', 125, 1, 'adminToken', '[]', 0, '2025-01-01 11:19:41', '2025-01-01 11:19:41', '2026-01-01 11:19:41'),
('5a880624bcf395436cfd1d2ecd77a9149d81cf19c784491a7242201051844bf72b01ab4cddda8718', 123, 1, 'adminToken', '[]', 0, '2024-12-24 10:08:13', '2024-12-24 10:08:13', '2025-12-24 10:08:13'),
('5ad29a043cd2c6065bc5f78a33c47e859df56f92a47222094d522da43e97a7b206bfd7ee87ab48c0', 140, 1, 'adminToken', '[]', 0, '2025-04-22 19:04:32', '2025-04-22 19:04:32', '2026-04-22 19:04:32'),
('5b8a2d658a1f5d965ea30c1fb55195be090dfe3bc485a534b7928d99bff9aa1cd5df5ef89f435b32', 121, 1, 'adminToken', '[]', 0, '2025-02-11 15:45:03', '2025-02-11 15:45:03', '2026-02-11 15:45:03'),
('5b8d9f04f38f1fc8dea80694118da3fc87f45acf9bef41a41f1e61fe558656f108a06b6876d75386', 5, 1, 'adminToken', '[]', 0, '2024-10-23 16:20:10', '2024-10-23 16:20:10', '2025-10-23 16:20:10'),
('5bfb88a5ca532a0475087c5fb2384016f2f1f27c38406ad3353d2c9008e847104035dae2af68e11f', 121, 1, 'adminToken', '[]', 0, '2025-04-07 17:54:22', '2025-04-07 17:54:22', '2026-04-07 17:54:22'),
('5c61d857133318e775eb9d2bbc8eec85b7a5ced7878abf162ea17b99e43ee132b9a61c8a35ea9ca6', 121, 1, 'adminToken', '[]', 0, '2024-12-07 13:46:18', '2024-12-07 13:46:18', '2025-12-07 13:46:18'),
('5da130f738e4892d47196da6817e6118833f2731e2ba4adaab6b4627c7a044b852ac6293805c35dc', 5, 1, 'adminToken', '[]', 0, '2024-11-17 21:18:13', '2024-11-17 21:18:13', '2025-11-17 21:18:13'),
('5e17fd26b8902d9b304b0d105a98a9473662603c71cab0e78f870202d7fe288435d790928fb71f0f', 5, 1, 'adminToken', '[]', 0, '2024-09-07 17:02:53', '2024-09-07 17:02:53', '2025-09-07 17:02:53'),
('5f3bdb6869b53f7e7a7b7845fe2edddd51650ac87342375ed7ba0366332f560344b93d21d888d185', 118, 1, 'adminToken', '[]', 0, '2024-11-18 17:56:54', '2024-11-18 17:56:54', '2025-11-18 17:56:54'),
('5fef7a8a1de9a5523af33f518df035db3aa255db5a055adf7ce68c7af9a2e51319a9fdddd2294602', 121, 1, 'adminToken', '[]', 0, '2025-04-08 15:08:50', '2025-04-08 15:08:50', '2026-04-08 15:08:50'),
('60d476962834aaeb1a0c1a056a870bf2dd43b990c9765b20b7c669fd53edcea6a1dcf11c9c20d1e8', 121, 1, 'adminToken', '[]', 0, '2024-12-23 19:38:45', '2024-12-23 19:38:45', '2025-12-23 19:38:45'),
('61278ea84897037b146dbef8e65abf53044f0a0238db84de298b14c55e5f36c7605e9cf9914e2d43', 121, 1, 'adminToken', '[]', 0, '2025-03-10 02:57:29', '2025-03-10 02:57:29', '2026-03-10 02:57:29'),
('61468c73944e9d6a4a1e8ed1f7d0e20aaafbd9591a2ebfab489959277859d4bde6de5c88e60baf96', 121, 1, 'adminToken', '[]', 0, '2024-12-07 15:18:11', '2024-12-07 15:18:11', '2025-12-07 15:18:11'),
('616ba281dbb93172731829b2a4a77825d1e815d0e7100d5449bea5b7b7aa025b37a5761e8759e43c', 5, 1, 'adminToken', '[]', 0, '2024-09-07 16:47:32', '2024-09-07 16:47:32', '2025-09-07 16:47:32'),
('622d45f213c52f85568db8d9788e06c15814de24c567743c2befd566b0423ec68e8901107c63673d', 5, 1, 'adminToken', '[]', 0, '2024-08-31 17:03:59', '2024-08-31 17:03:59', '2025-08-31 17:03:59'),
('62b63a6e12ea724d15f7d1eb8a307264405129a3b0c8d52449e1ae253b815fa00bc459586f785b7a', 5, 1, 'adminToken', '[]', 0, '2024-09-01 19:45:12', '2024-09-01 19:45:12', '2025-09-01 19:45:12'),
('641626bb0660c2b332aa7f79dd5be6d9accab57122c08a716dcd6f8aa4b1d7c34ad3a8ba89ba62cd', 5, 1, 'adminToken', '[]', 0, '2024-09-07 19:27:44', '2024-09-07 19:27:44', '2025-09-07 19:27:44'),
('652d6072c7ab16768003b557cc4b7a94c8bd11f70a2432cee865b8ca4c5635688e97f674f507c082', 1, 1, 'adminToken', '[]', 0, '2024-09-03 15:05:50', '2024-09-03 15:05:50', '2025-09-03 15:05:50'),
('653a117a3d0fa43b4c56ad052805a7ff5927387406fbc84088a983f240de0772ef9c43f60eae55a6', 125, 1, 'adminToken', '[]', 0, '2025-04-21 15:09:46', '2025-04-21 15:09:46', '2026-04-21 15:09:46'),
('663bbb3498d964a4aac9466d2a8c9fb2c65ee865a7e89283c3286344cd17cd4274ef462bf75a5914', 121, 1, 'adminToken', '[]', 0, '2025-01-23 13:29:55', '2025-01-23 13:29:55', '2026-01-23 13:29:55'),
('66d99c832bc9e7bb3840815afa9d8c3d44de2840dff376d7e9d5c6f3b9859509e258a0a404076f6c', 5, 1, 'adminToken', '[]', 0, '2024-09-05 23:44:00', '2024-09-05 23:44:00', '2025-09-05 23:44:00'),
('6921d9723227265aa6f61d11c4d3810296af2911b4fe4d8d0a5335480c42265c8572b7307451b539', 119, 1, 'adminToken', '[]', 0, '2024-11-18 19:03:55', '2024-11-18 19:03:55', '2025-11-18 19:03:55'),
('6959cd5c2f754a4ae8198bd5bb791208491b9c100d247690d4e791b1cedd81011dd5daee38ad4291', 1, 1, 'adminToken', '[]', 0, '2024-09-11 18:00:12', '2024-09-11 18:00:12', '2025-09-11 18:00:12'),
('6a7252bc2b16f777e1dd2697a04459f382659b6c420ab29c3218885044638ca0a59a23a019210ece', 1, 1, 'adminToken', '[]', 0, '2024-09-02 00:52:09', '2024-09-02 00:52:09', '2025-09-02 00:52:09'),
('6b55e0a0f57ffef59aad76812b90c6cb8cad13e5075569ba12f91111a26e92244a35786c698b1a4f', 6, 1, 'adminToken', '[]', 0, '2024-09-11 18:33:21', '2024-09-11 18:33:21', '2025-09-11 18:33:21'),
('6c694b65e1d9bc401e685f96cae61a63e87adf10f0546318e4523f9a2ad3cc2a85daa7666471e610', 119, 1, 'adminToken', '[]', 0, '2024-11-18 23:34:15', '2024-11-18 23:34:15', '2025-11-18 23:34:15'),
('6cc8c958aa830493090b2820063f3791cf5b4434aa5a5f9c9bb85fb45558d4c0b42bf5667594fdb6', 121, 1, 'adminToken', '[]', 0, '2024-12-23 21:32:16', '2024-12-23 21:32:16', '2025-12-23 21:32:16'),
('6dd43e319007e7efb2b01ac491c94a91d2a69c17a294b9d14d08cd765159ad4e5fd6fd09df15d3ad', 121, 1, 'adminToken', '[]', 0, '2025-02-25 19:31:06', '2025-02-25 19:31:06', '2026-02-25 19:31:06'),
('6efd63229462fe66c192c7d0dc0f1d7c30e515ed6952d396b8eb489328285174a42f8028c0926c1a', 5, 1, 'adminToken', '[]', 0, '2024-09-03 16:57:07', '2024-09-03 16:57:07', '2025-09-03 16:57:07'),
('71d749f45663a8582524ebf319132d8a3f777714cbd1936bf2e0b7e9588c0e5b8794015b38d0b630', 140, 1, 'adminToken', '[]', 0, '2025-04-22 01:54:41', '2025-04-22 01:54:41', '2026-04-22 01:54:41'),
('71e858c6345afa90a563b20ff202907a9bf292b99ffe3a4e2b80decd67376a67c65de1a7f738e961', 6, 1, 'adminToken', '[]', 0, '2024-09-11 18:02:28', '2024-09-11 18:02:28', '2025-09-11 18:02:28'),
('724abf496b2078f06c28569447d553909f64c0f9710d3f9538c737a8781d959e09f2eba94b718ad3', 5, 1, 'adminToken', '[]', 0, '2024-09-05 19:19:30', '2024-09-05 19:19:30', '2025-09-05 19:19:30'),
('75068dd229004e91ee07164c52113c0b1e488f059848a22a1e301abb883f778d0cb7cf6a69a2e118', 121, 1, 'adminToken', '[]', 0, '2025-04-12 23:14:20', '2025-04-12 23:14:20', '2026-04-12 23:14:20'),
('7523be40e410e77fa8c7a208c3bfd6d409c4a2d7a08fd2dc0ec227ea55b4c8aa9a795e069ac18ebd', 125, 1, 'adminToken', '[]', 0, '2025-01-02 17:21:53', '2025-01-02 17:21:53', '2026-01-02 17:21:53'),
('755e861c80ceee674c63a503a1f00c1b1c1975f14f756a887225af4d6526099100f3d39c3ac21519', 119, 1, 'adminToken', '[]', 0, '2024-11-18 20:37:37', '2024-11-18 20:37:37', '2025-11-18 20:37:37'),
('75a3bf5045618fb364c440bb85b2487cd449077199455018a358c6ccea73f9e9a348d49ecae4f08c', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:04:52', '2025-04-09 18:04:52', '2026-04-09 18:04:52'),
('76088ae309568ac4d9536d71a5797a0f0bebeede430fe02124792b2a653f9efd33d962cacc5a193e', 121, 1, 'adminToken', '[]', 0, '2025-04-12 23:05:52', '2025-04-12 23:05:52', '2026-04-12 23:05:52'),
('76f80d4d87e5356b248233bb815a42fc333c8d3a2fd71731674d893330cd6c2242d98514fda61f0b', 5, 1, 'adminToken', '[]', 0, '2024-09-06 22:48:05', '2024-09-06 22:48:05', '2025-09-06 22:48:05'),
('77be8704a059a9c06cb7b77544fb4442fea08a8d6b1e8f4630ea866ab081346fef74a4659027d896', 121, 1, 'adminToken', '[]', 0, '2025-04-08 19:25:55', '2025-04-08 19:25:55', '2026-04-08 19:25:55'),
('78baede8bec835c4db6e49b3ff7b8519d0e2f7677f5ef70d37018c077a97ec83621d13f6dd0ac9e4', 121, 1, 'adminToken', '[]', 0, '2024-12-13 20:14:41', '2024-12-13 20:14:41', '2025-12-13 20:14:41'),
('793607af0ebae647223e6fb74b9d0dcc79b7dc3f0252ec142696b574bf2935239ca16336940dc9e4', 140, 1, 'adminToken', '[]', 0, '2025-04-17 01:40:14', '2025-04-17 01:40:14', '2026-04-17 01:40:14'),
('7a50aa7480cd949c9e8849d9aa6544391ee19988676ee31ffc1aa668643193df792318f96544ef58', 121, 1, 'adminToken', '[]', 0, '2025-04-07 20:24:33', '2025-04-07 20:24:33', '2026-04-07 20:24:33'),
('7be06b2719b412175549da2195e6567d3c534419dcf5b9f1848080f24bd0fd533274fe48220e8128', 121, 1, 'adminToken', '[]', 0, '2024-12-18 15:26:16', '2024-12-18 15:26:16', '2025-12-18 15:26:16'),
('7ee09b27e2b0e3b7127e73cc7414dc7093f4c5ca8d3a8bd54b0227ab05a8fcc57eea1f41977521b8', 121, 1, 'adminToken', '[]', 0, '2025-04-09 17:29:17', '2025-04-09 17:29:17', '2026-04-09 17:29:17'),
('7f0307005e64466e163772cc230f2ea748c14f4c00ac529aff0db8b90cee9f5e305387d7898fae6f', 124, 1, 'adminToken', '[]', 0, '2025-01-22 21:55:27', '2025-01-22 21:55:27', '2026-01-22 21:55:27'),
('7f3e112cfb7545af0bc3376191c546735eda85e7d31dff8c3fd81f00b59c612c4492a9f6fdf70cf6', 5, 1, 'adminToken', '[]', 0, '2024-10-21 21:38:02', '2024-10-21 21:38:02', '2025-10-21 21:38:02'),
('800a50d0de516d2792d4bd5d67b67f6905331ebb8d03e694a7eb6cd640b66bf7f1023719e012d6e3', 121, 1, 'adminToken', '[]', 0, '2024-12-27 20:37:55', '2024-12-27 20:37:55', '2025-12-27 20:37:55'),
('823607277cb27149bcb0414ccd12f72d98b6fae344312e1b892aa12e4b52b50aa141a6ef247a6a60', 121, 1, 'adminToken', '[]', 0, '2024-12-18 16:08:02', '2024-12-18 16:08:02', '2025-12-18 16:08:02'),
('82b40df719f21169c92c79292723a11e7bea542f7a1243b00b002e58fed73c5bf3c65231ebed0925', 1, 1, 'adminToken', '[]', 0, '2024-09-03 15:04:12', '2024-09-03 15:04:12', '2025-09-03 15:04:12'),
('83bdd842a15dc20f9ee5c12a6e6852546da9e629fa783ccc89e89cada84c6edea8e4d03e3ef3b0fb', 2, 1, 'adminToken', '[]', 0, '2024-09-11 18:33:01', '2024-09-11 18:33:01', '2025-09-11 18:33:01'),
('846d79a38f149d49aa30c4bb946cf1d56a2f148f9561f1b3a1b62b6f52f4599d6bf53d2105e3985b', 124, 1, 'adminToken', '[]', 0, '2024-12-25 09:40:31', '2024-12-25 09:40:31', '2025-12-25 09:40:31'),
('87dee957497555aa6e5d89a4df8d143c041a57e72042f10439a4b6c0188898b7a1cafe633d77ed11', 125, 1, 'adminToken', '[]', 0, '2024-12-16 23:00:57', '2024-12-16 23:00:57', '2025-12-16 23:00:57'),
('885f9e5af4330fd89bf0cbf84d1985fe9bb10c73bc90f9025ec89e4e8406b3caed154ff218784cc3', 121, 1, 'adminToken', '[]', 0, '2025-03-08 02:40:22', '2025-03-08 02:40:22', '2026-03-08 02:40:22'),
('8a301679039c759fd00e9423029e6443055c9d1330465b5a75feb4d85d48a4235d8905aa44097354', 1, 1, 'adminToken', '[]', 0, '2024-09-03 15:00:13', '2024-09-03 15:00:13', '2025-09-03 15:00:13'),
('8b107fd1e4d8cab2de4d70259abd030b8d49cc8920c50f12ac2e3a9731a346efbdb2d2be7f6ab30a', 121, 1, 'adminToken', '[]', 0, '2025-01-28 12:07:08', '2025-01-28 12:07:08', '2026-01-28 12:07:08'),
('8bc3e6425d0c783b186141f84fd56be16a203ce6747e0613cc70b37831066a8de76da365e43416be', 5, 1, 'adminToken', '[]', 0, '2024-09-06 23:20:27', '2024-09-06 23:20:27', '2025-09-06 23:20:27'),
('9170a38bfaa2ff9d0d1ea4e27032d4b94d1c7022f732fb1bf27a657f4bb96509b80576e2495a7645', 1, 1, 'adminToken', '[]', 0, '2024-09-07 19:05:37', '2024-09-07 19:05:37', '2025-09-07 19:05:37'),
('91a4fc33881a5d17ce0a74fc1ec467c749febadd3cf0f877aa83ae200679b7f15b125b37c70b2de5', 1, 1, 'adminToken', '[]', 0, '2024-09-07 17:02:05', '2024-09-07 17:02:05', '2025-09-07 17:02:05'),
('94006af8eca2b8b3c0f90f0c26b4d37be37dcc93d3453cf24b5ebbc64be146acd9113054bb878c2b', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:05:00', '2025-04-09 18:05:00', '2026-04-09 18:05:00'),
('942325ee307912be357ba3e251f4b37cf3cdc76374f4cd726f0a4d561cd1237892826a591cd39f2c', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:03:29', '2025-04-09 18:03:29', '2026-04-09 18:03:29'),
('9524527e3232e2210ca80363201159a9ba7d24f7b8c1255dbd96c2d5ed85fdbb2770dbaf1454df28', 119, 1, 'adminToken', '[]', 0, '2024-11-18 22:01:58', '2024-11-18 22:01:58', '2025-11-18 22:01:58'),
('959e3df6c3070bf00c6ffdce3a9e4cb4023faa1ebe06fc6d843eb70bcac8e6837a32924592c80ac6', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:03:35', '2025-04-09 18:03:35', '2026-04-09 18:03:35'),
('96251440e47c1a091e60f3ac02b60cb31a73185b22cf64603fa7a6e0126ca1895355ee821fdadd39', 121, 1, 'adminToken', '[]', 0, '2025-02-10 17:10:25', '2025-02-10 17:10:25', '2026-02-10 17:10:25'),
('968eba40a04d45b59581a750041218709c684c869513691a6fa0690e74a2d4ed63cf9e512b0b41d3', 6, 1, 'adminToken', '[]', 0, '2024-09-11 18:43:58', '2024-09-11 18:43:58', '2025-09-11 18:43:58'),
('96aeec74d66eab099fee4e8cc2af67d57bf287f4914ae4caca023ec46e485ae6a638b09e500e043e', 125, 1, 'adminToken', '[]', 0, '2025-01-02 15:22:35', '2025-01-02 15:22:35', '2026-01-02 15:22:35'),
('973726983a3fde04a17fbcc6d0713d9d278ac14b2053e66a2212ade39b3d88bbfebc70fd5e7988f4', 121, 1, 'adminToken', '[]', 0, '2024-12-19 16:49:32', '2024-12-19 16:49:32', '2025-12-19 16:49:32'),
('98a3d333973fd12917999bee568ec79486c92d10ce0cd5c6b8def0641ab3dd842cf0178bc79cd679', 5, 1, 'adminToken', '[]', 0, '2024-09-03 14:26:40', '2024-09-03 14:26:40', '2025-09-03 14:26:40'),
('995711224bdaf5b1886bd8bb1a65dc9565504c0a370a84b1b8af2cca1d1b88086360e2873562b06a', 140, 1, 'adminToken', '[]', 0, '2025-04-17 17:02:55', '2025-04-17 17:02:55', '2026-04-17 17:02:55'),
('99adb099d3a1b141ee7a3192d90c273c44fa35e0aae63dbaa2b0bd2dcbffc900aa81e21d111c2b36', 5, 1, 'adminToken', '[]', 0, '2024-08-29 22:00:18', '2024-08-29 22:00:18', '2025-08-29 22:00:18'),
('9ab2e478f36b1b214b217b33539a9f05a9ed5643edb28c73c5075f617a4891c852c1f8bc23fea46d', 121, 1, 'adminToken', '[]', 0, '2024-12-25 17:18:29', '2024-12-25 17:18:29', '2025-12-25 17:18:29'),
('9c9e8f9c8a5a6c590b9322cce88d53087447cfa8af19039503fccc422c3a25e9caaa97bad1e92cd5', 121, 1, 'adminToken', '[]', 0, '2025-02-13 03:13:21', '2025-02-13 03:13:21', '2026-02-13 03:13:21'),
('9d5418bc88deb2cc9d5468f014d9bfa12c48c09bf16a54cc43c024f691e13a045389baa81a8a7fe9', 5, 1, 'adminToken', '[]', 0, '2024-11-16 15:43:42', '2024-11-16 15:43:42', '2025-11-16 15:43:42'),
('9db02768df9607a4e941609e2236543e01921f3d4e01e14aa23cd7c4e1a36431017ed6a37b0b23b8', 124, 1, 'adminToken', '[]', 0, '2024-12-21 19:33:43', '2024-12-21 19:33:43', '2025-12-21 19:33:43'),
('9e0cd947d3d38af655e518353eeef16d374c7a80a91ec4881e6d4861574001baf6e9c93008b22782', 1, 1, 'adminToken', '[]', 0, '2024-09-03 16:56:21', '2024-09-03 16:56:21', '2025-09-03 16:56:21'),
('9f550e2630c1dc75c5d7c3ea8f33de47b4132b670d37ee2c3c1e3d674ae9f41f9a4524f9d2c162ce', 121, 1, 'adminToken', '[]', 0, '2025-04-07 17:56:10', '2025-04-07 17:56:10', '2026-04-07 17:56:10'),
('9fa190815f68f2ec33a218f09da00c0e5366007e4b466f8e55bda7de1b9e561cd0643eae1c4d9011', 1, 1, 'adminToken', '[]', 0, '2024-08-31 07:54:08', '2024-08-31 07:54:08', '2025-08-31 07:54:08'),
('9fd9aaea7d31d8c8bf44fdee0b2ea5d85b829b800ad9d699c27f23463e0bee482a411c94ef51c7ab', 117, 1, 'adminToken', '[]', 0, '2024-11-18 00:44:18', '2024-11-18 00:44:18', '2025-11-18 00:44:18'),
('a0412c0a9d552ad91df8d701a1ce8ba7e1e8a3148e11446178cdba39d3a2c0e0df8bee64a9ed0798', 121, 1, 'adminToken', '[]', 0, '2025-02-08 17:15:23', '2025-02-08 17:15:23', '2026-02-08 17:15:23'),
('a1d9351ff5c6b1a46241451232ae5f5ed6fa129f9fda761c249795046429e1eaf5d011ffbd946244', 121, 1, 'adminToken', '[]', 0, '2024-12-17 20:15:08', '2024-12-17 20:15:08', '2025-12-17 20:15:08'),
('a58eae15be0f97086235f5d5a76b7ca12ebc21136a631d0a8eceeb72fe95a561f31851eea7db3119', 5, 1, 'adminToken', '[]', 0, '2024-09-07 16:13:20', '2024-09-07 16:13:20', '2025-09-07 16:13:20'),
('a6340566d8612de48ed426983eeedaf98a0254de0ab2cdf8c90a448080d1565ffe1e8f0fad36fc21', 121, 1, 'adminToken', '[]', 0, '2024-12-23 15:29:36', '2024-12-23 15:29:36', '2025-12-23 15:29:36'),
('a91bf2a61d170f4d38c7190def5633439485eee4ab94dbfe0b40d29327a9f177359b5af21d8f9822', 125, 1, 'adminToken', '[]', 0, '2024-12-27 22:45:36', '2024-12-27 22:45:36', '2025-12-27 22:45:36'),
('aa3161dc458c53846c18284cf40af4a2db29c9a71723eabf5e784ef6531921ad6896b06df0b5246b', 121, 1, 'adminToken', '[]', 0, '2025-01-02 17:15:51', '2025-01-02 17:15:51', '2026-01-02 17:15:51'),
('aa4611223383bac3a21c675652681ff902d36ab72446d5b005993c8bebaddb6fb4d1a5ba02db12e4', 117, 1, 'adminToken', '[]', 0, '2024-11-18 00:48:47', '2024-11-18 00:48:47', '2025-11-18 00:48:47'),
('ac3d8337f7f2be06a98c1082e79a7cfad0572c2476823f33e5e76309d173e19b6702238a3fe74ef1', 5, 1, 'adminToken', '[]', 0, '2024-10-16 22:04:03', '2024-10-16 22:04:03', '2025-10-16 22:04:03'),
('ac4a69fba9f548445263c96da3a41bfe43383b4574b1c43aaca3dd3ec2b9636614042199de8f89ed', 140, 1, 'adminToken', '[]', 0, '2025-04-22 02:10:26', '2025-04-22 02:10:26', '2026-04-22 02:10:26'),
('ad1578a342475a6f349c2b8648964bccda4a256f2d5c19be47053965315c5ae3e5d19beb58b58777', 121, 1, 'adminToken', '[]', 0, '2024-12-18 19:06:25', '2024-12-18 19:06:25', '2025-12-18 19:06:25'),
('ad1d9454d4e01d812eeac269856736524921420364c9009029190b81152f90fb374913b186b50c36', 5, 1, 'adminToken', '[]', 0, '2024-11-15 14:26:28', '2024-11-15 14:26:28', '2025-11-15 14:26:28'),
('afa333421e29d089610d5f96a5157472468eb84a254aaafc265093d2649d4e88e6e408f4c3cf67f7', 6, 1, 'adminToken', '[]', 0, '2024-09-11 18:53:51', '2024-09-11 18:53:51', '2025-09-11 18:53:51'),
('b11752bd9dd0db0debd3922025be05eb04406e08906558ac4adeb84c6353de2e970e3412f0911263', 125, 1, 'adminToken', '[]', 0, '2024-12-27 22:24:07', '2024-12-27 22:24:07', '2025-12-27 22:24:07'),
('b18a1cd0bf42621b593ac0f823697d825b5ba3a5f373f388a25725e2aea7da589062effb1218a79c', 120, 1, 'adminToken', '[]', 0, '2024-11-19 16:46:37', '2024-11-19 16:46:37', '2025-11-19 16:46:37'),
('b2225ea692eae6e063d729a808873375db6a898bf3213ec20528f9af593ac7e820af35552ca3cbe3', 1, 1, 'adminToken', '[]', 0, '2024-09-03 16:58:42', '2024-09-03 16:58:42', '2025-09-03 16:58:42'),
('b234d003df4374aa48c39817062a126eb16bcd00a7be24553f796fea55dbe9742020740a9f93bfcb', 121, 1, 'adminToken', '[]', 0, '2025-01-18 20:50:42', '2025-01-18 20:50:42', '2026-01-18 20:50:42'),
('b25b5f2dc8c2d9a96a80f3c60b1f99e824fc7c3544439a60b5eb2d53983cf51aae29ca2050e5e325', 124, 1, 'adminToken', '[]', 0, '2024-12-25 20:52:42', '2024-12-25 20:52:42', '2025-12-25 20:52:42'),
('b3a9b40d78227206329ed036bc7f7007fb0dd99d99c9ae46b81f654ffe329acaad6eae9c277ce478', 125, 1, 'adminToken', '[]', 0, '2025-04-22 01:47:27', '2025-04-22 01:47:27', '2026-04-22 01:47:27'),
('b48ce01f7f8cc2d88e1a3c79f23312fd8d8a581e30028e7c9a40ab5b84375ba4dd7b597a4f58f8e7', 121, 1, 'adminToken', '[]', 0, '2024-12-10 18:46:14', '2024-12-10 18:46:14', '2025-12-10 18:46:14'),
('b49c1f00abf7f5eea2647f5b6abce3793d9eda09598ad94d0bbeb52ba632ffd003f85d1d611e2b17', 121, 1, 'adminToken', '[]', 0, '2025-01-27 01:39:06', '2025-01-27 01:39:06', '2026-01-27 01:39:06'),
('b4aa26b6a1e1792069db210fab145dd1736c2f3875f9c89ac832710af889dbb1f061c876da830b28', 5, 1, 'adminToken', '[]', 0, '2024-08-29 21:32:20', '2024-08-29 21:32:20', '2025-08-29 21:32:20'),
('b5f9f853e6fcf0c716a08f84f998ca5b86a92ef887d5ecf5db042381680b840d06bbacfe511dcba5', 121, 1, 'adminToken', '[]', 0, '2025-02-01 14:51:15', '2025-02-01 14:51:15', '2026-02-01 14:51:15'),
('bb1af7218b13d2226fb37be29b63490c9ddc72f2334aaddf4c68f451d03f6581d961deddf92d4ade', 121, 1, 'adminToken', '[]', 0, '2025-04-08 15:07:41', '2025-04-08 15:07:41', '2026-04-08 15:07:41'),
('bb1cfb7cd923b8b2dff03d0b4015ede74bece7dbb37e2153efecd4b1e015c235aaec6348d81ed9de', 6, 1, 'adminToken', '[]', 0, '2024-09-11 18:35:44', '2024-09-11 18:35:44', '2025-09-11 18:35:44'),
('bbb9c1d2ccb5b8d40f9f95137e0dbb988b422ed8fad118153763bb2c69ee58dbf0fb03b799a06b6a', 5, 1, 'adminToken', '[]', 0, '2024-08-31 22:14:37', '2024-08-31 22:14:37', '2025-08-31 22:14:37'),
('bbd8ae2fd94f58812d66a308a9cec2ab9ac44fead4c01757b5b9ec7f8b556e71594c4ff5ac1b5f17', 125, 1, 'adminToken', '[]', 0, '2025-04-22 01:40:56', '2025-04-22 01:40:56', '2026-04-22 01:40:56'),
('bc185092574360ff08a492d74f85dd37a5b78ae9ff9721d537997299a6bccbbbbcd3ea6ccfa6ae94', 140, 1, 'adminToken', '[]', 0, '2025-04-22 18:37:33', '2025-04-22 18:37:33', '2026-04-22 18:37:33'),
('bd331587156c3e349d604615bb6cca26f187076fa9bdc84508ea5bb0b9097972c0786f7b873466ca', 120, 1, 'adminToken', '[]', 0, '2024-11-19 17:51:39', '2024-11-19 17:51:39', '2025-11-19 17:51:39'),
('be2c0209e80b3ce8277f8b62b482a88c4df3214610f28894c8157aae99a7b97e57a28cbffd62ec0a', 2, 1, 'adminToken', '[]', 0, '2024-09-12 15:39:28', '2024-09-12 15:39:28', '2025-09-12 15:39:28'),
('c245d152251cb9ad99e6f1e3268c11988a8e9ef27d6a666b84a17a513507b38beb36ca6c737f74fa', 125, 1, 'adminToken', '[]', 0, '2025-01-06 22:56:33', '2025-01-06 22:56:33', '2026-01-06 22:56:33'),
('c2a362740c99843cc499b7752fabad061ae55fac9143a04aaf62e17c60af0ec027d15895db774b7a', 117, 1, 'adminToken', '[]', 0, '2024-11-18 16:08:23', '2024-11-18 16:08:23', '2025-11-18 16:08:23'),
('c437049d3c684bb7936ec26edd39ae294b1c21c9f35dd4cf078cd7fe24104ab3028f23ef0ca6f6f4', 121, 1, 'adminToken', '[]', 0, '2025-04-08 14:29:50', '2025-04-08 14:29:50', '2026-04-08 14:29:50'),
('c5f5d25b70b5f7adaa7919065422c92524440d34a385a96d4e68be7ade4df11f1b8398bcaeacaa15', 121, 1, 'adminToken', '[]', 0, '2025-01-19 13:31:41', '2025-01-19 13:31:41', '2026-01-19 13:31:41'),
('c63b0992b15d9c6ac034e611868041fcf10160095f07858bcf38739b244ba65f85f8091c6dbd7842', 5, 1, 'adminToken', '[]', 0, '2024-10-18 15:13:44', '2024-10-18 15:13:44', '2025-10-18 15:13:44'),
('c6a87fa5efc46a4ba91b377a0a38e2e8a51cbb86289f61cd9b9bf60ad77bbf95358c001879f72165', 121, 1, 'adminToken', '[]', 0, '2025-03-08 02:40:44', '2025-03-08 02:40:44', '2026-03-08 02:40:44'),
('c81c2dd88bac52a3be3c8ce3aea79528de9279f1e9448dd7f21665c8541bf91c46274e1f24b65aa8', 120, 1, 'adminToken', '[]', 0, '2024-12-07 01:40:41', '2024-12-07 01:40:41', '2025-12-07 01:40:41'),
('c99c02016e9c60773199f33d4a25e65c033145a9575dea552d07a3df7feffd91a22809d54e8874e7', 121, 1, 'adminToken', '[]', 0, '2024-12-09 19:08:41', '2024-12-09 19:08:41', '2025-12-09 19:08:41'),
('ca966609a5997401584ac4f1444f65c81deee836c8075a9051947ecd83c21e93ebc474512208e65e', 121, 1, 'adminToken', '[]', 0, '2024-12-17 11:13:59', '2024-12-17 11:13:59', '2025-12-17 11:13:59'),
('ccfa34d2233fcd90557aadafa324251a34888afe676eaa3e5eab6e2c3d2f29cf7ec6bf868647ba9e', 121, 1, 'adminToken', '[]', 0, '2025-02-01 19:50:42', '2025-02-01 19:50:42', '2026-02-01 19:50:42'),
('cd729560c1b93cdb275f63a67f49ed99b593bf024274a205b22ca9acddc5b0d5feca1a89515a53d2', 8, 1, 'adminToken', '[]', 0, '2024-09-12 09:07:20', '2024-09-12 09:07:20', '2025-09-12 09:07:20'),
('cf4f15866c657f05ce173d7b5f7d98a1b8693c442519388247bd679788c1b687136fdbd07a0eda96', 121, 1, 'adminToken', '[]', 0, '2024-12-21 21:51:43', '2024-12-21 21:51:43', '2025-12-21 21:51:43'),
('d00ad598bdeb29dccdefa8b0e6effa91632e03fb3dda6f2526e92e9e12c8e4feb737a085d8c2283f', 121, 1, 'adminToken', '[]', 0, '2024-12-23 06:28:16', '2024-12-23 06:28:16', '2025-12-23 06:28:16'),
('d245249045294b3dc869a4e0b565ae40b1543c26194f42d7c2c6df73f54147ebec62ebacdeee63d3', 5, 1, 'adminToken', '[]', 0, '2024-11-02 19:09:03', '2024-11-02 19:09:03', '2025-11-02 19:09:03'),
('d2a093f2ba9673fd320c3de9257eaf9f8a5c4e3525b28bf0a668629575f7fb62b377f3b8f6bddd9a', 121, 1, 'adminToken', '[]', 0, '2025-02-01 19:49:06', '2025-02-01 19:49:06', '2026-02-01 19:49:06'),
('d34bb112dd8fce3e4aa208b201678300f1231c87ff59f335a806e0a5bf90fc6b9f9a55139bb9d4d5', 5, 1, 'adminToken', '[]', 0, '2024-08-29 22:11:53', '2024-08-29 22:11:53', '2025-08-29 22:11:53'),
('d3a9f7c72522859bbd36635e39ee072934ac77a5fe2ae0cde6fc8b639d5b96e2eca1f6c5ecdbb23e', 5, 1, 'adminToken', '[]', 0, '2024-09-05 20:09:16', '2024-09-05 20:09:16', '2025-09-05 20:09:16'),
('d4c817d22568bcbe0ab3942f4e9a513453bc145087a5e5333025b6d2f258f257b0c1a3d195534dde', 5, 1, 'adminToken', '[]', 0, '2024-08-31 00:23:08', '2024-08-31 00:23:08', '2025-08-31 00:23:08'),
('d4d758a00c35c79160a10835f42a130e8e4889395174b2de2a6e1839c8a959e08135697022aebb3a', 118, 1, 'adminToken', '[]', 0, '2024-11-18 17:52:46', '2024-11-18 17:52:46', '2025-11-18 17:52:46'),
('d6f55473201d868655f149aafe457f79c6392a6c8975f667730fa096c8983d89582e881588187018', 120, 1, 'adminToken', '[]', 0, '2024-12-07 01:55:45', '2024-12-07 01:55:45', '2025-12-07 01:55:45'),
('d86881d09c68f60c84696e8bbb94ee69fcecd54a3273ae4a0046cd8f8fe95c2ff85b343e3a322ebe', 140, 1, 'adminToken', '[]', 0, '2025-04-17 17:04:24', '2025-04-17 17:04:24', '2026-04-17 17:04:24'),
('d97c833ea4cdf819d5e591fbb25835852235a600fa33ba618a1dddef92f2171820e6466d61509093', 124, 1, 'adminToken', '[]', 0, '2024-12-17 20:17:25', '2024-12-17 20:17:25', '2025-12-17 20:17:25'),
('d99de4cbb42f423a21c622acbf157e91fc7038c303d076f0776cff807c93186662c2102b17bbef1e', 124, 1, 'adminToken', '[]', 0, '2024-12-25 20:50:23', '2024-12-25 20:50:23', '2025-12-25 20:50:23'),
('da6ee52efb893b03e772e6d63fd7707ebc6d6a0571dda5077fb00307f3717ed4b0b6ef6a530ef2ff', 120, 1, 'adminToken', '[]', 0, '2024-12-04 18:57:28', '2024-12-04 18:57:28', '2025-12-04 18:57:28'),
('dac78a0c8945dbaac1bdc3a8a8d2b089d03a39b027cf6127ee853058aa39ca6494f19a686080a6a8', 117, 1, 'adminToken', '[]', 0, '2024-11-18 15:52:23', '2024-11-18 15:52:23', '2025-11-18 15:52:23'),
('dbd2853aec4da2cb616904744ca82d798332288287a65de07bfa05535ba717a3df355c856966d1cf', 140, 1, 'adminToken', '[]', 0, '2025-04-22 19:24:38', '2025-04-22 19:24:38', '2026-04-22 19:24:38'),
('de83d2b3e324dda82bd86b0fcaf23364937a648e5e2acf70b8a75c0f9ce9e0f46ccd3814ec2c24f7', 125, 1, 'adminToken', '[]', 0, '2024-12-25 22:13:26', '2024-12-25 22:13:26', '2025-12-25 22:13:26'),
('dfae6c18bf909ae96d623e4b92fa7aaa37e190f32c94919572a8bc8040f8d3e1978da3ab7b3c7e5d', 121, 1, 'adminToken', '[]', 0, '2024-12-17 11:12:19', '2024-12-17 11:12:19', '2025-12-17 11:12:19'),
('e1c71273c5472a4953c15cda46a3bf71c143f70371d16cb718674a9b2070136ba42939494c1c1f07', 121, 1, 'adminToken', '[]', 0, '2024-12-23 14:29:06', '2024-12-23 14:29:06', '2025-12-23 14:29:06'),
('e25cc84dc22e7de99b2ff1304ec5452300ec2b5f39fa6c1313aaabbf0d9f68e2e879281cd41d4e34', 2, 1, 'adminToken', '[]', 0, '2024-09-11 18:53:02', '2024-09-11 18:53:02', '2025-09-11 18:53:02'),
('e29e7eac14eafa10169cd7212e332114e073043361e1e77c91d2dd05862afefb2f957818b6a35047', 121, 1, 'adminToken', '[]', 0, '2024-12-21 20:24:28', '2024-12-21 20:24:28', '2025-12-21 20:24:28'),
('e3d0ba20501875a1f5d64a5c9f1bbe0581fe10e70b7cbde0ce191b18143b3bc9f02b68763ab1ae2c', 5, 1, 'adminToken', '[]', 0, '2024-09-05 19:17:36', '2024-09-05 19:17:36', '2025-09-05 19:17:36'),
('e59c5358af49c031d9045e7e40ecf080f661ded923168f04a3d15ff762f4ef43dda91426eb644f79', 124, 1, 'adminToken', '[]', 0, '2024-12-23 21:47:57', '2024-12-23 21:47:57', '2025-12-23 21:47:57'),
('e818bfa69e6cc68b8f2b1d5bd2001b15b594b003f17fc25348b9fa7e39d479be5a5828cde616ede5', 121, 1, 'adminToken', '[]', 0, '2025-04-09 17:31:14', '2025-04-09 17:31:14', '2026-04-09 17:31:14'),
('e892f5d6d18920aef5dee0dc7e4291f003cc334a4e8ef2c23e030ecb5f796eeccce278cbb1239d49', 140, 1, 'adminToken', '[]', 0, '2025-04-22 05:51:14', '2025-04-22 05:51:14', '2026-04-22 05:51:14'),
('ea9c44fcf96c7feddeee07f71628e9c73fbc5f9b78844a709936b835d85095a4c1214e4127539a4d', 121, 1, 'adminToken', '[]', 0, '2024-12-09 18:57:03', '2024-12-09 18:57:03', '2025-12-09 18:57:03'),
('eaf284034568d1c5a13f6dc72433534b7c04a47a9b28992dd7fa498424153e4a7ef0f741fe13ac1a', 123, 1, 'adminToken', '[]', 0, '2025-01-22 16:27:09', '2025-01-22 16:27:09', '2026-01-22 16:27:09'),
('edfe33208faca66c1b47a18cefb2556c7193c1af5b67d5bd3523ded711b3598304beb3490fc41efa', 5, 1, 'adminToken', '[]', 0, '2024-09-06 23:35:05', '2024-09-06 23:35:05', '2025-09-06 23:35:05'),
('ee5dc273a732eb91b34cd396bc68283d73b61f35a50381dc7f0804cff934e2d79e2373619ec1bf38', 121, 1, 'adminToken', '[]', 0, '2024-12-28 15:51:25', '2024-12-28 15:51:25', '2025-12-28 15:51:25'),
('ee7735f23e4f336cf0f36d52348a0d99477416ef0a8cf0e040a96c3cee813dc03949979564aa1f6c', 6, 1, 'adminToken', '[]', 0, '2024-09-11 18:29:02', '2024-09-11 18:29:02', '2025-09-11 18:29:02'),
('ef98d43e23cb9898663fac93ca7ec69a96e73de515a2a063d78373866e368f823ed3714dc82edc1c', 121, 1, 'adminToken', '[]', 0, '2024-12-15 01:30:30', '2024-12-15 01:30:30', '2025-12-15 01:30:30'),
('efdd5ec52af6f322fc434e08b2e8cb8f6d39f13db9e1786411f3c8dbb71257d6733db9b0661c3ada', 121, 1, 'adminToken', '[]', 0, '2025-04-08 14:30:12', '2025-04-08 14:30:12', '2026-04-08 14:30:12'),
('f00802fe3bad9565414f46b522f0252a008d2b1b319abde68c99790660e78c51294c8e0f9514b86c', 5, 1, 'adminToken', '[]', 0, '2024-09-06 22:31:48', '2024-09-06 22:31:48', '2025-09-06 22:31:48'),
('f0aada944492810ec9eb8a0e005a7e96b62d27f00450d1b2f3f717005b5ad0b4d54f437faa70febd', 5, 1, 'adminToken', '[]', 0, '2024-10-16 20:33:51', '2024-10-16 20:33:51', '2025-10-16 20:33:51'),
('f13f4444e3ee9b212b000d35380524f91c2e25c3bf9b14a47606ed49f0583c8acea60976b1cfe92a', 5, 1, 'adminToken', '[]', 0, '2024-09-05 19:15:16', '2024-09-05 19:15:16', '2025-09-05 19:15:16'),
('f1469a1dfb7c5f86453376fdd5754c7eeeb8816367a3a6db5f7b3a2c1e5176b98c728ff5b6497188', 121, 1, 'adminToken', '[]', 0, '2025-03-08 03:09:27', '2025-03-08 03:09:27', '2026-03-08 03:09:27'),
('f190de31bbfc576743e17fc335f2a9c557a3e711dc20ef10cd47e64826d472700115f14d59bb8b6f', 121, 1, 'adminToken', '[]', 0, '2024-12-15 12:54:42', '2024-12-15 12:54:42', '2025-12-15 12:54:42'),
('f22660603b4cc0f8d737a26e42b4a20b23a6d6fa58948dac14f729911803697b22ad36c430031ed4', 121, 1, 'adminToken', '[]', 0, '2025-02-01 14:51:40', '2025-02-01 14:51:40', '2026-02-01 14:51:40'),
('f2bc233591c8e8c100b656069802ce033ada98139fe7ae93d7900ad3462916f671814963453da0fa', 121, 1, 'adminToken', '[]', 0, '2024-12-23 04:25:19', '2024-12-23 04:25:19', '2025-12-23 04:25:19'),
('f4eef60a50a21090d9a7ce512f7ca295b96dea60583ed3bda364db91e85607d09f7ed7031e5eb27f', 1, 1, 'adminToken', '[]', 0, '2024-09-07 19:05:24', '2024-09-07 19:05:24', '2025-09-07 19:05:24'),
('f6bfd420448e40d974020bb77679e0c7fb4e4a255d43939ac31e6145ee43c8eb3e62d12cebc88f81', 5, 1, 'adminToken', '[]', 0, '2024-11-15 17:00:18', '2024-11-15 17:00:18', '2025-11-15 17:00:18'),
('f6c829c181ef5bdc426fe9c194cd88c3b7677cc2f4fdc5dca44893fd608f9f69207759f4f1959ade', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:03:21', '2025-04-09 18:03:21', '2026-04-09 18:03:21'),
('f736fb10f687eb8cc12726950aa095c42bff58c8074c23928ee136e2aa303c1a819a47746ec36691', 121, 1, 'adminToken', '[]', 0, '2024-12-18 15:20:10', '2024-12-18 15:20:10', '2025-12-18 15:20:10'),
('f949f7f3140a5ada1463ef6f4f9050a5b4c81b0f436b409a6c0288fab73c9b6b47c1dcd28c4c2981', 5, 1, 'adminToken', '[]', 0, '2024-11-02 18:52:46', '2024-11-02 18:52:46', '2025-11-02 18:52:46'),
('f9c820b81ec8ad081cd5fe9013ce874ce51b171426f613b2898d319683762eb32469b458dfde7a5c', 101, 1, 'adminToken', '[]', 0, '2024-08-31 00:21:55', '2024-08-31 00:21:55', '2025-08-31 00:21:55'),
('fa63ef0d10354948b9d040a72615e9f27b817ce15799e54f2cb4e889cc309b148c5b42b1dcdb72e3', 121, 1, 'adminToken', '[]', 0, '2024-12-21 21:14:12', '2024-12-21 21:14:12', '2025-12-21 21:14:12'),
('fb62cb621728c06aa4aace81f936a0aec8b97556d16e7ea17b6723804b12d3184796006f1ff9fa8b', 2, 1, 'adminToken', '[]', 0, '2024-09-11 18:43:24', '2024-09-11 18:43:24', '2025-09-11 18:43:24'),
('fb894fb399371ece22a9154fb054fbf58f404383db01edd8ce206a4c499d59f704e119fdaffc19ac', 124, 1, 'adminToken', '[]', 0, '2025-01-15 17:34:05', '2025-01-15 17:34:05', '2026-01-15 17:34:05'),
('fc5b6e893381dde5dacdcd3755115c42a5a2fc02c1a27359da6b55c16126a0d507b26fe800f9436b', 5, 1, 'adminToken', '[]', 0, '2024-09-05 18:09:47', '2024-09-05 18:09:47', '2025-09-05 18:09:47'),
('fd6406970db8b333c5038007890b8648a72860adde28393f3e41e20b05fa1b79b38763d06e7aa0fd', 121, 1, 'adminToken', '[]', 0, '2025-04-09 18:03:34', '2025-04-09 18:03:34', '2026-04-09 18:03:34'),
('fdea6f8d4acffce1db2b06e8d1cafa2f8ed06ff0c2a1b390ea684de8c76fb1182c298186ad8f7fde', 124, 1, 'adminToken', '[]', 0, '2024-12-21 20:45:36', '2024-12-21 20:45:36', '2025-12-21 20:45:36'),
('feb3d2055b1ee998d285fd19a37d9fb51bf9fbb958313c29a12836a3dcec927bca6972dc960a1b35', 124, 1, 'adminToken', '[]', 0, '2024-12-18 14:23:50', '2024-12-18 14:23:50', '2025-12-18 14:23:50'),
('fed9fb4e0969c068ef40f96a4bedaa19b4a85c1a93a9aaaae7b55e2ed7e1d308bfa7babbe5a012ae', 5, 1, 'adminToken', '[]', 0, '2024-09-07 17:37:13', '2024-09-07 17:37:13', '2025-09-07 17:37:13');

-- --------------------------------------------------------

--
-- Table structure for table `oauth_auth_codes`
--

CREATE TABLE `oauth_auth_codes` (
  `id` varchar(100) NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `client_id` bigint(20) UNSIGNED NOT NULL,
  `scopes` text DEFAULT NULL,
  `revoked` tinyint(1) NOT NULL,
  `expires_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `oauth_clients`
--

CREATE TABLE `oauth_clients` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `name` varchar(255) NOT NULL,
  `secret` varchar(100) DEFAULT NULL,
  `provider` varchar(255) DEFAULT NULL,
  `redirect` text NOT NULL,
  `personal_access_client` tinyint(1) NOT NULL,
  `password_client` tinyint(1) NOT NULL,
  `revoked` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `oauth_clients`
--

INSERT INTO `oauth_clients` (`id`, `user_id`, `name`, `secret`, `provider`, `redirect`, `personal_access_client`, `password_client`, `revoked`, `created_at`, `updated_at`) VALUES
(1, NULL, 'Laravel Personal Access Client', 'pXnxAxPSKhx4ovCCoO44x3oKqy0opH0N7mhLApV4', NULL, 'http://localhost', 1, 0, 0, '2022-07-27 12:47:21', '2022-07-27 12:47:21'),
(2, NULL, 'Laravel Password Grant Client', 'yuCn4ks9guHGCG2ZBOBa5Y7jPloMveS07BV9JKpN', 'users', 'http://localhost', 0, 1, 0, '2022-07-27 12:47:21', '2022-07-27 12:47:21');

-- --------------------------------------------------------

--
-- Table structure for table `oauth_personal_access_clients`
--

CREATE TABLE `oauth_personal_access_clients` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `client_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `oauth_personal_access_clients`
--

INSERT INTO `oauth_personal_access_clients` (`id`, `client_id`, `created_at`, `updated_at`) VALUES
(1, 1, '2022-07-27 12:47:21', '2022-07-27 12:47:21');

-- --------------------------------------------------------

--
-- Table structure for table `oauth_refresh_tokens`
--

CREATE TABLE `oauth_refresh_tokens` (
  `id` varchar(100) NOT NULL,
  `access_token_id` varchar(100) NOT NULL,
  `revoked` tinyint(1) NOT NULL,
  `expires_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `supplier_id` bigint(20) DEFAULT NULL,
  `parent_id` bigint(20) DEFAULT NULL,
  `stock_id` bigint(20) UNSIGNED DEFAULT NULL,
  `owner_id` bigint(20) UNSIGNED DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `session_id` bigint(20) DEFAULT NULL,
  `owner_role` varchar(10) NOT NULL DEFAULT 'admin',
  `order_amount` double NOT NULL DEFAULT 0,
  `total_tax` double NOT NULL,
  `collected_cash` double DEFAULT NULL,
  `extra_discount` double DEFAULT NULL,
  `coupon_code` varchar(255) DEFAULT NULL,
  `coupon_discount_amount` double NOT NULL DEFAULT 0,
  `coupon_discount_title` varchar(255) DEFAULT NULL,
  `payment_id` bigint(20) UNSIGNED DEFAULT NULL,
  `transaction_reference` varchar(255) DEFAULT '0',
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `type` varchar(222) DEFAULT '4',
  `cash` int(11) NOT NULL DEFAULT 1,
  `notification` int(11) NOT NULL DEFAULT 1,
  `active` int(11) NOT NULL DEFAULT 1,
  `img` mediumtext DEFAULT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp(),
  `qrcode` mediumtext DEFAULT NULL,
  `discoun_on_products` double NOT NULL DEFAULT 0,
  `order_type` varchar(255) NOT NULL DEFAULT 'product',
  `note` text DEFAULT NULL,
  `journal_entry_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order_details`
--

CREATE TABLE `order_details` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) DEFAULT NULL,
  `order_id` bigint(20) DEFAULT NULL,
  `price` double NOT NULL DEFAULT 0,
  `product_details` text DEFAULT NULL,
  `product_code` varchar(6555) DEFAULT NULL,
  `discount_on_product` double DEFAULT NULL,
  `discount_type` varchar(20) NOT NULL DEFAULT 'amount',
  `quantity` int(11) NOT NULL DEFAULT 1,
  `tax_amount` double NOT NULL DEFAULT 1,
  `unit` int(11) NOT NULL DEFAULT 1,
  `purchase_price` double NOT NULL DEFAULT 0,
  `quantity_returned` double NOT NULL DEFAULT 0,
  `extra_discount_on_product` double NOT NULL DEFAULT 0,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order_detail_notifications`
--

CREATE TABLE `order_detail_notifications` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) DEFAULT NULL,
  `order_id` bigint(20) DEFAULT NULL,
  `price` double NOT NULL DEFAULT 0,
  `product_details` text DEFAULT NULL,
  `discount_on_product` double DEFAULT NULL,
  `discount_type` varchar(20) NOT NULL DEFAULT 'amount',
  `quantity` int(11) NOT NULL DEFAULT 1,
  `tax_amount` double NOT NULL DEFAULT 1,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order_notifications`
--

CREATE TABLE `order_notifications` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `stock_id` bigint(20) UNSIGNED DEFAULT NULL,
  `owner_id` bigint(20) UNSIGNED DEFAULT NULL,
  `owner_role` varchar(10) NOT NULL DEFAULT 'admin',
  `order_amount` double NOT NULL DEFAULT 0,
  `total_tax` double NOT NULL,
  `collected_cash` double DEFAULT NULL,
  `extra_discount` double DEFAULT NULL,
  `coupon_code` varchar(255) DEFAULT NULL,
  `coupon_discount_amount` double NOT NULL DEFAULT 0,
  `coupon_discount_title` varchar(255) DEFAULT NULL,
  `payment_id` bigint(20) UNSIGNED DEFAULT NULL,
  `transaction_reference` varchar(255) DEFAULT NULL,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `type` tinyint(1) NOT NULL DEFAULT 4,
  `active` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payment_vouchers`
--

CREATE TABLE `payment_vouchers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `voucher_number` varchar(50) NOT NULL,
  `date` date NOT NULL,
  `type` enum('payment','receipt') NOT NULL,
  `payee_name` varchar(255) NOT NULL,
  `branch_id` bigint(20) UNSIGNED DEFAULT NULL,
  `debit_account_id` bigint(20) UNSIGNED NOT NULL,
  `credit_account_id` bigint(20) UNSIGNED NOT NULL,
  `amount` decimal(15,2) NOT NULL,
  `currency` char(3) DEFAULT 'SAR',
  `payment_method` enum('cash','bank_transfer','cheque','other') DEFAULT 'cash',
  `cheque_number` varchar(100) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `attachment` varchar(255) DEFAULT NULL,
  `created_by` bigint(20) UNSIGNED NOT NULL,
  `journal_entry_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `pos_sessions`
--

CREATE TABLE `pos_sessions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `branch_id` bigint(20) UNSIGNED DEFAULT NULL,
  `start_time` datetime NOT NULL,
  `end_time` datetime DEFAULT NULL,
  `total_cash` decimal(12,2) DEFAULT 0.00,
  `total_card` decimal(12,2) DEFAULT 0.00,
  `total_discount` decimal(12,2) DEFAULT 0.00,
  `total_orders` int(11) DEFAULT 0,
  `total_returns` int(11) NOT NULL DEFAULT 0,
  `total_amount_returns` double NOT NULL DEFAULT 0,
  `status` enum('open','closed') DEFAULT 'open',
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `production_orders`
--

CREATE TABLE `production_orders` (
  `id` bigint(20) UNSIGNED NOT NULL COMMENT 'المفتاح الأساسي',
  `product_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يربط بالمنتج (بدون FK)',
  `bom_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يربط بـBOM (بدون FK)',
  `routing_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يربط بالمسار (بدون FK)',
  `branch_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يربط بالفرع (بدون FK)',
  `issued_by` bigint(20) UNSIGNED NOT NULL COMMENT 'المستخدم الصادر للأمر (بدون FK)',
  `quantity` decimal(10,2) NOT NULL COMMENT 'الكمية المراد تصنيعها',
  `unit` tinyint(1) NOT NULL DEFAULT 0 COMMENT '1=صغرى،0=كبرى',
  `cost_price` double NOT NULL DEFAULT 0,
  `produced_quantity` double NOT NULL DEFAULT 0,
  `start_date` date DEFAULT NULL COMMENT 'تاريخ البداية المخطط',
  `end_date` date DEFAULT NULL COMMENT 'تاريخ الانتهاء المخطط',
  `status` enum('draft','planned','in_progress','completed','cancelled') NOT NULL DEFAULT 'draft' COMMENT 'حالة الأمر',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `production_order_batches`
--

CREATE TABLE `production_order_batches` (
  `id` bigint(20) UNSIGNED NOT NULL COMMENT 'المفتاح الأساسي لكل ربط',
  `production_order_id` bigint(20) UNSIGNED NOT NULL COMMENT 'معرف أمر الإنتاج (بدون قيد FK)',
  `stock_batch_id` bigint(20) UNSIGNED NOT NULL COMMENT 'معرف دفعة المخزون (بدون قيد FK)',
  `reserved_quantity` decimal(10,2) NOT NULL,
  `actual_quantity` decimal(10,2) NOT NULL DEFAULT 0.00,
  `waste_quantity` decimal(10,2) NOT NULL DEFAULT 0.00,
  `created_at` timestamp NULL DEFAULT NULL COMMENT 'تاريخ الإنشاء',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT 'تاريخ آخر تعديل'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='جدول الربط بين أوامر الإنتاج ودفعات المخزون بدون قيود المفتاح الأجنبي';

-- --------------------------------------------------------

--
-- Table structure for table `production_order_executions`
--

CREATE TABLE `production_order_executions` (
  `id` bigint(20) NOT NULL,
  `production_order_id` bigint(20) NOT NULL,
  `branch_id` bigint(20) NOT NULL,
  `start_time` datetime NOT NULL,
  `end_time` datetime NOT NULL,
  `actual_hours` decimal(6,2) NOT NULL,
  `total_reserved_quantity` decimal(10,2) NOT NULL,
  `total_consumed_quantity` decimal(10,2) NOT NULL,
  `waste_quantity` decimal(10,2) NOT NULL,
  `produced_quantity` decimal(10,2) NOT NULL,
  `unit_cost` decimal(15,4) NOT NULL,
  `total_cost` decimal(15,4) NOT NULL,
  `additional_costs` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`additional_costs`)),
  `additional_cost_total` decimal(15,4) DEFAULT 0.0000,
  `executed_by` bigint(20) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `production_order_execution_items`
--

CREATE TABLE `production_order_execution_items` (
  `id` bigint(20) NOT NULL,
  `execution_id` bigint(20) NOT NULL,
  `product_id` bigint(20) NOT NULL,
  `reserved_quantity` decimal(10,2) NOT NULL,
  `consumed_quantity` decimal(10,2) NOT NULL,
  `unit_cost` decimal(15,4) NOT NULL,
  `reserved_cost` decimal(15,4) NOT NULL,
  `consumed_cost` decimal(15,4) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `production_order_logs`
--

CREATE TABLE `production_order_logs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `production_order_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `action` varchar(20) NOT NULL COMMENT 'create|update|status_change',
  `old_values` text DEFAULT NULL COMMENT 'JSON من القيم السابقة',
  `new_values` text DEFAULT NULL COMMENT 'JSON من القيم الجديدة',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `name_en` varchar(255) NOT NULL DEFAULT 'Default product',
  `product_code` varchar(255) NOT NULL,
  `unit_type` int(10) UNSIGNED DEFAULT NULL,
  `unit_value` double(8,2) DEFAULT NULL,
  `brand` varchar(255) DEFAULT NULL,
  `category_id` varchar(255) DEFAULT NULL,
  `purchase_price` double DEFAULT NULL,
  `purchase_price1` double NOT NULL,
  `purchase_price2` double NOT NULL,
  `purchase_price3` double NOT NULL,
  `purchase_price4` double NOT NULL,
  `selling_price` double DEFAULT NULL,
  `selling_price1` double NOT NULL,
  `selling_price2` double NOT NULL,
  `selling_price3` double NOT NULL,
  `selling_price4` double NOT NULL,
  `discount_type` varchar(255) DEFAULT NULL,
  `discount` double(8,2) DEFAULT NULL,
  `limit_stock` int(11) NOT NULL DEFAULT 10,
  `limit_web` int(11) NOT NULL DEFAULT 2,
  `tax` double(8,2) DEFAULT NULL,
  `main_quantity` mediumtext NOT NULL DEFAULT '0',
  `quantity` varchar(20) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `order_count` int(10) UNSIGNED DEFAULT NULL,
  `refund_count` int(11) NOT NULL DEFAULT 0,
  `purchase_count` int(11) NOT NULL DEFAULT 0,
  `repurchase_count` int(11) NOT NULL DEFAULT 0,
  `supplier_id` int(10) UNSIGNED DEFAULT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL,
  `expiry_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `company_id` bigint(20) DEFAULT 1,
  `type` varchar(255) NOT NULL,
  `tax_id` int(11) DEFAULT NULL,
  `branch_3` varchar(255) NOT NULL DEFAULT '0',
  `branch_4` varchar(255) NOT NULL DEFAULT '0',
  `branch_5` varchar(255) NOT NULL DEFAULT '0',
  `branch_6` varchar(255) NOT NULL DEFAULT '0',
  `branch_7` varchar(255) NOT NULL DEFAULT '0',
  `product_type` varchar(255) NOT NULL DEFAULT 'product',
  `branch_8` varchar(255) NOT NULL DEFAULT '0',
  `branch_9` varchar(255) NOT NULL DEFAULT '0',
  `branch_10` varchar(255) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product_expires`
--

CREATE TABLE `product_expires` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) NOT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `quantity` varchar(20) NOT NULL,
  `unit` int(11) NOT NULL DEFAULT 0,
  `note` mediumtext DEFAULT NULL,
  `price` mediumtext NOT NULL DEFAULT '0',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product_logs`
--

CREATE TABLE `product_logs` (
  `id` bigint(20) NOT NULL,
  `product_id` bigint(20) NOT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `seller_id` bigint(20) NOT NULL DEFAULT 100,
  `quantity` mediumtext NOT NULL,
  `type` varchar(2555) NOT NULL DEFAULT '1',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `projects`
--

CREATE TABLE `projects` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) NOT NULL,
  `code` varchar(64) NOT NULL,
  `description` text DEFAULT NULL,
  `status_id` bigint(20) UNSIGNED DEFAULT NULL,
  `owner_id` bigint(20) UNSIGNED NOT NULL,
  `lead_id` bigint(20) UNSIGNED DEFAULT NULL,
  `priority` enum('low','medium','high','urgent') DEFAULT 'medium',
  `start_date` date DEFAULT NULL,
  `due_date` date DEFAULT NULL,
  `active` tinyint(1) NOT NULL DEFAULT 1,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `projects`
--

INSERT INTO `projects` (`id`, `name`, `code`, `description`, `status_id`, `owner_id`, `lead_id`, `priority`, `start_date`, `due_date`, `active`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 'مدير', '09961', 'dfsdfsd', 1, 100, NULL, 'medium', NULL, NULL, 1, NULL, '2025-09-07 21:38:26', '2025-09-07 21:45:12'),
(2, 'ضريبة صفريه', '13123', 'sdsfasddsa', 1, 100, NULL, 'medium', '2025-09-01', '2025-10-10', 1, NULL, '2025-09-09 10:24:28', '2025-09-09 10:24:28');

-- --------------------------------------------------------

--
-- Table structure for table `project_members`
--

CREATE TABLE `project_members` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `project_id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `role` enum('owner','leader','member','viewer') NOT NULL DEFAULT 'member',
  `added_by` bigint(20) UNSIGNED DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `project_members`
--

INSERT INTO `project_members` (`id`, `project_id`, `admin_id`, `role`, `added_by`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 1, 159, 'member', 100, NULL, '2025-09-07 21:47:25', '2025-09-07 21:47:25'),
(2, 1, 160, 'member', 100, NULL, '2025-09-07 21:47:32', '2025-09-07 21:47:32'),
(3, 1, 100, 'member', 100, '2025-09-07 21:47:52', '2025-09-07 21:47:36', '2025-09-07 21:47:52'),
(4, 1, 162, 'leader', 100, NULL, '2025-09-07 21:47:41', '2025-09-07 21:47:41'),
(5, 1, 161, 'member', 100, NULL, '2025-09-07 21:48:00', '2025-09-07 21:48:00'),
(7, 2, 160, 'member', 100, NULL, '2025-09-09 10:24:41', '2025-09-09 10:24:41'),
(8, 2, 159, 'member', 100, NULL, '2025-09-09 10:24:46', '2025-09-09 10:24:46');

-- --------------------------------------------------------

--
-- Table structure for table `quotations`
--

CREATE TABLE `quotations` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `supplier_id` bigint(20) DEFAULT NULL,
  `parent_id` bigint(20) DEFAULT NULL,
  `stock_id` bigint(20) UNSIGNED DEFAULT NULL,
  `owner_id` bigint(20) UNSIGNED DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `session_id` bigint(20) DEFAULT NULL,
  `owner_role` varchar(10) NOT NULL DEFAULT 'admin',
  `order_amount` double NOT NULL DEFAULT 0,
  `total_tax` double NOT NULL,
  `collected_cash` double DEFAULT NULL,
  `extra_discount` double DEFAULT NULL,
  `coupon_code` varchar(255) DEFAULT NULL,
  `coupon_discount_amount` double NOT NULL DEFAULT 0,
  `coupon_discount_title` varchar(255) DEFAULT NULL,
  `payment_id` bigint(20) UNSIGNED DEFAULT NULL,
  `transaction_reference` varchar(255) DEFAULT '0',
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `type` varchar(222) DEFAULT '4',
  `cash` int(11) NOT NULL DEFAULT 1,
  `notification` int(11) NOT NULL DEFAULT 1,
  `active` int(11) NOT NULL DEFAULT 1,
  `img` mediumtext DEFAULT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp(),
  `qrcode` mediumtext DEFAULT NULL,
  `discoun_on_products` double NOT NULL DEFAULT 0,
  `status` int(11) NOT NULL DEFAULT 1,
  `quotation_type` varchar(255) NOT NULL DEFAULT 'product'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `quotation_details`
--

CREATE TABLE `quotation_details` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) DEFAULT NULL,
  `order_id` bigint(20) DEFAULT NULL,
  `price` double NOT NULL DEFAULT 0,
  `product_details` text DEFAULT NULL,
  `product_code` varchar(6555) DEFAULT NULL,
  `discount_on_product` double DEFAULT NULL,
  `discount_type` varchar(20) NOT NULL DEFAULT 'amount',
  `quantity` int(11) NOT NULL DEFAULT 1,
  `tax_amount` double NOT NULL DEFAULT 1,
  `unit` int(11) NOT NULL DEFAULT 1,
  `purchase_price` double NOT NULL DEFAULT 0,
  `quantity_returned` double NOT NULL DEFAULT 0,
  `extra_discount_on_product` double NOT NULL DEFAULT 0,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `regions`
--

CREATE TABLE `regions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `name_en` varchar(255) DEFAULT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `regions`
--

INSERT INTO `regions` (`id`, `local_id`, `name`, `name_en`, `insert_flag`, `created_at`, `update_flag`, `updated_at`) VALUES
(15, 0, 'الرياض', NULL, 1, '2024-12-07 10:34:58', 0, '2025-04-22 08:43:28'),
(16, 0, 'جدة', NULL, 1, '2024-12-07 10:35:03', 0, '2024-12-07 10:35:03'),
(17, 0, 'مكة المكرمة', NULL, 1, '2024-12-07 10:35:17', 0, '2024-12-07 10:35:17'),
(18, 0, 'المدينة المنورة', NULL, 1, '2024-12-07 10:35:27', 0, '2024-12-07 10:35:27'),
(19, 0, 'حفر الباطن', NULL, 1, '2024-12-07 10:35:39', 0, '2024-12-07 10:35:39'),
(21, 0, 'الدمام', NULL, 1, '2024-12-07 10:35:59', 0, '2024-12-07 10:35:59'),
(24, 0, 'الخبر', NULL, 1, '2025-04-22 08:44:18', 0, '2025-04-22 08:44:18'),
(25, 0, 'الكويت', NULL, 1, '2025-04-22 08:44:31', 0, '2025-04-22 08:44:31'),
(28, 0, 'الرياض', NULL, 1, '2025-08-17 01:43:38', 0, '2025-08-17 01:43:38');

-- --------------------------------------------------------

--
-- Table structure for table `reserve_products`
--

CREATE TABLE `reserve_products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `data` text NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `date` varchar(200) DEFAULT current_timestamp(),
  `type` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp(),
  `active` int(11) NOT NULL DEFAULT 1,
  `notification` int(11) NOT NULL DEFAULT 1,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `reserve_product_notifications`
--

CREATE TABLE `reserve_product_notifications` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `data` text NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED NOT NULL,
  `date` varchar(200) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `active` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `result_visitors`
--

CREATE TABLE `result_visitors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED NOT NULL,
  `note` mediumtext NOT NULL,
  `lat` mediumtext NOT NULL,
  `lang` mediumtext NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) NOT NULL,
  `name` varchar(2550) NOT NULL,
  `data` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`data`)),
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `data`, `created_at`, `updated_at`) VALUES
(1, 'مدير حسابات', '\"[\\\"dashboard.list\\\",\\\"admin.update\\\",\\\"admin.index\\\",\\\"admin.store\\\",\\\"admin.destroy\\\",\\\"role.index\\\",\\\"role.store\\\",\\\"role.update\\\",\\\"shift.index\\\",\\\"shift.store\\\",\\\"shift.update\\\",\\\"tax.index\\\",\\\"tax.store\\\",\\\"tax.update\\\",\\\"tax.active\\\",\\\"branch.index\\\",\\\"branch.store\\\",\\\"branch.update\\\",\\\"custom_fields.index\\\",\\\"custom_fields.store\\\",\\\"custom_fields.update\\\",\\\"custom_fields.active\\\",\\\"settings.update\\\",\\\"settings.index\\\",\\\"account.index\\\",\\\"account.store\\\",\\\"account.update\\\",\\\"account.destroy\\\",\\\"start.store\\\",\\\"expense100.store\\\",\\\"expense200.store\\\",\\\"transfer.store\\\",\\\"finance.reports.journal_entries\\\",\\\"finance.reports.journal_entries.show\\\",\\\"finance.reports.journal_entries.update\\\",\\\"finance.reports.journal_entries.reverse\\\",\\\"finance.reports.journal_entries.soft_delete\\\",\\\"expense2.store\\\",\\\"asset.ehlak\\\",\\\"asset.addsayan\\\",\\\"asset.showsayana\\\",\\\"asset.koyod\\\",\\\"asset.details\\\",\\\"assets.index\\\",\\\"finance.reports.payment_vouchers\\\",\\\"finance.reports.receipt_vouchers\\\",\\\"finance.reports.journal_entries\\\",\\\"mizania.report\\\",\\\"tadfk.report\\\",\\\"mizan.report\\\",\\\"kamtdakhl.report\\\",\\\"yearscustomer.report\\\",\\\"yearssupplier.report\\\",\\\"finance.reports.account_statement\\\",\\\"costcenter.index\\\",\\\"costcenter.store\\\",\\\"costcenter.update\\\",\\\"costcenter.active\\\",\\\"costcenter.destroy\\\",\\\"costcenter.transactions.index\\\",\\\"costcenter.totals.index\\\",\\\"region.index\\\",\\\"region.store\\\",\\\"region.update\\\",\\\"region.destroy\\\",\\\"customer.index\\\",\\\"customer.store\\\",\\\"customer.update\\\",\\\"customer.active\\\",\\\"category.index\\\",\\\"category.store\\\",\\\"category.update\\\",\\\"category.active\\\",\\\"guarantors.index\\\",\\\"guarantors.store\\\",\\\"guarantors.update\\\",\\\"guarantors.destroy\\\",\\\"status.index\\\",\\\"status.store\\\",\\\"status.update\\\",\\\"status.active\\\",\\\"status.destroy\\\",\\\"source.index\\\",\\\"source.store\\\",\\\"source.update\\\",\\\"source.active\\\",\\\"source.destroy\\\",\\\"leads.index\\\",\\\"leads.show\\\",\\\"leads.store\\\",\\\"leads.update\\\",\\\"leads.active\\\",\\\"leads.destroy\\\",\\\"call_outcomes.index\\\",\\\"call_outcomes.show\\\",\\\"call_outcomes.store\\\",\\\"call_outcomes.update\\\",\\\"call_outcomes.active\\\",\\\"call_outcomes.destroy\\\",\\\"call_logs.index\\\",\\\"call_logs.show\\\",\\\"call_logs.store\\\",\\\"call_logs.update\\\",\\\"call_logs.active\\\",\\\"call_logs.destroy\\\",\\\"lead_notes.index\\\",\\\"lead_notes.show\\\",\\\"lead_notes.store\\\",\\\"lead_notes.update\\\",\\\"lead_notes.active\\\",\\\"lead_notes.destroy\\\",\\\"project.index\\\",\\\"project.store\\\",\\\"project.update\\\",\\\"project.destroy\\\",\\\"project.active\\\",\\\"project.members.store\\\",\\\"project.members.destroy\\\",\\\"task.index\\\",\\\"task.store\\\",\\\"task.update\\\",\\\"task.destroy\\\",\\\"task.active\\\",\\\"task.approval.request\\\",\\\"task.approve\\\",\\\"task.reject\\\",\\\"task.inbox\\\",\\\"task.assignees.store\\\",\\\"task.assignees.destroy\\\",\\\"task.followup\\\",\\\"task.followups.store\\\",\\\"task.followups.done\\\",\\\"task.followups.destroy\\\",\\\"task.comment\\\",\\\"task.comments.store\\\",\\\"task.comments.destroy\\\",\\\"notification.index\\\",\\\"notification.update\\\",\\\"notification.destroy\\\",\\\"work.reports.overdue\\\",\\\"work.reports.productivity\\\",\\\"work.reports.team_load\\\",\\\"sales.index\\\",\\\"sales.store\\\",\\\"sales.destroy\\\",\\\"sales.draft.index\\\",\\\"sales.draft.store\\\",\\\"sales.draft.destroy\\\",\\\"pos7.index\\\",\\\"quotation.create\\\",\\\"quotation.store\\\",\\\"quotation.update\\\",\\\"quotation.index\\\",\\\"quotation.destroy\\\",\\\"installment.index\\\",\\\"installment.store\\\",\\\"installment.show\\\",\\\"purchase.store\\\",\\\"order12.index\\\",\\\"pos24.store\\\",\\\"order24.index\\\",\\\"supplier.store\\\",\\\"supplier.index\\\",\\\"supplier.show\\\",\\\"supplier.update\\\",\\\"supplier.active\\\",\\\"unit.update\\\",\\\"unit.index\\\",\\\"unit.store\\\",\\\"unit.destroy\\\",\\\"product.update\\\",\\\"product.index\\\",\\\"product.store\\\",\\\"product.destroy\\\",\\\"product.barcode\\\",\\\"product.show\\\",\\\"product.expire\\\",\\\"product.expire.show\\\",\\\"product.excel.import\\\",\\\"product.excel.export\\\",\\\"transfer.view.all\\\",\\\"transfer.view\\\",\\\"transfer.create\\\",\\\"transfer.edit\\\",\\\"transfer.delete\\\",\\\"transfer.accept\\\",\\\"InventoryAdjustment.view.all\\\",\\\"InventoryAdjustment.view\\\",\\\"InventoryAdjustment.create\\\",\\\"InventoryAdjustment.edit\\\",\\\"InventoryAdjustment.destroy\\\",\\\"InventoryAdjustment.show\\\",\\\"InventoryAdjustment.end\\\",\\\"InventoryAdjustment.accept\\\",\\\"staff.update\\\",\\\"staff.index\\\",\\\"staff.store\\\",\\\"staff.destroy\\\",\\\"interview.store\\\",\\\"interview.index\\\",\\\"interview.update\\\",\\\"interview.destroy\\\",\\\"meeting.store\\\",\\\"meeting.update\\\",\\\"meeting.destroy\\\",\\\"meeting.index\\\",\\\"attendace.index\\\",\\\"attendace.index\\\",\\\"staff.rate\\\",\\\"develop.store\\\",\\\"develop.update\\\",\\\"develop.destroy\\\",\\\"develop.approve\\\",\\\"course.store\\\",\\\"salary.index\\\",\\\"salary.store\\\",\\\"order4.index\\\",\\\"order7.index\\\",\\\"report.productsales\\\",\\\"report.productpurchases\\\",\\\"report.pointsales\\\",\\\"report.gain\\\",\\\"report.tax\\\",\\\"report.box\\\",\\\"report.boxseller\\\",\\\"report.mainstock\\\",\\\"report.allstock\\\",\\\"report.expire\\\",\\\"report.stocklimit\\\",\\\"report.unlike\\\",\\\"scope.view.all\\\",\\\"scope.view.branch\\\",\\\"scope.view.department\\\",\\\"scope.view.manager_tree\\\",\\\"scope.view.team\\\",\\\"scope.view.self\\\"]\"', '2025-02-21 06:16:50', '2025-09-14 12:09:25'),
(2, 'مدير', '\"[\\\"dashboard.list\\\",\\\"admin.update\\\",\\\"admin.index\\\",\\\"admin.store\\\",\\\"admin.destroy\\\",\\\"role.index\\\",\\\"role.store\\\",\\\"role.update\\\",\\\"shift.index\\\",\\\"shift.store\\\",\\\"shift.update\\\",\\\"tax.index\\\",\\\"tax.store\\\",\\\"tax.update\\\",\\\"tax.active\\\",\\\"branch.index\\\",\\\"branch.store\\\",\\\"branch.update\\\",\\\"custom_fields.index\\\",\\\"custom_fields.store\\\",\\\"custom_fields.update\\\",\\\"custom_fields.active\\\",\\\"settings.update\\\",\\\"settings.index\\\",\\\"account.index\\\",\\\"account.store\\\",\\\"account.update\\\",\\\"account.destroy\\\",\\\"start.store\\\",\\\"expense100.store\\\",\\\"expense200.store\\\",\\\"transfer.store\\\",\\\"finance.reports.journal_entries\\\",\\\"finance.reports.journal_entries.show\\\",\\\"finance.reports.journal_entries.update\\\",\\\"finance.reports.journal_entries.reverse\\\",\\\"finance.reports.journal_entries.soft_delete\\\",\\\"expense2.store\\\",\\\"asset.ehlak\\\",\\\"asset.addsayan\\\",\\\"asset.showsayana\\\",\\\"asset.koyod\\\",\\\"asset.details\\\",\\\"assets.index\\\",\\\"finance.reports.payment_vouchers\\\",\\\"finance.reports.receipt_vouchers\\\",\\\"finance.reports.journal_entries\\\",\\\"mizania.report\\\",\\\"tadfk.report\\\",\\\"mizan.report\\\",\\\"kamtdakhl.report\\\",\\\"yearscustomer.report\\\",\\\"yearssupplier.report\\\",\\\"finance.reports.account_statement\\\",\\\"costcenter.index\\\",\\\"costcenter.store\\\",\\\"costcenter.update\\\",\\\"costcenter.active\\\",\\\"costcenter.destroy\\\",\\\"costcenter.transactions.index\\\",\\\"costcenter.totals.index\\\",\\\"region.index\\\",\\\"region.store\\\",\\\"region.update\\\",\\\"region.destroy\\\",\\\"customer.index\\\",\\\"customer.store\\\",\\\"customer.update\\\",\\\"customer.active\\\",\\\"category.index\\\",\\\"category.store\\\",\\\"category.update\\\",\\\"category.active\\\",\\\"guarantors.index\\\",\\\"guarantors.store\\\",\\\"guarantors.update\\\",\\\"guarantors.destroy\\\",\\\"status.index\\\",\\\"status.store\\\",\\\"status.update\\\",\\\"status.active\\\",\\\"status.destroy\\\",\\\"source.index\\\",\\\"source.store\\\",\\\"source.update\\\",\\\"source.active\\\",\\\"source.destroy\\\",\\\"leads.index\\\",\\\"leads.show\\\",\\\"leads.store\\\",\\\"leads.update\\\",\\\"leads.active\\\",\\\"leads.destroy\\\",\\\"call_outcomes.index\\\",\\\"call_outcomes.show\\\",\\\"call_outcomes.store\\\",\\\"call_outcomes.update\\\",\\\"call_outcomes.active\\\",\\\"call_outcomes.destroy\\\",\\\"call_logs.index\\\",\\\"call_logs.show\\\",\\\"call_logs.store\\\",\\\"call_logs.update\\\",\\\"call_logs.active\\\",\\\"call_logs.destroy\\\",\\\"lead_notes.index\\\",\\\"lead_notes.show\\\",\\\"lead_notes.store\\\",\\\"lead_notes.update\\\",\\\"lead_notes.active\\\",\\\"lead_notes.destroy\\\",\\\"project.index\\\",\\\"project.store\\\",\\\"project.update\\\",\\\"project.destroy\\\",\\\"project.active\\\",\\\"project.members.store\\\",\\\"project.members.destroy\\\",\\\"task.index\\\",\\\"task.store\\\",\\\"task.update\\\",\\\"task.destroy\\\",\\\"task.active\\\",\\\"task.approval.request\\\",\\\"task.approve\\\",\\\"task.reject\\\",\\\"task.inbox\\\",\\\"task.assignees.store\\\",\\\"task.assignees.destroy\\\",\\\"task.followup\\\",\\\"task.followups.store\\\",\\\"task.followups.done\\\",\\\"task.followups.destroy\\\",\\\"task.comment\\\",\\\"task.comments.store\\\",\\\"task.comments.destroy\\\",\\\"notification.index\\\",\\\"notification.update\\\",\\\"notification.destroy\\\",\\\"work.reports.overdue\\\",\\\"work.reports.productivity\\\",\\\"work.reports.team_load\\\",\\\"sales.index\\\",\\\"sales.store\\\",\\\"sales.destroy\\\",\\\"sales.draft.index\\\",\\\"sales.draft.store\\\",\\\"sales.draft.destroy\\\",\\\"pos7.index\\\",\\\"quotation.create\\\",\\\"quotation.store\\\",\\\"quotation.update\\\",\\\"quotation.index\\\",\\\"quotation.destroy\\\",\\\"installment.index\\\",\\\"installment.store\\\",\\\"installment.show\\\",\\\"purchase.store\\\",\\\"order12.index\\\",\\\"pos24.store\\\",\\\"order24.index\\\",\\\"supplier.store\\\",\\\"supplier.index\\\",\\\"supplier.show\\\",\\\"supplier.update\\\",\\\"supplier.active\\\",\\\"unit.update\\\",\\\"unit.index\\\",\\\"unit.store\\\",\\\"unit.destroy\\\",\\\"product.update\\\",\\\"product.index\\\",\\\"product.store\\\",\\\"product.destroy\\\",\\\"product.barcode\\\",\\\"product.show\\\",\\\"product.expire\\\",\\\"product.expire.show\\\",\\\"product.excel.import\\\",\\\"product.excel.export\\\",\\\"transfer.view.all\\\",\\\"transfer.view\\\",\\\"transfer.create\\\",\\\"transfer.edit\\\",\\\"transfer.delete\\\",\\\"transfer.accept\\\",\\\"InventoryAdjustment.view.all\\\",\\\"InventoryAdjustment.view\\\",\\\"InventoryAdjustment.create\\\",\\\"InventoryAdjustment.edit\\\",\\\"InventoryAdjustment.destroy\\\",\\\"InventoryAdjustment.show\\\",\\\"InventoryAdjustment.end\\\",\\\"InventoryAdjustment.accept\\\",\\\"staff.update\\\",\\\"staff.index\\\",\\\"staff.store\\\",\\\"staff.destroy\\\",\\\"interview.store\\\",\\\"interview.index\\\",\\\"interview.update\\\",\\\"interview.destroy\\\",\\\"meeting.store\\\",\\\"meeting.update\\\",\\\"meeting.destroy\\\",\\\"meeting.index\\\",\\\"attendace.index\\\",\\\"attendace.index\\\",\\\"staff.rate\\\",\\\"develop.store\\\",\\\"develop.update\\\",\\\"develop.destroy\\\",\\\"develop.approve\\\",\\\"course.store\\\",\\\"salary.index\\\",\\\"salary.store\\\",\\\"order4.index\\\",\\\"order7.index\\\",\\\"report.productsales\\\",\\\"report.productpurchases\\\",\\\"report.pointsales\\\",\\\"report.gain\\\",\\\"report.tax\\\",\\\"report.box\\\",\\\"report.boxseller\\\",\\\"report.mainstock\\\",\\\"report.allstock\\\",\\\"report.expire\\\",\\\"report.stocklimit\\\",\\\"report.unlike\\\",\\\"scope.view.all\\\",\\\"scope.view.branch\\\",\\\"scope.view.department\\\",\\\"scope.view.manager_tree\\\",\\\"scope.view.team\\\",\\\"scope.view.self\\\"]\"', '2025-02-21 07:46:25', '2025-09-12 14:29:01'),
(3, 'محاسب', '\"[\\\"dashboard.list\\\",\\\"account.index\\\",\\\"account.store\\\",\\\"account.update\\\",\\\"account.destroy\\\",\\\"start.store\\\",\\\"expense100.store\\\",\\\"expense200.store\\\",\\\"transfer.store\\\",\\\"finance.reports.journal_entries\\\",\\\"finance.reports.journal_entries.show\\\",\\\"finance.reports.journal_entries.update\\\",\\\"finance.reports.journal_entries.reverse\\\",\\\"expense2.store\\\",\\\"asset.ehlak\\\",\\\"asset.addsayan\\\",\\\"asset.showsayana\\\",\\\"asset.koyod\\\",\\\"asset.details\\\",\\\"assets.index\\\",\\\"finance.reports.payment_vouchers\\\",\\\"finance.reports.receipt_vouchers\\\",\\\"finance.reports.journal_entries\\\",\\\"mizania.report\\\",\\\"tadfk.report\\\",\\\"mizan.report\\\",\\\"kamtdakhl.report\\\",\\\"yearscustomer.report\\\",\\\"yearssupplier.report\\\",\\\"finance.reports.account_statement\\\",\\\"costcenter.index\\\",\\\"costcenter.store\\\",\\\"costcenter.update\\\",\\\"costcenter.active\\\",\\\"costcenter.destroy\\\",\\\"costcenter.transactions.index\\\",\\\"costcenter.totals.index\\\",\\\"region.index\\\",\\\"region.store\\\",\\\"region.update\\\",\\\"region.destroy\\\",\\\"customer.index\\\",\\\"customer.store\\\",\\\"customer.update\\\",\\\"customer.active\\\",\\\"category.index\\\",\\\"category.store\\\",\\\"category.update\\\",\\\"category.active\\\",\\\"guarantors.index\\\",\\\"guarantors.store\\\",\\\"guarantors.update\\\",\\\"guarantors.destroy\\\",\\\"branch.index\\\",\\\"branch.store\\\",\\\"branch.update\\\",\\\"settings.update\\\",\\\"settings.index\\\"]\"', '2025-02-22 00:57:31', '2025-08-30 18:23:47'),
(4, 'منسق', '\"[\\\"dashboard.list\\\",\\\"status.index\\\",\\\"status.store\\\",\\\"status.update\\\",\\\"status.active\\\",\\\"status.destroy\\\",\\\"source.index\\\",\\\"source.store\\\",\\\"source.update\\\",\\\"source.active\\\",\\\"source.destroy\\\",\\\"leads.index\\\",\\\"leads.show\\\",\\\"leads.store\\\",\\\"leads.update\\\",\\\"leads.active\\\",\\\"leads.destroy\\\",\\\"call_outcomes.index\\\",\\\"call_outcomes.show\\\",\\\"call_outcomes.store\\\",\\\"call_outcomes.update\\\",\\\"call_outcomes.active\\\",\\\"call_outcomes.destroy\\\",\\\"call_logs.index\\\",\\\"call_logs.show\\\",\\\"call_logs.store\\\",\\\"call_logs.update\\\",\\\"call_logs.active\\\",\\\"call_logs.destroy\\\",\\\"lead_notes.index\\\",\\\"lead_notes.show\\\",\\\"lead_notes.store\\\",\\\"lead_notes.update\\\",\\\"lead_notes.active\\\",\\\"lead_notes.destroy\\\"]\"', '2025-06-27 14:25:48', '2025-09-09 17:52:28');

-- --------------------------------------------------------

--
-- Table structure for table `routings`
--

CREATE TABLE `routings` (
  `id` bigint(20) UNSIGNED NOT NULL COMMENT 'المفتاح الأساسي لكل مسار تشغيل',
  `bom_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يرتبط بـ bills_of_materials.id (قائمة المواد)',
  `name` varchar(100) NOT NULL COMMENT 'اسم المسار (مثلاً: المسار القياسي للإنتاج)',
  `description` text DEFAULT NULL COMMENT 'وصف تفصيلي للمسار',
  `effective_date` date DEFAULT NULL COMMENT 'تاريخ بدء استخدام هذا المسار',
  `created_at` timestamp NULL DEFAULT NULL COMMENT 'تاريخ الإنشاء',
  `updated_at` timestamp NULL DEFAULT NULL COMMENT 'تاريخ آخر تعديل'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `routing_operations`
--

CREATE TABLE `routing_operations` (
  `id` bigint(20) UNSIGNED NOT NULL COMMENT 'المفتاح الأساسي لكل خطوة تشغيل',
  `routing_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يرتبط بالمسار من جدول routings',
  `work_center_id` bigint(20) UNSIGNED NOT NULL COMMENT 'يرتبط بمركز العمل من جدول work_centers',
  `sequence` int(10) UNSIGNED NOT NULL COMMENT 'ترتيب تنفيذ الخطوة ضمن المسار',
  `setup_time` decimal(8,2) NOT NULL DEFAULT 0.00 COMMENT 'زمن الإعداد قبل التشغيل (بالساعات)',
  `run_time` decimal(8,2) NOT NULL DEFAULT 0.00 COMMENT 'زمن التشغيل لكل وحدة أو دفعة (بالساعات)',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `salaries`
--

CREATE TABLE `salaries` (
  `id` bigint(20) NOT NULL,
  `seller_id` bigint(20) NOT NULL,
  `salary` varchar(20) NOT NULL DEFAULT '0',
  `commission` varchar(20) NOT NULL DEFAULT '0',
  `number_of_visitors` varchar(20) NOT NULL DEFAULT '0',
  `result_of_visitors` varchar(20) NOT NULL DEFAULT '0',
  `salary_of_visitors` varchar(20) NOT NULL DEFAULT '0',
  `transport_amount` varchar(20) NOT NULL DEFAULT '0',
  `score` varchar(20) NOT NULL DEFAULT '0',
  `month` mediumtext NOT NULL,
  `note` text NOT NULL DEFAULT 'لاتوجد ملاحظات',
  `notemanager` text NOT NULL DEFAULT 'لاتوجد ملاحظات',
  `number_of_days` int(11) NOT NULL DEFAULT 0,
  `discount` varchar(255) NOT NULL DEFAULT '0',
  `total` varchar(20) NOT NULL DEFAULT '0',
  `other` varchar(255) NOT NULL DEFAULT '0',
  `taxes` double NOT NULL DEFAULT 0,
  `insurance` double NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `scheduled_installments`
--

CREATE TABLE `scheduled_installments` (
  `id` bigint(20) NOT NULL,
  `contract_id` bigint(20) NOT NULL,
  `due_date` date NOT NULL,
  `amount` decimal(12,2) NOT NULL,
  `purchased_amount` decimal(10,0) NOT NULL DEFAULT 0,
  `status` enum('cancelled','unpaid','partial','paid','late','pending') DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `seller_categories`
--

CREATE TABLE `seller_categories` (
  `id` int(11) NOT NULL,
  `cat_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `seller_customers`
--

CREATE TABLE `seller_customers` (
  `id` int(11) NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `customer_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `seller_customers`
--

INSERT INTO `seller_customers` (`id`, `local_id`, `customer_id`, `seller_id`, `created_at`, `updated_at`) VALUES
(5782, 0, 15, 163, '2025-09-29 15:50:11', '2025-09-29 15:50:11');

-- --------------------------------------------------------

--
-- Table structure for table `seller_prices`
--

CREATE TABLE `seller_prices` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `price` double NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `seller_regions`
--

CREATE TABLE `seller_regions` (
  `id` int(11) NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `region_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `shifts`
--

CREATE TABLE `shifts` (
  `id` bigint(20) NOT NULL,
  `name` varchar(2555) NOT NULL,
  `start` time NOT NULL DEFAULT current_timestamp(),
  `end` time NOT NULL DEFAULT current_timestamp(),
  `breake` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `kilometer` varchar(2550) NOT NULL DEFAULT '0.1',
  `active` int(11) NOT NULL DEFAULT 1,
  `max` int(11) NOT NULL DEFAULT 0,
  `number_shifts` int(11) NOT NULL DEFAULT 0,
  `hours_of_each_shift` double NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `shifts`
--

INSERT INTO `shifts` (`id`, `name`, `start`, `end`, `breake`, `created_at`, `updated_at`, `kilometer`, `active`, `max`, `number_shifts`, `hours_of_each_shift`) VALUES
(1, 'دوام صباحي', '10:00:00', '18:00:00', 20, '2025-02-24 20:25:51', '2025-09-09 17:42:26', '0', 1, 20, 0, 0),
(2, 'دوام مسائي', '01:00:00', '21:00:00', 20, '2025-04-17 09:29:03', '2025-09-09 17:43:24', '0', 1, 20, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `soft_credentials`
--

CREATE TABLE `soft_credentials` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `key` varchar(255) DEFAULT NULL,
  `value` longtext DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `statuses`
--

CREATE TABLE `statuses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) NOT NULL,
  `code` varchar(64) NOT NULL,
  `color` varchar(32) DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `active` tinyint(1) NOT NULL DEFAULT 1,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `statuses`
--

INSERT INTO `statuses` (`id`, `name`, `code`, `color`, `sort_order`, `active`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 'in_Progress', 'in_Progress', '#55555', 0, 1, NULL, '2025-09-07 21:36:51', '2025-09-07 21:36:57');

-- --------------------------------------------------------

--
-- Table structure for table `stocks`
--

CREATE TABLE `stocks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL DEFAULT 1,
  `store_id` int(11) DEFAULT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `main_stock` mediumtext NOT NULL,
  `stock` mediumtext NOT NULL,
  `active` int(11) NOT NULL DEFAULT 1,
  `price` longtext NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `stock_batches`
--

CREATE TABLE `stock_batches` (
  `id` bigint(20) NOT NULL,
  `product_id` bigint(20) NOT NULL,
  `quantity` double NOT NULL DEFAULT 0,
  `price` double NOT NULL DEFAULT 0,
  `product_code` varchar(6555) DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 3,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `stock_histories`
--

CREATE TABLE `stock_histories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `stock` int(11) NOT NULL,
  `main_stock` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `stock_orders`
--

CREATE TABLE `stock_orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `statistcs` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `insert_flag` int(11) NOT NULL DEFAULT 1,
  `update_flag` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `storages`
--

CREATE TABLE `storages` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `parent_id` bigint(20) DEFAULT NULL,
  `local_id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NOT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `storages`
--

INSERT INTO `storages` (`id`, `parent_id`, `local_id`, `name`, `insert_flag`, `created_at`, `update_flag`, `updated_at`) VALUES
(1, NULL, 1, 'الخزينة الرئيسية', 1, '2024-08-31 03:57:04', 0, '2024-09-12 15:20:22'),
(22, NULL, 0, 'مستودع حفر الباطن', 1, '2024-12-08 08:34:06', 0, '2024-12-08 08:34:19'),
(23, NULL, 0, 'الأصول', 1, '2025-02-27 14:56:32', 0, '2025-02-27 14:56:32'),
(24, NULL, 0, 'الخصوم', 1, '2025-02-27 14:56:47', 0, '2025-02-27 14:56:47'),
(25, NULL, 0, 'حقوق الملكية', 1, '2025-02-27 14:56:59', 0, '2025-02-27 14:56:59'),
(26, NULL, 0, 'الإيرادات', 1, '2025-02-27 14:57:13', 0, '2025-02-27 14:57:13'),
(27, NULL, 0, 'المصروفات', 1, '2025-02-27 14:57:21', 0, '2025-02-27 14:57:21'),
(28, 23, 0, 'الأصول المتداولة', 1, '2025-03-03 00:45:33', 0, '2025-02-27 14:56:32'),
(29, 23, 0, 'الأصول غير متداولة', 1, '2025-03-03 00:45:54', 0, '2025-02-27 14:56:32');

-- --------------------------------------------------------

--
-- Table structure for table `storage_sellers`
--

CREATE TABLE `storage_sellers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `storage_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `stores`
--

CREATE TABLE `stores` (
  `store_id` bigint(20) NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `seller_id` bigint(20) UNSIGNED DEFAULT NULL,
  `store_code` char(30) NOT NULL,
  `store_name1` varchar(100) DEFAULT NULL,
  `store_type` tinyint(4) DEFAULT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` datetime DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `company_id` bigint(20) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sub_units`
--

CREATE TABLE `sub_units` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `unit_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `suppliers`
--

CREATE TABLE `suppliers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `mobile` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `state` varchar(255) DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `zip_code` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `due_amount` double DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `type` int(11) NOT NULL DEFAULT 0,
  `credit` double NOT NULL DEFAULT 0,
  `discount` double NOT NULL DEFAULT 0,
  `active` int(11) NOT NULL DEFAULT 1,
  `limit` double NOT NULL DEFAULT 0,
  `tax_number` varchar(2550) NOT NULL DEFAULT '0',
  `c_history` varchar(2550) NOT NULL DEFAULT '0',
  `account_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `system_logs`
--

CREATE TABLE `system_logs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `actor_admin_id` bigint(20) UNSIGNED DEFAULT NULL,
  `action` varchar(100) NOT NULL,
  `table_name` varchar(100) DEFAULT NULL,
  `record_id` bigint(20) UNSIGNED DEFAULT NULL,
  `lead_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` varchar(255) DEFAULT NULL,
  `meta` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`meta`)),
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `system_logs`
--

INSERT INTO `system_logs` (`id`, `actor_admin_id`, `action`, `table_name`, `record_id`, `lead_id`, `ip_address`, `user_agent`, `meta`, `created_at`) VALUES
(1, 100, 'department.delete', 'departments', 1, NULL, '2c0f:fc88:95:2bf6:8823:94de:2f8d:415d', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0642\\u0633\\u0645 \\u0627\\u0644\\u0645\\u062d\\u0627\\u0633\\u0628\\u064a\\u0646\",\"code\":\"999\",\"active\":true,\"parent_id\":null}', '2025-09-07 13:23:41'),
(2, 100, 'department.delete', 'departments', 2, NULL, '2c0f:fc88:95:2bf6:8823:94de:2f8d:415d', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0641\\u0631\\u064a\\u0642 \\u0645\\u062d\\u0627\\u0633\\u0628\\u064a\\u0646 \\u0627\\u0644\\u0631\\u064a\\u0627\\u0636\",\"code\":\"888\",\"active\":true,\"parent_id\":1}', '2025-09-07 13:24:36'),
(3, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:28:03'),
(4, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:37:26'),
(5, 100, 'create', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"new\":{\"name\":\"\\u0645\\u062f\\u064a\\u0631\",\"code\":\"09961\",\"description\":\"dfsdfsd\",\"status_id\":\"1\",\"owner_id\":\"100\",\"priority\":\"medium\",\"start_date\":\"2025-08-30T21:00:00.000000Z\",\"due_date\":\"2025-10-10T21:00:00.000000Z\",\"active\":true,\"updated_at\":\"2025-09-07T18:38:26.000000Z\",\"created_at\":\"2025-09-07T18:38:26.000000Z\",\"id\":1},\"lead_id\":null}', '2025-09-07 18:38:26'),
(6, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:38:26'),
(7, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:41:42'),
(8, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:41:51'),
(9, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:41:55'),
(10, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:41:58'),
(11, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:42:33'),
(12, 100, 'edit', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:42:36'),
(13, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:42:40'),
(14, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:42:45'),
(15, 100, 'edit', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:45:05'),
(16, 100, 'update', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"before\":{\"id\":1,\"name\":\"\\u0645\\u062f\\u064a\\u0631\",\"code\":\"09961\",\"description\":\"dfsdfsd\",\"status_id\":1,\"owner_id\":100,\"lead_id\":null,\"priority\":\"medium\",\"start_date\":\"2025-08-30T21:00:00.000000Z\",\"due_date\":\"2025-10-10T21:00:00.000000Z\",\"active\":true,\"deleted_at\":null,\"created_at\":\"2025-09-07T18:38:26.000000Z\",\"updated_at\":\"2025-09-07T18:38:26.000000Z\"},\"after\":{\"id\":1,\"name\":\"\\u0645\\u062f\\u064a\\u0631\",\"code\":\"09961\",\"description\":\"dfsdfsd\",\"status_id\":\"1\",\"owner_id\":\"100\",\"lead_id\":null,\"priority\":\"medium\",\"start_date\":null,\"due_date\":null,\"active\":true,\"deleted_at\":null,\"created_at\":\"2025-09-07T18:38:26.000000Z\",\"updated_at\":\"2025-09-07T18:45:12.000000Z\"},\"lead_id\":null}', '2025-09-07 18:45:12'),
(17, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:45:12'),
(18, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:45:18'),
(19, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:45:21'),
(20, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:46:09'),
(21, 100, 'edit', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:46:12'),
(22, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:46:14'),
(23, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:46:16'),
(24, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:46:19'),
(25, 100, 'edit', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:19'),
(26, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 18:47:21'),
(27, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:22'),
(28, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:25'),
(29, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:29'),
(30, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:32'),
(31, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:33'),
(32, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:36'),
(33, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:42'),
(34, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:47'),
(35, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:47:53'),
(36, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:48:00'),
(37, 100, 'create', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"new\":{\"project_id\":\"1\",\"title\":\"gfgf\",\"description\":\"dfdfd\",\"status_id\":\"1\",\"priority\":\"medium\",\"start_at\":\"2025-08-31T18:48:00.000000Z\",\"due_at\":\"2025-10-11T18:48:00.000000Z\",\"estimated_minutes\":\"5000\",\"approval_required\":true,\"created_by\":100,\"updated_at\":\"2025-09-07T18:49:06.000000Z\",\"created_at\":\"2025-09-07T18:49:06.000000Z\",\"id\":1},\"lead_id\":null}', '2025-09-07 18:49:06'),
(38, 100, 'assign', 'task_assignees', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":1,\"assignee\":\"159\"}', '2025-09-07 18:49:06'),
(39, 100, 'assign', 'task_assignees', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":1,\"assignee\":\"160\"}', '2025-09-07 18:49:06'),
(40, 100, 'assign', 'task_assignees', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":1,\"assignee\":\"161\"}', '2025-09-07 18:49:06'),
(41, 100, 'assign', 'task_assignees', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":1,\"assignee\":\"162\"}', '2025-09-07 18:49:06'),
(42, 100, 'approval_requested', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"approvers\":[100]}', '2025-09-07 18:49:06'),
(43, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:49:06'),
(44, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:51:03'),
(45, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:51:19'),
(46, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:51:21'),
(47, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:52:18'),
(48, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:53:09'),
(49, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 18:55:22'),
(50, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:16:50'),
(51, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:17:32'),
(52, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:17:43'),
(53, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:18:34'),
(54, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:18:39'),
(55, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:19:20'),
(56, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:19:26'),
(57, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:19:29'),
(58, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:21:02'),
(59, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:21:26'),
(60, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:21:38'),
(61, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:21:40'),
(62, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:21:41'),
(63, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:21:42'),
(64, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:21:49'),
(65, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:21:57'),
(66, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:22:03'),
(67, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:23:26'),
(68, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:23:32'),
(69, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:24:40'),
(70, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:24:46'),
(71, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:25:20'),
(72, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (X11; Linux aarch64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36 CrKey/1.54.250320', '[]', '2025-09-07 19:26:36'),
(73, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:26:51'),
(74, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:26:54'),
(75, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:28:17'),
(76, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:28:26'),
(77, 100, 'edit', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:28:28'),
(78, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:28:30'),
(79, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:28:31'),
(80, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:29:44'),
(81, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:29:46'),
(82, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:30:07'),
(83, 100, 'show', 'projects', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:30:12'),
(84, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:30:19'),
(85, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:30:26'),
(86, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:30:36'),
(87, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:30:40'),
(88, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:35:48'),
(89, 100, 'followup.store', 'follow_ups', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"assigned_to\":null}', '2025-09-07 19:36:04'),
(90, 100, 'followup.store', 'follow_ups', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"assigned_to\":null}', '2025-09-07 19:36:24'),
(91, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:38:19'),
(92, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:38:21'),
(93, 100, 'followup.store', 'follow_ups', 3, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"assigned_to\":null}', '2025-09-07 19:38:27'),
(94, 100, 'followup.store', 'follow_ups', 4, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"assigned_to\":null}', '2025-09-07 19:38:41'),
(95, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:38:41'),
(96, 100, 'show', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:38:48'),
(97, 100, 'delete', 'tasks', 1, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"deleted\":{\"id\":1,\"project_id\":1,\"lead_id\":null,\"title\":\"gfgf\",\"description\":\"dfdfd\",\"status_id\":1,\"priority\":\"medium\",\"start_at\":\"2025-08-31T18:48:00.000000Z\",\"due_at\":\"2025-10-11T18:48:00.000000Z\",\"estimated_minutes\":5000,\"actual_minutes\":null,\"created_by\":100,\"approval_required\":true,\"approval_status\":\"rejected\",\"approved_by\":100,\"approved_at\":\"2025-09-07T19:26:35.000000Z\",\"rejection_reason\":\"qde\",\"next_step_hint\":\"weqq\",\"deleted_at\":null,\"created_at\":\"2025-09-07T18:49:06.000000Z\",\"updated_at\":\"2025-09-07T19:26:35.000000Z\"},\"lead_id\":null}', '2025-09-07 19:39:01'),
(98, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:39:01'),
(99, 100, 'create', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"new\":{\"project_id\":\"1\",\"title\":\"sfdsfsd\",\"description\":\"dsfdsf\",\"status_id\":\"1\",\"priority\":\"medium\",\"start_at\":\"2025-09-09T19:39:00.000000Z\",\"due_at\":\"2025-10-06T19:39:00.000000Z\",\"estimated_minutes\":\"2332\",\"approval_required\":false,\"created_by\":100,\"updated_at\":\"2025-09-07T19:39:30.000000Z\",\"created_at\":\"2025-09-07T19:39:30.000000Z\",\"id\":2},\"lead_id\":null}', '2025-09-07 19:39:30'),
(100, 100, 'assign', 'task_assignees', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":2,\"assignee\":\"159\"}', '2025-09-07 19:39:30'),
(101, 100, 'assign', 'task_assignees', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":2,\"assignee\":\"160\"}', '2025-09-07 19:39:30'),
(102, 100, 'assign', 'task_assignees', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":2,\"assignee\":\"161\"}', '2025-09-07 19:39:30'),
(103, 100, 'assign', 'task_assignees', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"task_id\":2,\"assignee\":\"162\"}', '2025-09-07 19:39:30'),
(104, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:39:31'),
(105, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:40:50'),
(106, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:40:53'),
(107, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:40:56'),
(108, 100, 'followup.store', 'follow_ups', 5, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"assigned_to\":null}', '2025-09-07 19:41:14'),
(109, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:41:14'),
(110, 100, 'followup.store', 'follow_ups', 6, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"assigned_to\":null}', '2025-09-07 19:50:00'),
(111, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:50:00'),
(112, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:50:23'),
(113, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:50:25'),
(114, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:50:38'),
(115, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:50:39'),
(116, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:51:26'),
(117, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:51:27'),
(118, 100, 'edit', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:51:32'),
(119, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:52:04'),
(120, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:52:05'),
(121, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:52:06'),
(122, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 19:52:07'),
(123, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:52:09'),
(124, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:54:28'),
(125, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 19:54:42'),
(126, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 19:54:43'),
(127, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 20:07:18'),
(128, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 20:07:24'),
(129, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 20:11:06'),
(130, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 20:13:37'),
(131, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 20:14:22'),
(132, 100, 'show', 'tasks', 2, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-07 20:14:32'),
(133, 100, 'list', 'projects', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-07 20:21:05'),
(134, 100, 'list', 'tasks', NULL, NULL, '41.35.245.133', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-07 20:21:06'),
(135, 100, 'list', 'projects', NULL, NULL, '41.40.0.221', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-08 13:28:44'),
(136, 100, 'show', 'projects', 1, NULL, '41.40.0.221', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-08 13:28:51'),
(137, 100, 'show', 'tasks', 2, NULL, '41.40.0.221', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '[]', '2025-09-08 13:29:08'),
(138, 100, 'list', 'projects', NULL, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-09 07:23:48'),
(139, 100, 'create', 'projects', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"new\":{\"name\":\"\\u0636\\u0631\\u064a\\u0628\\u0629 \\u0635\\u0641\\u0631\\u064a\\u0647\",\"code\":\"13123\",\"description\":\"sdsfasddsa\",\"status_id\":\"1\",\"owner_id\":\"100\",\"priority\":\"medium\",\"start_date\":\"2025-08-31T21:00:00.000000Z\",\"due_date\":\"2025-10-09T21:00:00.000000Z\",\"active\":true,\"updated_at\":\"2025-09-09T07:24:28.000000Z\",\"created_at\":\"2025-09-09T07:24:28.000000Z\",\"id\":2},\"lead_id\":null}', '2025-09-09 07:24:28'),
(140, 100, 'show', 'projects', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:24:29'),
(141, 100, 'show', 'projects', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:24:42'),
(142, 100, 'show', 'projects', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:24:46'),
(143, 100, 'list', 'tasks', NULL, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"priority\":null,\"assignee\":null,\"projectId\":null,\"active\":null}}', '2025-09-09 07:27:28'),
(144, 100, 'show', 'tasks', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:27:30'),
(145, 100, 'show', 'tasks', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:27:49'),
(146, 100, 'show', 'tasks', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:29:18'),
(147, 100, 'show', 'tasks', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:30:04'),
(148, 100, 'list', 'projects', NULL, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-09 07:31:27'),
(149, 100, 'show', 'projects', 1, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:31:30'),
(150, 100, 'show', 'projects', 1, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:31:55'),
(151, 100, 'show', 'tasks', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:32:03'),
(152, 100, 'show', 'tasks', 2, NULL, '2c0f:fc89:802d:cb58:cc36:5d3:227d:98b5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '[]', '2025-09-09 07:32:07'),
(153, 163, 'department.delete', 'departments', 1, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0642\\u0633\\u0645 \\u0627\\u0644\\u0645\\u062d\\u0627\\u0633\\u0628\\u064a\\u0646\",\"code\":\"999\",\"active\":true,\"parent_id\":null}', '2025-09-09 14:32:22'),
(154, 163, 'department.delete', 'departments', 2, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0641\\u0631\\u064a\\u0642 \\u0645\\u062d\\u0627\\u0633\\u0628\\u064a\\u0646 \\u0627\\u0644\\u0631\\u064a\\u0627\\u0636\",\"code\":\"888\",\"active\":true,\"parent_id\":1}', '2025-09-09 14:32:25'),
(155, 163, 'department.create', 'departments', 3, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0627\\u0644\\u0645\\u062d\\u0633\\u0627\\u0628\\u064a\\u0646\",\"code\":\"1\",\"active\":true,\"parent_id\":null}', '2025-09-09 14:32:53'),
(156, 163, 'department.create', 'departments', 4, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0645\\u062d\\u0627\\u0633\\u0628\\u064a\\u0646 \\u0627\\u0644\\u0631\\u064a\\u0627\\u0636\",\"code\":\"11\",\"active\":true,\"parent_id\":\"3\"}', '2025-09-09 14:33:30'),
(157, 163, 'department.create', 'departments', 5, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0645\\u062d\\u0627\\u0633\\u0628\\u064a\\u0646 \\u0627\\u0644\\u062d\\u0641\\u0631\",\"code\":\"12\",\"active\":true,\"parent_id\":\"3\"}', '2025-09-09 14:33:54'),
(158, 163, 'department.create', 'departments', 6, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0645\\u062d\\u0627\\u0633\\u0628\\u064a\\u0646 \\u0639\\u0631\\u0639\\u0631\",\"code\":\"13\",\"active\":true,\"parent_id\":\"3\"}', '2025-09-09 14:34:18'),
(159, 163, 'department.create', 'departments', 7, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0645\\u0646\\u0633\\u0642\\u064a\\u0646\",\"code\":\"2\",\"active\":true,\"parent_id\":null}', '2025-09-09 14:34:45'),
(160, 163, 'department.create', 'departments', 8, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0645\\u0646\\u0633\\u0642\\u064a\\u0646 \\u0627\\u0644\\u0631\\u064a\\u0627\\u0636\",\"code\":\"21\",\"active\":true,\"parent_id\":\"7\"}', '2025-09-09 14:35:01'),
(161, 163, 'department.create', 'departments', 9, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0645\\u0646\\u0633\\u0642\\u064a\\u0646 \\u0627\\u0644\\u062d\\u0641\\u0631\",\"code\":\"22\",\"active\":true,\"parent_id\":\"7\"}', '2025-09-09 14:35:20'),
(162, 163, 'department.create', 'departments', 10, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"name\":\"\\u0645\\u0646\\u0633\\u0642\\u064a\\u0646 \\u0639\\u0631\\u0639\\u0631\",\"code\":\"23\",\"active\":true,\"parent_id\":\"7\"}', '2025-09-09 14:35:34'),
(163, 163, 'list', 'projects', NULL, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"filters\":{\"q\":null,\"statusId\":null,\"ownerId\":null,\"active\":null}}', '2025-09-09 14:46:18'),
(164, 161, 'lead_status.deleted', 'lead_statuses', 2, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"before\":{\"id\":2,\"name\":\"pending\",\"code\":\"1234\",\"sort_order\":100,\"is_active\":true,\"created_at\":\"2025-08-23T00:15:57.000000Z\",\"updated_at\":\"2025-08-23T00:26:10.000000Z\"}}', '2025-09-09 14:53:31'),
(165, 161, 'lead_status.deleted', 'lead_statuses', 3, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"before\":{\"id\":3,\"name\":\"\\u0628\\u0627\\u0646\\u062a\\u0638\\u0627\\u0631 \\u0627\\u062e\\u062a\\u064a\\u0627\\u0631 \\u0627\\u0644\\u0639\\u0627\\u0645\\u0644\\u0647\",\"code\":\"1001\",\"sort_order\":100,\"is_active\":true,\"created_at\":\"2025-08-23T11:43:14.000000Z\",\"updated_at\":\"2025-08-23T11:43:14.000000Z\"}}', '2025-09-09 14:53:40'),
(166, 161, 'lead_status.created', 'lead_statuses', 4, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0645\\u0645\\u0645\",\"code\":\"1111\",\"sort_order\":\"100\",\"is_active\":true,\"updated_at\":\"2025-09-09T14:54:26.000000Z\",\"created_at\":\"2025-09-09T14:54:26.000000Z\",\"id\":4}}', '2025-09-09 14:54:26'),
(167, 161, 'lead_status.deleted', 'lead_statuses', 4, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"before\":{\"id\":4,\"name\":\"\\u0645\\u0645\\u0645\",\"code\":\"1111\",\"sort_order\":100,\"is_active\":true,\"created_at\":\"2025-09-09T14:54:26.000000Z\",\"updated_at\":\"2025-09-09T14:54:26.000000Z\"}}', '2025-09-09 14:54:40'),
(168, 161, 'lead_status.created', 'lead_statuses', 5, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0635\\u062f\\u0627\\u0631 \\u0627\\u0644\\u0639\\u0642\\u062f\",\"code\":\"1\",\"sort_order\":\"100\",\"is_active\":true,\"updated_at\":\"2025-09-09T14:57:24.000000Z\",\"created_at\":\"2025-09-09T14:57:24.000000Z\",\"id\":5}}', '2025-09-09 14:57:24'),
(169, 161, 'lead_status.created', 'lead_statuses', 6, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0646\\u062a\\u0638\\u0627\\u0631 \\u0645\\u0648\\u0627\\u0641\\u0642\\u0629 \\u0645\\u0643\\u062a\\u0628 \\u0627\\u0644\\u0627\\u0631\\u0633\\u0627\\u0644 \\u0627\\u0644\\u062e\\u0627\\u0631\\u062c\\u064a\",\"code\":\"2\",\"sort_order\":\"101\",\"is_active\":true,\"updated_at\":\"2025-09-09T14:59:17.000000Z\",\"created_at\":\"2025-09-09T14:59:17.000000Z\",\"id\":6}}', '2025-09-09 14:59:17'),
(170, 161, 'lead_status.created', 'lead_statuses', 7, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0646\\u062a\\u0638\\u0627\\u0631 \\u0646\\u062a\\u064a\\u062c\\u0629 \\u0627\\u0644\\u0641\\u062d\\u0635 \\u0627\\u0644\\u0637\\u0628\\u064a\",\"code\":\"3\",\"sort_order\":\"102\",\"is_active\":true,\"updated_at\":\"2025-09-09T14:59:43.000000Z\",\"created_at\":\"2025-09-09T14:59:43.000000Z\",\"id\":7}}', '2025-09-09 14:59:43'),
(171, 161, 'lead_status.created', 'lead_statuses', 8, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0646\\u062a\\u0638\\u0627\\u0631 \\u0645\\u0648\\u0627\\u0641\\u0642\\u0629 \\u0648\\u0632\\u0627\\u0631\\u0629 \\u0627\\u0644\\u0639\\u0645\\u0644 \\u0627\\u0644\\u062e\\u0627\\u0631\\u062c\\u064a\\u0647\",\"code\":\"104\",\"sort_order\":\"103\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:00:11.000000Z\",\"created_at\":\"2025-09-09T15:00:11.000000Z\",\"id\":8}}', '2025-09-09 15:00:11'),
(172, 161, 'lead_status.created', 'lead_statuses', 9, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u062a\\u0635\\u062f\\u064a\\u0642 \\u0627\\u0644\\u062a\\u0627\\u0634\\u064a\\u0631\\u0647\",\"code\":\"105\",\"sort_order\":\"104\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:01:13.000000Z\",\"created_at\":\"2025-09-09T15:01:13.000000Z\",\"id\":9}}', '2025-09-09 15:01:13'),
(173, 161, 'lead_status.created', 'lead_statuses', 10, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0646\\u062a\\u0638\\u0627\\u0631 \\u0627\\u0644\\u062d\\u0635\\u0648\\u0644 \\u0639\\u0644\\u064a \\u0634\\u0647\\u0627\\u062f\\u0629 \\u0627\\u0644\\u062a\\u062f\\u0631\\u064a\\u0628 \\u0627\\u0644\\u0645\\u062f\\u0631\\u0633\\u064a\",\"code\":\"106\",\"sort_order\":\"105\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:02:42.000000Z\",\"created_at\":\"2025-09-09T15:02:42.000000Z\",\"id\":10}}', '2025-09-09 15:02:42'),
(174, 161, 'lead_status.created', 'lead_statuses', 11, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0644\\u062d\\u0635\\u0648\\u0644 \\u0639\\u0644\\u064a \\u0648\\u0631\\u0642\\u0629 \\u062d\\u0633\\u0646 \\u0627\\u0644\\u0633\\u064a\\u0631 \\u0648\\u0627\\u0644\\u0633\\u0644\\u0648\\u0643\",\"code\":\"107\",\"sort_order\":\"106\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:03:20.000000Z\",\"created_at\":\"2025-09-09T15:03:20.000000Z\",\"id\":11}}', '2025-09-09 15:03:20'),
(175, 161, 'lead_status.created', 'lead_statuses', 12, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u062a\\u0645 \\u0627\\u0635\\u062f\\u0627\\u0631 \\u0627\\u0644\\u062a\\u0627\\u0634\\u064a\\u0631\\u0647\",\"code\":\"108\",\"sort_order\":\"109\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:04:32.000000Z\",\"created_at\":\"2025-09-09T15:04:32.000000Z\",\"id\":12}}', '2025-09-09 15:04:32'),
(176, 161, 'lead_status.created', 'lead_statuses', 13, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0644\\u0635\\u062d\\u0648\\u0644 \\u0639\\u0644\\u064a \\u062a\\u0635\\u0631\\u064a\\u062d \\u0627\\u0644\\u0633\\u0641\\u0631\",\"code\":\"109\",\"sort_order\":\"108\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:05:03.000000Z\",\"created_at\":\"2025-09-09T15:05:03.000000Z\",\"id\":13}}', '2025-09-09 15:05:03'),
(177, 161, 'lead_status.created', 'lead_statuses', 14, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0627\\u0644\\u062d\\u0635\\u0648\\u0644 \\u0639\\u0644\\u064a \\u062a\\u0630\\u0643\\u0631\\u0629 \\u0637\\u064a\\u0631\\u0627\\u0646\",\"code\":\"110\",\"sort_order\":\"109\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:05:20.000000Z\",\"created_at\":\"2025-09-09T15:05:20.000000Z\",\"id\":14}}', '2025-09-09 15:05:20');
INSERT INTO `system_logs` (`id`, `actor_admin_id`, `action`, `table_name`, `record_id`, `lead_id`, `ip_address`, `user_agent`, `meta`, `created_at`) VALUES
(178, 161, 'lead_status.created', 'lead_statuses', 15, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"name\":\"\\u0645\\u0648\\u0639\\u062f \\u0627\\u0644\\u0648\\u0635\\u0648\\u0644\",\"code\":\"111\",\"sort_order\":\"110\",\"is_active\":true,\"updated_at\":\"2025-09-09T15:06:32.000000Z\",\"created_at\":\"2025-09-09T15:06:32.000000Z\",\"id\":15}}', '2025-09-09 15:06:32'),
(179, 161, 'lead_status.updated', 'lead_statuses', 14, NULL, '2001:16a2:c85f:d400:527:7b76:c5ed:aba5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"before\":{\"name\":\"\\u0627\\u0644\\u062d\\u0635\\u0648\\u0644 \\u0639\\u0644\\u064a \\u062a\\u0630\\u0643\\u0631\\u0629 \\u0637\\u064a\\u0631\\u0627\\u0646\",\"code\":\"110\",\"sort_order\":109,\"is_active\":true},\"after\":{\"id\":14,\"name\":\"\\u0627\\u0646\\u062a\\u0638\\u0627\\u0631 \\u062d\\u062c\\u0632 \\u0627\\u0644\\u062a\\u0630\\u0643\\u0631\\u0647\",\"code\":\"110\",\"sort_order\":\"109\",\"is_active\":true,\"created_at\":\"2025-09-09T15:05:20.000000Z\",\"updated_at\":\"2025-09-09T15:08:04.000000Z\"},\"changes\":{\"name\":\"\\u0627\\u0646\\u062a\\u0638\\u0627\\u0631 \\u062d\\u062c\\u0632 \\u0627\\u0644\\u062a\\u0630\\u0643\\u0631\\u0647\",\"updated_at\":\"2025-09-09 18:08:04\"}}', '2025-09-09 15:08:04'),
(186, 163, 'lead_source.updated', 'lead_sources', 1, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"before\":{\"name\":\"Face Book\",\"code\":\"1234\"},\"after\":{\"id\":1,\"name\":\"\\u0641\\u064a\\u0633 \\u0628\\u0648\\u0643\",\"code\":\"1234\",\"created_at\":\"2025-08-23T00:36:01.000000Z\",\"updated_at\":\"2025-09-09T15:18:16.000000Z\"},\"changes\":{\"name\":\"\\u0641\\u064a\\u0633 \\u0628\\u0648\\u0643\",\"updated_at\":\"2025-09-09 18:18:16\"}}', '2025-09-09 15:18:16'),
(187, 163, 'lead_source.updated', 'lead_sources', 2, NULL, '2001:16a2:c85f:d400:c0bf:7f76:aa3a:e058', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36', '{\"before\":{\"name\":\"Instgram\",\"code\":\"12345\"},\"after\":{\"id\":2,\"name\":\"\\u0627\\u0646\\u0633\\u062a\\u062c\\u0631\\u0627\\u0645\",\"code\":\"12345\",\"created_at\":\"2025-08-23T00:40:35.000000Z\",\"updated_at\":\"2025-09-09T15:18:26.000000Z\"},\"changes\":{\"name\":\"\\u0627\\u0646\\u0633\\u062a\\u062c\\u0631\\u0627\\u0645\",\"updated_at\":\"2025-09-09 18:18:26\"}}', '2025-09-09 15:18:26'),
(188, 163, 'lead.created', 'leads', 7, 7, '2001:16a4:5d:eb5:14cf:27be:e034:6239', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"after\":{\"owner_id\":\"166\",\"status_id\":\"5\",\"source_id\":\"2\",\"company_name\":\"Elmashreq\",\"contact_name\":\"Elmashreq\",\"email\":\"Elmashreq@gmail.com\",\"country_code\":\"+966\",\"phone\":\"555237602\",\"whatsapp\":\"555237602\",\"potential_value\":null,\"currency\":\"SAR\",\"rating\":4,\"pipeline_notes\":\"fgffggf\",\"last_contact_at\":null,\"next_action_at\":null,\"created_by_admin_id\":163,\"updated_at\":\"2025-09-09T22:15:09.000000Z\",\"created_at\":\"2025-09-09T22:15:09.000000Z\",\"id\":7,\"phone_normalized\":\"+966 555237602\"}}', '2025-09-09 22:15:09'),
(189, 163, 'lead.updated', 'leads', 7, 7, '2001:16a4:5d:eb5:14cf:27be:e034:6239', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', '{\"before\":{\"owner_id\":166,\"created_by_admin_id\":163,\"updated_by_admin_id\":null,\"status_id\":5,\"source_id\":2,\"company_name\":\"Elmashreq\",\"contact_name\":\"Elmashreq\",\"email\":\"Elmashreq@gmail.com\",\"country_code\":\"+966\",\"phone\":\"555237602\",\"phone_normalized\":\"+966 555237602\",\"whatsapp\":\"555237602\",\"potential_value\":null,\"currency\":\"SAR\",\"rating\":4,\"pipeline_notes\":\"fgffggf\",\"last_contact_at\":null,\"next_action_at\":null,\"is_archived\":false},\"after\":{\"id\":7,\"owner_id\":\"166\",\"created_by_admin_id\":163,\"updated_by_admin_id\":null,\"status_id\":\"5\",\"source_id\":\"2\",\"company_name\":\"Elmashreq\",\"contact_name\":\"Elmashreq\",\"email\":\"Elmashreq@gmail.com\",\"country_code\":\"+966\",\"phone\":\"555237602\",\"phone_normalized\":\"+966 555237602\",\"whatsapp\":\"555237602\",\"potential_value\":null,\"currency\":\"SAR\",\"rating\":4,\"pipeline_notes\":\"fgffggf\",\"last_contact_at\":null,\"next_action_at\":null,\"is_archived\":false,\"created_at\":\"2025-09-09T22:15:09.000000Z\",\"updated_at\":\"2025-09-09T22:15:09.000000Z\"},\"changes\":[]}', '2025-09-09 22:16:14');

-- --------------------------------------------------------

--
-- Table structure for table `tasks`
--

CREATE TABLE `tasks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `project_id` bigint(20) UNSIGNED DEFAULT NULL,
  `lead_id` bigint(20) UNSIGNED DEFAULT NULL,
  `title` varchar(191) NOT NULL,
  `description` text DEFAULT NULL,
  `status_id` bigint(20) UNSIGNED DEFAULT NULL,
  `priority` enum('low','medium','high','urgent') NOT NULL DEFAULT 'medium',
  `start_at` datetime DEFAULT NULL,
  `due_at` datetime DEFAULT NULL,
  `estimated_minutes` int(10) UNSIGNED DEFAULT NULL,
  `actual_minutes` int(10) UNSIGNED DEFAULT NULL,
  `created_by` bigint(20) UNSIGNED NOT NULL,
  `approval_required` tinyint(1) NOT NULL DEFAULT 0,
  `approval_status` enum('pending','approved','rejected') NOT NULL DEFAULT 'pending',
  `approved_by` bigint(20) UNSIGNED DEFAULT NULL,
  `approved_at` datetime DEFAULT NULL,
  `rejection_reason` varchar(255) DEFAULT NULL,
  `next_step_hint` varchar(255) DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tasks`
--

INSERT INTO `tasks` (`id`, `project_id`, `lead_id`, `title`, `description`, `status_id`, `priority`, `start_at`, `due_at`, `estimated_minutes`, `actual_minutes`, `created_by`, `approval_required`, `approval_status`, `approved_by`, `approved_at`, `rejection_reason`, `next_step_hint`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 1, NULL, 'gfgf', 'dfdfd', 1, 'medium', '2025-08-31 21:48:00', '2025-10-11 21:48:00', 5000, NULL, 100, 1, 'rejected', 100, '2025-09-07 22:26:35', 'qde', 'weqq', '2025-09-07 22:39:01', '2025-09-07 21:49:06', '2025-09-07 22:39:01'),
(2, 1, NULL, 'sfdsfsd', 'dsfdsf', 1, 'medium', '2025-09-09 22:39:00', '2025-10-06 22:39:00', 2332, NULL, 100, 0, 'pending', NULL, NULL, NULL, NULL, NULL, '2025-09-07 22:39:30', '2025-09-07 19:54:39');

-- --------------------------------------------------------

--
-- Table structure for table `task_assignees`
--

CREATE TABLE `task_assignees` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `task_id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `role` enum('assignee','reviewer','watcher') NOT NULL DEFAULT 'assignee',
  `priority` enum('low','medium','high','urgent') NOT NULL DEFAULT 'medium',
  `due_at` datetime DEFAULT NULL,
  `assigned_by` bigint(20) UNSIGNED DEFAULT NULL,
  `assigned_at` datetime DEFAULT current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `task_assignees`
--

INSERT INTO `task_assignees` (`id`, `task_id`, `admin_id`, `role`, `priority`, `due_at`, `assigned_by`, `assigned_at`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 1, 159, 'assignee', 'medium', '2025-10-11 21:48:00', 100, '2025-09-07 18:49:06', NULL, '2025-09-07 21:49:06', '2025-09-07 21:49:06'),
(2, 1, 160, 'assignee', 'medium', '2025-10-11 21:48:00', 100, '2025-09-07 18:49:06', NULL, '2025-09-07 21:49:06', '2025-09-07 21:49:06'),
(3, 1, 161, 'assignee', 'medium', '2025-10-11 21:48:00', 100, '2025-09-07 18:49:06', '2025-09-07 22:19:29', '2025-09-07 21:49:06', '2025-09-07 22:19:29'),
(4, 1, 162, 'assignee', 'medium', '2025-10-11 21:48:00', 100, '2025-09-07 18:49:06', '2025-09-07 22:19:26', '2025-09-07 21:49:06', '2025-09-07 22:19:26'),
(5, 1, 159, 'reviewer', 'urgent', '2025-09-25 22:19:00', 100, '2025-09-07 19:19:20', NULL, '2025-09-07 22:19:20', '2025-09-07 22:19:20'),
(6, 2, 159, 'assignee', 'medium', '2025-10-06 22:39:00', 100, '2025-09-07 19:39:30', NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30'),
(7, 2, 160, 'assignee', 'medium', '2025-10-06 22:39:00', 100, '2025-09-07 19:39:30', NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30'),
(8, 2, 161, 'assignee', 'medium', '2025-10-06 22:39:00', 100, '2025-09-07 19:39:30', NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30'),
(9, 2, 162, 'assignee', 'medium', '2025-10-06 22:39:00', 100, '2025-09-07 19:39:30', NULL, '2025-09-07 22:39:30', '2025-09-07 22:39:30');

-- --------------------------------------------------------

--
-- Table structure for table `taxes`
--

CREATE TABLE `taxes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(25) NOT NULL,
  `amount` varchar(11) NOT NULL,
  `active` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `taxes`
--

INSERT INTO `taxes` (`id`, `name`, `amount`, `active`, `created_at`, `updated_at`) VALUES
(2, 'ضريبة القيمة المضافة', '15', 1, '2025-02-26 02:45:03', '2025-08-20 17:47:56'),
(5, 'ضريبة صفريه', '0', 1, '2025-03-13 21:17:22', '2025-08-30 16:52:41'),
(6, 'الضريبة الانتقائية 1', '100', 1, '2025-03-13 21:18:09', '2025-03-13 21:18:13');

-- --------------------------------------------------------

--
-- Table structure for table `tickets`
--

CREATE TABLE `tickets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `code` varchar(50) DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `approved_status` enum('pending','approved','rejected') NOT NULL DEFAULT 'pending',
  `approved_by` bigint(20) UNSIGNED DEFAULT NULL,
  `approved_at` datetime DEFAULT NULL,
  `is_resolved` tinyint(1) NOT NULL DEFAULT 0,
  `resolved_by` bigint(20) UNSIGNED DEFAULT NULL,
  `resolved_at` datetime DEFAULT NULL,
  `created_by` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ticket_assignees`
--

CREATE TABLE `ticket_assignees` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ticket_id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED NOT NULL,
  `assigned_by_admin_id` bigint(20) UNSIGNED DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `assigned_at` datetime NOT NULL DEFAULT current_timestamp(),
  `unassigned_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ticket_comments`
--

CREATE TABLE `ticket_comments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ticket_id` bigint(20) UNSIGNED NOT NULL,
  `admin_id` bigint(20) UNSIGNED DEFAULT NULL,
  `body` text NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `transaction_sellers`
--

CREATE TABLE `transaction_sellers` (
  `id` bigint(20) NOT NULL,
  `seller_id` bigint(20) NOT NULL,
  `account_id` bigint(20) NOT NULL,
  `amount` varchar(255) NOT NULL,
  `note` mediumtext DEFAULT NULL,
  `img` mediumtext NOT NULL,
  `active` int(11) NOT NULL DEFAULT 0,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `transections`
--

CREATE TABLE `transections` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tran_type` varchar(255) DEFAULT NULL,
  `account_id` bigint(20) UNSIGNED DEFAULT NULL,
  `account_id_to` bigint(20) UNSIGNED DEFAULT NULL,
  `seller_id` bigint(20) UNSIGNED DEFAULT NULL,
  `branch_id` bigint(20) NOT NULL DEFAULT 1,
  `cost_id` bigint(20) DEFAULT NULL,
  `cost_id_to` bigint(20) DEFAULT NULL,
  `amount` double DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `debit` double DEFAULT 0,
  `credit` double DEFAULT 0,
  `balance` double DEFAULT 0,
  `credit_account` double NOT NULL DEFAULT 0,
  `debit_account` double NOT NULL DEFAULT 0,
  `balance_account` double NOT NULL DEFAULT 0,
  `balance_customer` mediumtext NOT NULL DEFAULT '0',
  `date` date DEFAULT NULL,
  `end_date` mediumtext DEFAULT NULL,
  `customer_id` int(10) UNSIGNED DEFAULT NULL,
  `supplier_id` int(10) UNSIGNED DEFAULT NULL,
  `order_id` int(10) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1,
  `asset_id` bigint(20) DEFAULT NULL,
  `expense_id` bigint(20) DEFAULT NULL,
  `tax` double NOT NULL DEFAULT 0,
  `fixed_type` int(11) DEFAULT NULL,
  `img` mediumtext DEFAULT NULL,
  `active` int(11) NOT NULL DEFAULT 1,
  `cash` int(11) NOT NULL DEFAULT 1,
  `name` varchar(500) DEFAULT NULL,
  `tax_number` varchar(500) DEFAULT NULL,
  `tax_id` bigint(20) DEFAULT NULL,
  `is_reversal` int(11) NOT NULL DEFAULT 0,
  `salary_id` bigint(20) DEFAULT NULL,
  `journal_entry_detail_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `transections`
--

INSERT INTO `transections` (`id`, `tran_type`, `account_id`, `account_id_to`, `seller_id`, `branch_id`, `cost_id`, `cost_id_to`, `amount`, `description`, `debit`, `credit`, `balance`, `credit_account`, `debit_account`, `balance_account`, `balance_customer`, `date`, `end_date`, `customer_id`, `supplier_id`, `order_id`, `created_at`, `updated_at`, `deleted_at`, `company_id`, `asset_id`, `expense_id`, `tax`, `fixed_type`, `img`, `active`, `cash`, `name`, `tax_number`, `tax_id`, `is_reversal`, `salary_id`, `journal_entry_detail_id`) VALUES
(1, '1', 151, NULL, 160, 1, NULL, NULL, 16307.46, 'رصيد افتتاحي', 0, 16307.46, -16307.46, 16307.46, 0, 0, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-11 18:20:00', '2025-09-11 18:20:00', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(2, '1', 297, NULL, 160, 1, NULL, NULL, 16307.46, 'رصيد افتتاحي', 16307.46, 0, 16307.46, 0, 16307.46, 0, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-11 18:20:00', '2025-09-11 18:20:00', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(3, '1', 151, NULL, 160, 1, NULL, NULL, 16307.46, 'رصيد افتتاحي', 0, 16307.46, -32614.92, 16307.46, 0, -16307.46, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-11 18:31:07', '2025-09-11 18:31:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(4, '1', 297, NULL, 160, 1, NULL, NULL, 16307.46, 'رصيد افتتاحي', 16307.46, 0, 32614.92, 0, 16307.46, 16307.46, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-11 18:31:07', '2025-09-11 18:31:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(5, 'Journal', 59, NULL, 163, 1, NULL, NULL, 0.1, 'صص', 0.1, 0, 0.1, 0, 0, 0, '0', '2025-09-12', NULL, NULL, NULL, NULL, '2025-09-12 14:24:05', '2025-09-12 14:30:32', '2025-09-12 14:30:32', 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 5),
(6, 'Journal', 59, NULL, 163, 1, NULL, NULL, 0.1, 'صص', 0, 0.1, 0, 0, 0, 0.1, '0', '2025-09-12', NULL, NULL, NULL, NULL, '2025-09-12 14:24:05', '2025-09-12 14:30:32', '2025-09-12 14:30:32', 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 6),
(7, '1', 151, NULL, 160, 1, NULL, NULL, 16307.46, 'رصيد افتتاحي', 0, 16307.46, -48922.38, 16307.46, 0, -32614.92, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 11:09:24', '2025-09-13 11:09:24', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(8, '1', 297, NULL, 160, 1, NULL, NULL, 16307.46, 'رصيد افتتاحي', 16307.46, 0, 48922.38, 0, 16307.46, 32614.92, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 11:09:24', '2025-09-13 11:09:24', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(9, '1', 151, NULL, 160, 1, NULL, NULL, 32614.92, 'تسوية رصيد افتتاحي إلى قيمة نهائية (إلى -16307.46)', 32614.92, 0, -16307.46, 0, 32614.92, -48922.38, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 14:32:32', '2025-09-13 14:32:32', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(10, '1', 297, NULL, 160, 1, NULL, NULL, 32614.92, 'تسوية رصيد افتتاحي إلى قيمة نهائية (مقابل بنك الراجحى)', 0, 32614.92, 16307.46, 32614.92, 0, 48922.38, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 14:32:32', '2025-09-13 14:32:32', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(11, '1', 151, NULL, 160, 1, NULL, NULL, 48922.38, 'تسوية رصيد افتتاحي إلى قيمة نهائية (إلى 32614.92)', 48922.38, 0, 32614.92, 0, 48922.38, -16307.46, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 14:39:10', '2025-09-13 14:39:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(12, '1', 297, NULL, 160, 1, NULL, NULL, 48922.38, 'تسوية رصيد افتتاحي إلى قيمة نهائية (مقابل بنك الراجحى)', 0, 48922.38, -32614.92, 48922.38, 0, 16307.46, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 14:39:10', '2025-09-13 14:39:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(13, '1', 151, NULL, 160, 1, NULL, NULL, 81537.3, 'تسوية رصيد افتتاحي إلى قيمة نهائية (إلى -48922.38)', 0, 81537.3, -48922.38, 81537.3, 0, 32614.92, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 14:41:17', '2025-09-13 14:41:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(14, '1', 297, NULL, 160, 1, NULL, NULL, 81537.3, 'تسوية رصيد افتتاحي إلى قيمة نهائية (مقابل بنك الراجحى)', 81537.3, 0, 48922.38, 0, 81537.3, -32614.92, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 14:41:17', '2025-09-13 14:41:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(15, '1', 151, NULL, 163, 1, NULL, NULL, 130459.68, 'تسوية رصيد افتتاحي إلى قيمة نهائية (إلى 81537.30)', 130459.68, 0, 81537.3, 0, 130459.68, -48922.38, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:05:46', '2025-09-13 15:05:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(16, '1', 297, NULL, 163, 1, NULL, NULL, 130459.68, 'تسوية رصيد افتتاحي إلى قيمة نهائية (مقابل بنك الراجحى)', 0, 130459.68, -81537.3, 130459.68, 0, 48922.38, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:05:46', '2025-09-13 15:05:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(17, '1', 151, NULL, 163, 1, NULL, NULL, 130459.68, 'تسوية رصيد افتتاحي إلى قيمة نهائية (إلى 211996.98)', 130459.68, 0, 211996.98, 0, 130459.68, 81537.3, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:12:30', '2025-09-13 15:12:30', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(18, '1', 297, NULL, 163, 1, NULL, NULL, 130459.68, 'تسوية رصيد افتتاحي إلى قيمة نهائية (مقابل بنك الراجحى)', 0, 130459.68, -211996.98, 130459.68, 0, -81537.3, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:12:30', '2025-09-13 15:12:30', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(19, '1', 151, NULL, 163, 1, NULL, NULL, 342456.66, 'قيد رصيد افتتاحي (تسجيل أول مرة)', 342456.66, 0, 554453.64, 0, 342456.66, 211996.98, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:16:59', '2025-09-13 15:16:59', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(20, '1', 297, NULL, 163, 1, NULL, NULL, 342456.66, 'قيد رصيد افتتاحي (تسجيل أول مرة) (مقابل بنك الراجحى)', 0, 342456.66, -554453.64, 342456.66, 0, -211996.98, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:16:59', '2025-09-13 15:16:59', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(21, '1', 151, NULL, 163, 1, NULL, NULL, 684913.32, 'قيد رصيد افتتاحي (تسجيل أول مرة)', 684913.32, 0, 1239366.96, 0, 684913.32, 554453.64, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:18:06', '2025-09-13 15:18:06', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(22, '1', 297, NULL, 163, 1, NULL, NULL, 684913.32, 'قيد رصيد افتتاحي (تسجيل أول مرة) (مقابل بنك الراجحى)', 0, 684913.32, -1239366.96, 684913.32, 0, -554453.64, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:18:06', '2025-09-13 15:18:06', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(23, '1', 151, NULL, 163, 1, NULL, NULL, 684913.32, 'قيد رصيد افتتاحي (تسجيل أول مرة)', 684913.32, 0, 1369826.64, 0, 684913.32, 684913.32, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:18:31', '2025-09-13 15:18:31', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(24, '1', 297, NULL, 163, 1, NULL, NULL, 684913.32, 'قيد رصيد افتتاحي (تسجيل أول مرة) (مقابل بنك الراجحى)', 0, 684913.32, -1924280.28, 684913.32, 0, -1239366.96, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:18:31', '2025-09-13 15:18:31', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(25, '1', 151, NULL, 163, 1, NULL, NULL, 100, 'قيد رصيد افتتاحي (تسجيل أول مرة)', 100, 0, 685013.32, 0, 100, 684913.32, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:18:47', '2025-09-13 15:18:47', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(26, '1', 297, NULL, 163, 1, NULL, NULL, 100, 'قيد رصيد افتتاحي (تسجيل أول مرة) (مقابل بنك الراجحى)', 0, 100, -1924380.28, 100, 0, -1924280.28, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:18:47', '2025-09-13 15:18:47', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(27, 'Journal', 151, NULL, 163, 1, NULL, NULL, 0.1, 'تست', 0, 0.1, 99.9, 0, 0, 100, '0', '2025-09-13', NULL, NULL, NULL, NULL, '2025-09-13 15:40:13', '2025-09-13 16:01:53', '2025-09-13 16:01:53', 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 7),
(28, 'Journal', 151, NULL, 163, 1, NULL, NULL, 0.1, 'تست', 0.1, 0, 100, 0, 0, 99.9, '0', '2025-09-13', NULL, NULL, NULL, NULL, '2025-09-13 15:40:13', '2025-09-13 16:01:53', '2025-09-13 16:01:53', 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 8),
(29, '1', 151, NULL, 160, 1, NULL, NULL, 16307.46, 'قيد رصيد افتتاحي (تسجيل أول مرة)', 0, 16307.46, -16207.46, 16307.46, 0, 100, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:59:09', '2025-09-13 15:59:09', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(30, '1', 297, NULL, 160, 1, NULL, NULL, 16307.46, 'قيد رصيد افتتاحي (تسجيل أول مرة) (مقابل بنك الراجحى)', 16307.46, 0, -1908072.82, 0, 16307.46, -1924380.28, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-09-13 15:59:09', '2025-09-13 15:59:09', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(31, 'Journal', 151, NULL, 160, 1, NULL, NULL, 39218.41, 'حوالة ايراد مساند', 39218.41, 0, 22910.95, 0, 0, -16307.46, '0', '2025-11-01', NULL, NULL, NULL, NULL, '2025-11-12 03:06:22', '2025-11-12 03:09:14', '2025-11-12 03:09:14', 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 9),
(32, 'Journal', 364, NULL, 160, 1, NULL, NULL, 39218.41, 'حوالة ايراد مساند', 0, 39218.41, -39218.41, 0, 0, 0, '0', '2025-11-01', NULL, NULL, NULL, NULL, '2025-11-12 03:06:22', '2025-11-12 03:09:14', '2025-11-12 03:09:14', 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 10),
(33, 'Journal', 151, NULL, 160, 1, NULL, NULL, 39218.41, 'حوالة ايراد مساند', 39218.41, 0, 62129.36, 0, 0, 22910.95, '0', '2025-01-10', NULL, NULL, NULL, NULL, '2025-11-12 03:10:06', '2025-11-12 03:10:06', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 11),
(34, 'Journal', 364, NULL, 160, 1, NULL, NULL, 39218.41, 'حوالة ايراد مساند', 0, 39218.41, -78436.82, 0, 0, -39218.41, '0', '2025-01-10', NULL, NULL, NULL, NULL, '2025-11-12 03:10:06', '2025-11-12 03:10:06', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 12),
(35, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1500, 'ايراد من الاستقدام عوض', 1500, 0, 63629.36, 0, 0, 62129.36, '0', '2025-01-10', NULL, NULL, NULL, NULL, '2025-11-12 03:12:46', '2025-11-12 03:12:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 13),
(36, 'Journal', 304, NULL, 160, 1, NULL, NULL, 1500, 'ايراد من الاستقدام عوض', 0, 1500, -1500, 0, 0, 0, '0', '2025-01-10', NULL, NULL, NULL, NULL, '2025-11-12 03:12:46', '2025-11-12 03:12:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 14),
(37, 'Journal', 365, NULL, 160, 1, 19, NULL, 439, 'ياسمين علي هادي - استلام سلسك - رسوم استلام عاملة هدي احمد عطيه بجازان 200 اتعاب المندوب + 239 قيمة التذكرة', 439, 0, 439, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 15),
(38, 'Journal', 151, NULL, 160, 1, 19, NULL, 439, 'ياسمين علي هادي - استلام سلسك - رسوم استلام عاملة هدي احمد عطيه بجازان 200 اتعاب المندوب + 239 قيمة التذكرة', 0, 439, 63190.36, 0, 0, 63629.36, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 16),
(39, 'Journal', 337, NULL, 160, 1, 20, NULL, 46, 'ﺧﻠﻴﻞ شويعي - شراء حبارة لطابعه الحسابات', 46, 0, 46, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 17),
(40, 'Journal', 151, NULL, 160, 1, 20, NULL, 46, 'ﺧﻠﻴﻞ شويعي - شراء حبارة لطابعه الحسابات', 0, 46, 63144.36, 0, 0, 63190.36, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 18),
(41, 'Journal', 349, NULL, 160, 1, 20, NULL, 0.58, 'عمولات بنكية', 0.58, 0, 0.58, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 19),
(42, 'Journal', 151, NULL, 160, 1, NULL, NULL, 0.58, 'عمولات بنكية', 0, 0.58, 63143.78, 0, 0, 63144.36, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:34:44', '2025-11-12 03:34:44', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 20),
(43, 'Journal', 338, NULL, 160, 1, 19, NULL, 287.5, 'شحن نت سكن العاملات مكتب المتميز 287.5 ريال', 287.5, 0, 287.5, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:35:59', '2025-11-12 03:35:59', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 21),
(44, 'Journal', 151, NULL, 160, 1, NULL, NULL, 287.5, 'شحن نت سكن العاملات مكتب المتميز 287.5 ريال', 0, 287.5, 62856.28, 0, 0, 63143.78, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:35:59', '2025-11-12 03:35:59', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 22),
(45, 'Journal', 181, NULL, 160, 1, 18, NULL, 137, 'ابوفواز - ارسال عامله من الحفر الي الرياض -اثيوبيا عاملة ملاك محمد الشمري', 137, 0, 137, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 23),
(46, 'Journal', 365, NULL, 160, 1, 18, NULL, 700, 'ابوفواز - مندوب الدمام - استلام 6 اثيوبيا 300 ريال+ 1سريلانكا 100 ريال +1 بنجلادش 100 ريال+2 اوغندا 200 ريال -الإجمالي 700 ريال', 700, 0, 1139, 0, 0, 439, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 24),
(47, 'Journal', 365, NULL, 160, 1, 18, NULL, 800, 'ابوفواز - مندوب الدمام - استلام 12 اثيوبيا 800 ريال إيواء + ترحيل العدد زياده + محمد اخد 14 عامله وخليل اخد 5 للرياض', 800, 0, 1939, 0, 0, 1139, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 25),
(48, 'Journal', 334, NULL, 160, 1, 18, NULL, 160, 'ابوفواز - اعاشة السكن 160 ريال شراء رز لسكن العاملات', 160, 0, 160, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 26),
(49, 'Journal', 305, NULL, 160, 1, 20, NULL, 1400, 'ابوفواز - راتب سومي عاملة كينيا عند ابوسلطان', 1400, 0, 1400, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 27),
(50, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3197, 'مصروفات فرع حفر الباطن حولت الى حساب ابوفواز - مجمع', 0, 3197, 59659.28, 0, 0, 62856.28, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:40:05', '2025-11-12 03:40:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 28),
(51, 'Journal', 367, NULL, 160, 1, 18, NULL, 1589, 'بدريه خيران عيفان الرشيدي - مطالبة مالية - تمت المفاهمه مع العميل ومستمر معنا وتخصم الغرامة علي مكتب سنترال بنجلادش', 1589, 0, 1589, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 29),
(52, 'Journal', 341, NULL, 160, 1, 19, NULL, 2520, 'مندوبة الفلبين ANALYN FISHER - ادخال 9 عقود للبولو1متميز +5 امتياز+3 انجاز (هيا الرويلي+حمود العنزي+غاده الجميعه+عبدالرحمن الشمري+وليد العتيبي+خديجه فضائلي+عبدالله آل سعود+سعيد القرني+الجازي الحربي)', 2520, 0, 2520, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 30),
(53, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1589, 'بدريه خيران عيفان الرشيدي - مطالبة مالية - تمت المفاهمه مع العميل ومستمر معنا وتخصم الغرامة علي مكتب سنترال بنجلادش', 0, 1589, 58070.28, 0, 0, 59659.28, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 31),
(54, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2520, 'مندوبة الفلبين ANALYN FISHER - ادخال 9 عقود للبولو1متميز +5 امتياز+3 انجاز (هيا الرويلي+حمود العنزي+غاده الجميعه+عبدالرحمن الشمري+وليد العتيبي+خديجه فضائلي+عبدالله آل سعود+سعيد القرني+الجازي الحربي)', 0, 2520, 55550.28, 0, 0, 58070.28, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:42:58', '2025-11-12 03:42:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 32),
(55, 'Journal', 365, NULL, 160, 1, 19, NULL, 950, 'ابوصقر - استلام 23 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر', 950, 0, 2889, 0, 0, 1939, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 33),
(56, 'Journal', 366, NULL, 160, 1, 19, NULL, 850, 'ابوصقر- تذكرة عاملة خلود علي احمد حكمي - تم خصم التذكرة علي خليل شويعي لانه نسي جواز العاملة في السكن وتاخر عن ميعاد الرحلة', 850, 0, 850, 0, 0, 0, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 34),
(57, 'Journal', 365, NULL, 160, 1, 19, NULL, 316, 'ابوصقر -تحويل رسوم استلام عاملات من شركة سلسك الدمام+ تذكرة نقل - هياء محمد نايف الهاجري', 316, 0, 3205, 0, 0, 2889, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 35),
(58, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2116, 'تحويل ابوصقر مصروفات فرع عرعر بتاريخ 1 / 10 / 2025 م\r\nابوصقر - استلام 23 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر\r\nابوصقر- تذكرة عاملة خلود علي احمد حكمي - تم خصم التذكرة علي خليل شويعي لانه نسي جواز العاملة في السكن وتاخر عن ميعاد الرحلة\r\nا', 0, 2116, 53434.28, 0, 0, 55550.28, '0', '2025-10-01', NULL, NULL, NULL, NULL, '2025-11-12 03:46:53', '2025-11-12 03:46:53', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 36),
(59, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3500, 'ايراد من العميل فيصل', 3500, 0, 56934.28, 0, 0, 53434.28, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 37),
(60, 'Journal', 151, NULL, 160, 1, NULL, NULL, 34968.1, 'دفعة من مساند', 34968.1, 0, 91902.38, 0, 0, 56934.28, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 38),
(61, 'Journal', 151, NULL, 160, 1, NULL, NULL, 500, 'ايراد من العميل خلف', 500, 0, 92402.38, 0, 0, 91902.38, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 39),
(62, 'Journal', 304, NULL, 160, 1, NULL, NULL, 3500, 'ايراد من العميل فيصل', 0, 3500, -5000, 0, 0, -1500, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 40),
(63, 'Journal', 364, NULL, 160, 1, NULL, NULL, 34968.1, 'دفعة من مساند', 0, 34968.1, -113404.92, 0, 0, -78436.82, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 41),
(64, 'Journal', 304, NULL, 160, 1, NULL, NULL, 500, 'ايراد من العميل فيصل', 0, 500, -5500, 0, 0, -5000, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:50:10', '2025-11-12 03:50:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 42),
(65, 'Journal', 306, NULL, 160, 1, NULL, NULL, 2000, 'عهدة البطاقة الائتمانية رقم 151', 2000, 0, 2000, 0, 0, 0, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:51:57', '2025-11-12 03:51:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 43),
(66, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة البطاقة الائتمانية رقم 151', 0, 2000, 90402.38, 0, 0, 92402.38, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:51:57', '2025-11-12 03:51:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 44),
(67, 'Journal', 176, NULL, 160, 1, 20, NULL, 4249.85, 'فيصل قاسم بن محمد العنزي - سداد مساند - العميل مسدد 3500 ريال خصم خاص من ابوسلطان', 4249.85, 0, 4249.85, 0, 0, 0, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:53:10', '2025-11-12 03:53:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 45),
(68, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4249.85, 'فيصل قاسم بن محمد العنزي - سداد مساند - العميل مسدد 3500 ريال خصم خاص من ابوسلطان', 0, 4249.85, 86152.53, 0, 0, 90402.38, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:53:10', '2025-11-12 03:53:10', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 46),
(69, 'Journal', 342, NULL, 160, 1, 20, NULL, 600, 'فيصل سالم سعيد القثمي - سداد الإقامة - العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', 600, 0, 600, 0, 0, 0, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 47),
(70, 'Journal', 151, NULL, 160, 1, NULL, NULL, 600, 'فيصل سالم سعيد القثمي - سداد الإقامة - العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', 0, 600, 85552.53, 0, 0, 86152.53, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 48),
(71, 'Journal', 179, NULL, 160, 1, 18, NULL, 90, 'نور الدين  - فحص طبي - عاملة فيصل سالم سعيد القثمي العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', 90, 0, 90, 0, 0, 0, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 49),
(72, 'Journal', 151, NULL, 160, 1, NULL, NULL, 90, 'نور الدين  - فحص طبي - عاملة فيصل سالم سعيد القثمي العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل', 0, 90, 85462.53, 0, 0, 85552.53, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 50),
(73, 'Journal', 185, NULL, 160, 1, 20, NULL, 4000, 'سلفة ابواسيل تخصم من شهر اكتوبر 2025 م', 4000, 0, 4000, 0, 0, 0, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 51),
(74, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4000, 'سلفة ابواسيل تخصم من شهر اكتوبر 2025 م', 0, 4000, 81462.53, 0, 0, 85462.53, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 52),
(75, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'رسوم وعمولات بنكية', 1.15, 0, 1.73, 0, 0, 0.58, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 53),
(76, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية', 0, 1.15, 81461.38, 0, 0, 81462.53, '0', '2025-10-02', NULL, NULL, NULL, NULL, '2025-11-12 03:56:35', '2025-11-12 03:56:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 54),
(77, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5000, 'ايراد من العميلة غادة راشد', 5000, 0, 86461.38, 0, 0, 81461.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 03:57:39', '2025-11-12 03:57:39', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 55),
(78, 'Journal', 304, NULL, 160, 1, NULL, NULL, 5000, 'ايراد من العميلة غادة راشد', 0, 5000, -10500, 0, 0, -5500, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 03:57:39', '2025-11-12 03:57:39', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 56),
(79, 'Journal', 311, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 0236', 2000, 0, 2000, 0, 0, 0, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 57),
(80, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 0236', 0, 2000, 84461.38, 0, 0, 86461.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 58),
(81, 'Journal', 310, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9726', 2000, 0, 2000, 0, 0, 0, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 59),
(82, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9726', 0, 2000, 82461.38, 0, 0, 84461.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:00:19', '2025-11-12 04:00:19', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 60),
(83, 'Journal', 338, NULL, 160, 1, 18, NULL, 200, 'ابوفيصل - سداد فاتورة جوال المكتب', 200, 0, 487.5, 0, 0, 287.5, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 61),
(84, 'Journal', 151, NULL, 160, 1, NULL, NULL, 200, 'ابوفيصل - سداد فاتورة جوال المكتب', 0, 200, 82261.38, 0, 0, 82461.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 62),
(85, 'Journal', 338, NULL, 160, 1, 18, NULL, 65, 'نور الدين - شراء ذاكرة تخزين خارجية لسنترال للكول سنتر بالحفر 65 ريال', 65, 0, 552.5, 0, 0, 487.5, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 63),
(86, 'Journal', 151, NULL, 160, 1, NULL, NULL, 65, 'نور الدين - شراء ذاكرة تخزين خارجية لسنترال للكول سنتر بالحفر 65 ريال', 0, 65, 82196.38, 0, 0, 82261.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 64),
(87, 'Journal', 347, NULL, 160, 1, 20, NULL, 2500, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل 24-09', 2500, 0, 2500, 0, 0, 0, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 65),
(88, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2500, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل 24-09', 0, 2500, 79696.38, 0, 0, 82196.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 66),
(89, 'Journal', 331, NULL, 160, 1, 18, NULL, 5600, 'سعود عسكر - سداد ايجار مكتب انجاز +ملحق الموظفين', 5600, 0, 5600, 0, 0, 0, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 67),
(90, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5600, 'سعود عسكر - سداد ايجار مكتب انجاز +ملحق الموظفين', 0, 5600, 74096.38, 0, 0, 79696.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 68),
(91, 'Journal', 301, NULL, 160, 1, NULL, NULL, 2700, 'سعود عسكر - سداد ايجار 3 محلات حدود الذكاء', 2700, 0, 2700, 0, 0, 0, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 69),
(92, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2700, 'سعود عسكر - سداد ايجار 3 محلات حدود الذكاء', 0, 2700, 71396.38, 0, 0, 74096.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 70),
(93, 'Journal', 338, NULL, 160, 1, 16, NULL, 1188.33, 'سداد فاتورة نت مكتب الامتياز', 1188.33, 0, 1740.83, 0, 0, 552.5, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 71),
(94, 'Journal', 151, NULL, 160, 1, NULL, NULL, 383.33, 'سداد فاتورة نت مكتب الامتياز', 0, 383.33, 71013.05, 0, 0, 71396.38, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 72),
(95, 'Journal', 151, NULL, 160, 1, NULL, NULL, 805, 'سداد فاتورة نت مكتب الامتياز', 0, 805, 70208.05, 0, 0, 71013.05, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 73),
(96, 'Journal', 338, NULL, 160, 1, 16, NULL, 383.94, 'مصطفي - سداد فاتورة ال 4 جوالات ب اسم الشركة (مصطفي + محمود + 2 جوال استقبال )', 383.94, 0, 2124.77, 0, 0, 1740.83, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 74),
(97, 'Journal', 151, NULL, 160, 1, NULL, NULL, 383.94, 'مصطفي - سداد فاتورة ال 4 جوالات ب اسم الشركة (مصطفي + محمود + 2 جوال استقبال )', 0, 383.94, 69824.11, 0, 0, 70208.05, '0', '2025-10-05', NULL, NULL, NULL, NULL, '2025-11-12 04:08:50', '2025-11-12 04:08:50', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 75),
(98, 'Journal', 151, NULL, 160, 1, NULL, NULL, 85889.88, 'دفعة من مساند', 85889.88, 0, 155713.99, 0, 0, 69824.11, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 76),
(99, 'Journal', 364, NULL, 160, 1, NULL, NULL, 85889.88, 'دفعة من مساند', 0, 85889.88, -199294.8, 0, 0, -113404.92, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 77),
(100, 'Journal', 155, NULL, 160, 1, NULL, NULL, 10000, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 10000, 0, 10000, 0, 0, 0, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 78),
(101, 'Journal', 155, NULL, 160, 1, NULL, NULL, 18270, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 18270, 0, 28270, 0, 0, 10000, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 79),
(102, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 2.88, 0, 0, 1.73, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 80),
(103, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 4.03, 0, 0, 2.88, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 81),
(104, 'Journal', 151, NULL, 160, 1, NULL, NULL, 10000, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 0, 10000, 145713.99, 0, 0, 155713.99, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 82),
(105, 'Journal', 151, NULL, 160, 1, NULL, NULL, 18270, 'حوالة دعم مصرف الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 0, 18270, 127443.99, 0, 0, 145713.99, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 83),
(106, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 127442.84, 0, 0, 127443.99, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 84),
(107, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 127441.69, 0, 0, 127442.84, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 85),
(108, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1000, 'ايراد من العميل نواف محمد العنزى', 1000, 0, 128441.69, 0, 0, 127441.69, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 86),
(109, 'Journal', 304, NULL, 160, 1, NULL, NULL, 1000, 'ايراد من العميل نواف محمد العنزى', 0, 1000, -11500, 0, 0, -10500, '0', '2025-10-06', NULL, NULL, NULL, NULL, '2025-11-12 04:14:05', '2025-11-12 04:14:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 87),
(110, 'Journal', 151, NULL, 160, 1, NULL, NULL, 52356.39, 'دفعة من مساند', 52356.39, 0, 180798.08, 0, 0, 128441.69, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:16:32', '2025-11-12 04:16:32', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 88),
(111, 'Journal', 364, NULL, 160, 1, NULL, NULL, 52356.39, 'دفعة من مساند', 0, 52356.39, -251651.19, 0, 0, -199294.8, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:16:32', '2025-11-12 04:16:32', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 89),
(112, 'Journal', 370, NULL, 160, 1, NULL, NULL, 35000, 'عياس العيسي - تحويل مبلغ 35000 من مبلغ التقبيل مكتب الامتياز فرع الربوه متبقي نصف المبلغ', 35000, 0, 35000, 0, 0, 0, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 90),
(113, 'Journal', 151, NULL, 160, 1, NULL, NULL, 35000, 'عياس العيسي - تحويل مبلغ 35000 من مبلغ التقبيل مكتب الامتياز فرع الربوه متبقي نصف المبلغ', 0, 35000, 145798.08, 0, 0, 180798.08, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 91),
(114, 'Journal', 349, NULL, 160, 1, 20, NULL, 8.05, 'عمولات بنكية', 8.05, 0, 12.08, 0, 0, 4.03, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 92),
(115, 'Journal', 151, NULL, 160, 1, NULL, NULL, 8.05, 'عمولات بنكية', 0, 8.05, 145790.03, 0, 0, 145798.08, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 93),
(116, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'ايراد من العميل خالد صالح حمود', 2000, 0, 147790.03, 0, 0, 145790.03, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 94),
(117, 'Journal', 304, NULL, 160, 1, NULL, NULL, 2000, 'ايراد من العميل خالد صالح حمود', 0, 2000, -13500, 0, 0, -11500, '0', '2025-10-07', NULL, NULL, NULL, NULL, '2025-11-12 04:21:07', '2025-11-12 04:21:07', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 95),
(118, 'Journal', 151, NULL, 160, 1, NULL, NULL, 60822.28, 'دفعة من مساند', 60822.28, 0, 208612.31, 0, 0, 147790.03, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 96),
(119, 'Journal', 364, NULL, 160, 1, NULL, NULL, 60822.28, 'دفعة من مساند', 0, 60822.28, -312473.47, 0, 0, -251651.19, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 97),
(120, 'Journal', 307, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151', 2000, 0, 2000, 0, 0, 0, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 98),
(121, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151', 0, 2000, 206612.31, 0, 0, 208612.31, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 99),
(122, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1000, 'استرداد مدفوعات سداد حكومية', 1000, 0, 207612.31, 0, 0, 206612.31, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 100),
(123, 'Journal', 304, NULL, 160, 1, NULL, NULL, 1000, 'استرداد مدفوعات سداد حكومية', 0, 1000, -14500, 0, 0, -13500, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:26:18', '2025-11-12 04:26:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 101),
(124, 'Journal', 367, NULL, 160, 1, 16, NULL, 2090.95, 'راكان نوار محمد المطيري - مطالبة مالية رجالية علي يوزر الامتياز', 2090.95, 0, 3679.95, 0, 0, 1589, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 102),
(125, 'Journal', 151, NULL, 160, 1, 15, NULL, 2090.95, 'راكان نوار محمد المطيري - مطالبة مالية رجالية علي يوزر الامتياز', 0, 2090.95, 205521.36, 0, 0, 207612.31, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 103),
(126, 'Journal', 367, NULL, 160, 1, 18, NULL, 3611.85, 'نوره عطاالله محمد المطيري - مطالبة مالية - العميل الغي العقد العاملة منسحبه وتم خصم الغرامة علي العميل', 3611.85, 0, 7291.8, 0, 0, 3679.95, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 104),
(127, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3611.85, 'نوره عطاالله محمد المطيري - مطالبة مالية - العميل الغي العقد العاملة منسحبه وتم خصم الغرامة علي العميل', 0, 3611.85, 201909.51, 0, 0, 205521.36, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:35:28', '2025-11-12 04:35:28', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 105),
(128, 'Journal', 368, NULL, 160, 1, 16, NULL, 840, 'مندوبة الفلبين ANALYN FISHER - ادخال 3 عقود للبولو2 امتياز+1 انجاز (نايف السيف+محمد سلمان+منال الحميد)', 840, 0, 840, 0, 0, 0, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 106),
(129, 'Journal', 151, NULL, 160, 1, NULL, NULL, 840, 'مندوبة الفلبين ANALYN FISHER - ادخال 3 عقود للبولو2 امتياز+1 انجاز (نايف السيف+محمد سلمان+منال الحميد)', 0, 840, 201069.51, 0, 0, 201909.51, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 107),
(130, 'Journal', 365, NULL, 160, 1, 16, NULL, 167, 'اسامه - استلام سلسك - رسوم استلام عاملة بشركة سلسك عاملة ناصر مجري المطيري', 167, 0, 3372, 0, 0, 3205, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 108),
(131, 'Journal', 151, NULL, 160, 1, NULL, NULL, 167, 'اسامه - استلام سلسك - رسوم استلام عاملة بشركة سلسك عاملة ناصر مجري المطيري', 0, 167, 200902.51, 0, 0, 201069.51, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 109),
(132, 'Journal', 367, NULL, 160, 1, 19, NULL, 12683, 'خلود مفضي ربيعان العنزي - استرجاع تسفير - تم خصم العاملة + التذكرة من مكتب ورلد اير سريلانكا وتم خصم مده العمل', 12683, 0, 19974.8, 0, 0, 7291.8, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 110),
(133, 'Journal', 151, NULL, 160, 1, NULL, NULL, 12683, 'خلود مفضي ربيعان العنزي - استرجاع تسفير - تم خصم العاملة + التذكرة من مكتب ورلد اير سريلانكا وتم خصم مده العمل', 0, 12683, 188219.51, 0, 0, 200902.51, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 111),
(134, 'Journal', 305, NULL, 160, 1, NULL, NULL, 500, 'فيصل ﻗﺎﻃﻊ العنزي تحويل 500 ﺭﻳﺎﻝ ﺣﺴﺐ ﺗﻮﺟﻴﻬﺎﺕ ﺍﺑﻮﺳﻠﻄﺎﻥ', 500, 0, 1900, 0, 0, 1400, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 112),
(135, 'Journal', 151, NULL, 160, 1, NULL, NULL, 500, 'فيصل ﻗﺎﻃﻊ العنزي تحويل 500 ﺭﻳﺎﻝ ﺣﺴﺐ ﺗﻮﺟﻴﻬﺎﺕ ﺍﺑﻮﺳﻠﻄﺎﻥ', 0, 500, 187719.51, 0, 0, 188219.51, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 113),
(136, 'Journal', 349, NULL, 160, 1, 20, NULL, 0.58, 'رسوم وعمولات بنكية', 0.58, 0, 12.66, 0, 0, 12.08, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 114),
(137, 'Journal', 151, NULL, 160, 1, NULL, NULL, 0.58, 'رسوم وعمولات بنكية', 0, 0.58, 187718.93, 0, 0, 187719.51, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 115),
(138, 'Journal', 371, NULL, 160, 1, NULL, NULL, 485, 'خليل شويعي - عهده باركينج المطار + غاز السكن + مياه لسكن العاملات حسب توجيه ابوفيصل', 485, 0, 485, 0, 0, 0, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:54', '2025-11-12 04:41:54', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 116),
(139, 'Journal', 151, NULL, 160, 1, NULL, NULL, 485, 'خليل شويعي - عهده باركينج المطار + غاز السكن + مياه لسكن العاملات حسب توجيه ابوفيصل', 0, 485, 187233.93, 0, 0, 187718.93, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:55', '2025-11-12 04:41:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 117),
(140, 'Journal', 349, NULL, 160, 1, 20, NULL, 0.58, 'رسوم وعمولات بنكية', 0.58, 0, 13.24, 0, 0, 12.66, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:55', '2025-11-12 04:41:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 118),
(141, 'Journal', 151, NULL, 160, 1, NULL, NULL, 0.58, 'رسوم وعمولات بنكية', 0, 0.58, 187233.35, 0, 0, 187233.93, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:41:55', '2025-11-12 04:41:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 119),
(142, 'Journal', 185, NULL, 160, 1, 19, NULL, 91000, 'رواتب مكتب الإنجاز شهر سبتمبر', 91000, 0, 95000, 0, 0, 4000, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 120),
(143, 'Journal', 185, NULL, 160, 1, 16, NULL, 49400, 'رواتب مكتب الامتياز شهر سبتمبر', 49400, 0, 144400, 0, 0, 95000, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 121),
(144, 'Journal', 185, NULL, 160, 1, 19, NULL, 19300, 'رواتب مكتب المتميز شهر سبتمبر', 19300, 0, 163700, 0, 0, 144400, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 122),
(145, 'Journal', 301, NULL, 160, 1, NULL, NULL, 9500, 'رواتب وكالة حدود الذكاء شهر سبتمبر', 9500, 0, 12200, 0, 0, 2700, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 123),
(146, 'Journal', 302, NULL, 160, 1, NULL, NULL, 4000, 'رواتب 2 عمال تبع ابورنا + 1 عامل طرف ابوسلطان وبيتم استرجاع المبلغ بعد التحويل', 4000, 0, 4000, 0, 0, 0, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 124),
(147, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4000, 'سداد مرتبات شهر 9 / 2025 م', 0, 4000, 183233.35, 0, 0, 187233.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 125),
(148, 'Journal', 151, NULL, 160, 1, NULL, NULL, 36500, 'سداد مرتبات شهر 9 / 2025 م', 0, 36500, 146733.35, 0, 0, 183233.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 126),
(149, 'Journal', 151, NULL, 160, 1, NULL, NULL, 15950, 'سداد مرتبات شهر 9 / 2025 م', 0, 15950, 130783.35, 0, 0, 146733.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 127),
(150, 'Journal', 151, NULL, 160, 1, NULL, NULL, 10000, 'سداد مرتبات شهر 9 / 2025 م', 0, 10000, 120783.35, 0, 0, 130783.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 128),
(151, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4500, 'سداد مرتبات شهر 9 / 2025 م', 0, 4500, 116283.35, 0, 0, 120783.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 129),
(152, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4500, 'سداد مرتبات شهر 9 / 2025 م', 0, 4500, 111783.35, 0, 0, 116283.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 130),
(153, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2800, 'سداد مرتبات شهر 9 / 2025 م', 0, 2800, 108983.35, 0, 0, 111783.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 131),
(154, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'سداد مرتبات شهر 9 / 2025 م', 0, 2000, 106983.35, 0, 0, 108983.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 132),
(155, 'Journal', 151, NULL, 160, 1, NULL, NULL, 6550, 'سداد مرتبات شهر 9 / 2025 م', 0, 6550, 100433.35, 0, 0, 106983.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 133),
(156, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3600, 'سداد مرتبات شهر 9 / 2025 م', 0, 3600, 96833.35, 0, 0, 100433.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 134),
(157, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'سداد مرتبات شهر 9 / 2025 م', 0, 2000, 94833.35, 0, 0, 96833.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 135),
(158, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4500, 'سداد مرتبات شهر 9 / 2025 م', 0, 4500, 90333.35, 0, 0, 94833.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 136),
(159, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1500, 'سداد مرتبات شهر 9 / 2025 م', 0, 1500, 88833.35, 0, 0, 90333.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 137),
(160, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4500, 'سداد مرتبات شهر 9 / 2025 م', 0, 4500, 84333.35, 0, 0, 88833.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 138),
(161, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1500, 'سداد مرتبات شهر 9 / 2025 م', 0, 1500, 82833.35, 0, 0, 84333.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 139),
(162, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4000, 'سداد مرتبات شهر 9 / 2025 م', 0, 4000, 78833.35, 0, 0, 82833.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 140),
(163, 'Journal', 151, NULL, 160, 1, NULL, NULL, 58300, 'سداد مرتبات شهر 9 / 2025 م', 0, 58300, 20533.35, 0, 0, 78833.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 141),
(164, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1500, 'سداد مرتبات شهر 9 / 2025 م', 0, 1500, 19033.35, 0, 0, 20533.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 142),
(165, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5000, 'سداد مرتبات شهر 9 / 2025 م', 0, 5000, 14033.35, 0, 0, 19033.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 143);
INSERT INTO `transections` (`id`, `tran_type`, `account_id`, `account_id_to`, `seller_id`, `branch_id`, `cost_id`, `cost_id_to`, `amount`, `description`, `debit`, `credit`, `balance`, `credit_account`, `debit_account`, `balance_account`, `balance_customer`, `date`, `end_date`, `customer_id`, `supplier_id`, `order_id`, `created_at`, `updated_at`, `deleted_at`, `company_id`, `asset_id`, `expense_id`, `tax`, `fixed_type`, `img`, `active`, `cash`, `name`, `tax_number`, `tax_id`, `is_reversal`, `salary_id`, `journal_entry_detail_id`) VALUES
(166, 'Journal', 349, NULL, 160, 1, 20, NULL, 48.3, 'رسوم وعمولات بنكية تحويلات المرتبات', 48.3, 0, 61.54, 0, 0, 13.24, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 144),
(167, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 1.15, 14032.2, 0, 0, 14033.35, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 145),
(168, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 1.15, 14031.05, 0, 0, 14032.2, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 146),
(169, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 1.15, 14029.9, 0, 0, 14031.05, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 147),
(170, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 1.15, 14028.75, 0, 0, 14029.9, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 148),
(171, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 1.15, 14027.6, 0, 0, 14028.75, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 149),
(172, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 1.15, 14026.45, 0, 0, 14027.6, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 150),
(173, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 1.15, 14025.3, 0, 0, 14026.45, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 151),
(174, 'Journal', 151, NULL, 160, 1, NULL, NULL, 40.25, 'رسوم وعمولات بنكية تحويلات المرتبات', 0, 40.25, 13985.05, 0, 0, 14025.3, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:54:49', '2025-11-12 04:54:49', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 152),
(175, 'Journal', 206, NULL, 160, 1, 20, NULL, 5000, 'سداد دراسة الجدوى ترخيص مكتب العمل - يوسف سداد بطاقة ائتمانية 7808', 5000, 0, 5000, 0, 0, 0, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:56:25', '2025-11-12 04:56:25', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 153),
(176, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5000, 'سداد دراسة الجدوى ترخيص مكتب العمل - يوسف سداد بطاقة ائتمانية 7808', 0, 5000, 8985.05, 0, 0, 13985.05, '0', '2025-10-08', NULL, NULL, NULL, NULL, '2025-11-12 04:56:25', '2025-11-12 04:56:25', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 154),
(177, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2500, 'استرداد من الموظفة نجلاء', 2500, 0, 11485.05, 0, 0, 8985.05, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 155),
(178, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5000, 'استرداد من الموظفة مى - ريم', 5000, 0, 16485.05, 0, 0, 11485.05, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 156),
(179, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2500, 'استرداد من الموظفة امل', 2500, 0, 18985.05, 0, 0, 16485.05, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 157),
(180, 'Journal', 151, NULL, 160, 1, NULL, NULL, 71954.73, 'دفعة من مساند', 71954.73, 0, 90939.78, 0, 0, 18985.05, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 158),
(181, 'Journal', 151, NULL, 160, 1, NULL, NULL, 600, 'استرداد من فيصل', 600, 0, 91539.78, 0, 0, 90939.78, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 159),
(182, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2500, 'استرداد من خالد', 2500, 0, 94039.78, 0, 0, 91539.78, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 160),
(183, 'Journal', 364, NULL, 160, 1, NULL, NULL, 71954.73, 'دفعة من مساند', 0, 71954.73, -384428.2, 0, 0, -312473.47, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 161),
(184, 'Journal', 372, NULL, 160, 1, NULL, NULL, 13100, 'استرداد مرتبات شهر 9 2025 م', 0, 13100, -13100, 0, 0, 0, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 05:50:37', '2025-11-12 05:50:37', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 162),
(185, 'Journal', 339, NULL, 160, 1, 20, NULL, 1944.17, 'تامينات مؤسسة سلطان', 1944.17, 0, 1944.17, 0, 0, 0, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 163),
(186, 'Journal', 301, NULL, 160, 1, NULL, NULL, 1836.67, 'تامينات حدود الذكاء', 1836.67, 0, 14036.67, 0, 0, 12200, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 164),
(187, 'Journal', 302, NULL, 160, 1, NULL, NULL, 2112.73, 'تامينات ليان وان', 2112.73, 0, 6112.73, 0, 0, 4000, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 165),
(188, 'Journal', 339, NULL, 160, 1, 16, NULL, 5889.83, 'تامينات الامتياز', 5889.83, 0, 7834, 0, 0, 1944.17, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 166),
(189, 'Journal', 339, NULL, 160, 1, 18, NULL, 61.6, 'تامينات الإنجاز', 61.6, 0, 7895.6, 0, 0, 7834, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 167),
(190, 'Journal', 335, NULL, 160, 1, 16, NULL, 1626.46, 'سداد كهرباء سكن الرياض', 1626.46, 0, 1626.46, 0, 0, 0, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 168),
(191, 'Journal', 343, NULL, 160, 1, 19, NULL, 4000, 'ماجد الحميدي - سداد نقل الكفالة 4000 ريال نقل كفالة', 4000, 0, 4000, 0, 0, 0, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 169),
(192, 'Journal', 185, NULL, 160, 1, 16, NULL, 599, 'عمران - 300 ريال باقي الراتب + 299 ريال فواتير علاج ل رنا اخوه', 599, 0, 164299, 0, 0, 163700, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 170),
(193, 'Journal', 367, NULL, 160, 1, 16, NULL, 2185.95, 'بندر عوض حامد الثمالي - مطالبة مالية رجالية علي يوزر الامتياز', 2185.95, 0, 22160.75, 0, 0, 19974.8, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 171),
(194, 'Journal', 155, NULL, 160, 1, NULL, NULL, 5446.8, 'دعم مصرف الانماء سداد فاتورة مكتب كريستال اوغندا', 5446.8, 0, 33716.8, 0, 0, 28270, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 172),
(195, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 62.69, 0, 0, 61.54, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 173),
(196, 'Journal', 155, NULL, 160, 1, NULL, NULL, 3750, 'دعم مصرف الانماء سداد انجاز 1000 دولار مكتب قولدن سيزون', 3750, 0, 37466.8, 0, 0, 33716.8, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 174),
(197, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 63.84, 0, 0, 62.69, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 175),
(198, 'Journal', 342, NULL, 160, 1, 20, NULL, 600, 'مها عواد العنزي - سداد الإقامة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', 600, 0, 1200, 0, 0, 600, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 176),
(199, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1944.17, 'تامينات مؤسسة سلطان', 0, 1944.17, 92095.61, 0, 0, 94039.78, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 177),
(200, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1836.67, 'تامينات حدود الذكاء', 0, 1836.67, 90258.94, 0, 0, 92095.61, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 178),
(201, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2112.73, 'تامينات ليان وان', 0, 2112.73, 88146.21, 0, 0, 90258.94, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 179),
(202, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5889.83, 'تامينات الامتياز', 0, 5889.83, 82256.38, 0, 0, 88146.21, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 180),
(203, 'Journal', 151, NULL, 160, 1, NULL, NULL, 61.6, 'تامينات الإنجاز', 0, 61.6, 82194.78, 0, 0, 82256.38, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 181),
(204, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1626.46, 'سداد كهرباء سكن الرياض', 0, 1626.46, 80568.32, 0, 0, 82194.78, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 182),
(205, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4000, 'ماجد الحميدي - سداد نقل الكفالة 4000 ريال نقل كفالة', 0, 4000, 76568.32, 0, 0, 80568.32, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 183),
(206, 'Journal', 151, NULL, 160, 1, NULL, NULL, 599, 'عمران - 300 ريال باقي الراتب + 299 ريال فواتير علاج ل رنا اخوه', 0, 599, 75969.32, 0, 0, 76568.32, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 184),
(207, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2185.95, 'بندر عوض حامد الثمالي - مطالبة مالية رجالية علي يوزر الامتياز', 0, 2185.95, 73783.37, 0, 0, 75969.32, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 185),
(208, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5446.8, 'دعم مصرف الانماء سداد فاتورة مكتب كريستال اوغندا', 0, 5446.8, 68336.57, 0, 0, 73783.37, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 186),
(209, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 68335.42, 0, 0, 68336.57, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 187),
(210, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3750, 'دعم مصرف الانماء سداد انجاز 1000 دولار مكتب قولدن سيزون', 0, 3750, 64585.42, 0, 0, 68335.42, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 188),
(211, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 64584.27, 0, 0, 64585.42, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 189),
(212, 'Journal', 151, NULL, 160, 1, NULL, NULL, 600, 'مها عواد العنزي - سداد الإقامة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', 0, 600, 63984.27, 0, 0, 64584.27, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:04:01', '2025-11-12 06:04:01', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 190),
(213, 'Journal', 308, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا رقم 9748', 2000, 0, 2000, 0, 0, 0, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 191),
(214, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا رقم 9748', 0, 2000, 61984.27, 0, 0, 63984.27, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 192),
(215, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3675.5, 'دفعة من مساند', 3675.5, 0, 65659.77, 0, 0, 61984.27, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 193),
(216, 'Journal', 364, NULL, 160, 1, NULL, NULL, 3675.5, 'دفعة من مساند', 0, 3675.5, -388103.7, 0, 0, -384428.2, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 194),
(217, 'Journal', 309, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا رقم 1705', 2000, 0, 2000, 0, 0, 0, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 195),
(218, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا رقم 1705', 0, 2000, 63659.77, 0, 0, 65659.77, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 196),
(219, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1700, 'استرداد رواتب ليان ون', 1700, 0, 65359.77, 0, 0, 63659.77, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 197),
(220, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1700, 'استرداد رواتب ليان ون', 1700, 0, 67059.77, 0, 0, 65359.77, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 198),
(221, 'Journal', 302, NULL, 160, 1, NULL, NULL, 1700, 'استرداد رواتب ليان ون', 0, 1700, 4412.73, 0, 0, 6112.73, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 199),
(222, 'Journal', 302, NULL, 160, 1, NULL, NULL, 1700, 'استرداد رواتب ليان ون', 0, 1700, 2712.73, 0, 0, 4412.73, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 200),
(223, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5000, 'استرداد رواتب السعودة شهر 9 / 2025 م', 5000, 0, 72059.77, 0, 0, 67059.77, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 201),
(224, 'Journal', 372, NULL, 160, 1, NULL, NULL, 5000, 'استرداد رواتب السعودة شهر 9 / 2025 م', 0, 5000, -18100, 0, 0, -13100, '0', '2025-10-09', NULL, NULL, NULL, NULL, '2025-11-12 06:08:41', '2025-11-12 06:08:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 202),
(225, 'Journal', 307, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151', 2000, 0, 4000, 0, 0, 2000, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 203),
(226, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151', 0, 2000, 70059.77, 0, 0, 72059.77, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 204),
(227, 'Journal', 151, NULL, 160, 1, NULL, NULL, 175, 'ايراد من العميل عبدالله', 175, 0, 70234.77, 0, 0, 70059.77, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 205),
(228, 'Journal', 304, NULL, 160, 1, NULL, NULL, 175, 'ايراد من العميل عبدالله', 0, 175, -14675, 0, 0, -14500, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 206),
(229, 'Journal', 342, NULL, 160, 1, 19, NULL, 4850, 'ماجد الحميدي - سداد رخصة العمل 9 شهور تخصم مناصفه', 4850, 0, 6050, 0, 0, 1200, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 207),
(230, 'Journal', 181, NULL, 160, 1, 20, NULL, 102, 'احمد خطاب - انتقالات من المكتب الي السكن بالليل 59 ريال + انتقالات اليوم الصباح لان خليل في الحفر 43 ريال', 102, 0, 239, 0, 0, 137, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 208),
(231, 'Journal', 305, NULL, 160, 1, NULL, NULL, 150, 'محمود بشير - سداد كمبيالات خاصة ب ابوسلطان', 150, 0, 2050, 0, 0, 1900, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:45', '2025-11-12 06:14:45', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 209),
(232, 'Journal', 342, NULL, 160, 1, 19, NULL, 1237, 'ماجد الحميدي - سداد الاقامة 9 شهور', 1237, 0, 7287, 0, 0, 6050, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 210),
(233, 'Journal', 343, NULL, 160, 1, 19, NULL, 4000, 'فيصل مترجم عرعر - سداد نقل الكفالة 4000 ريال نقل كفالة', 4000, 0, 8000, 0, 0, 4000, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 211),
(234, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4850, 'ماجد الحميدي - سداد رخصة العمل 9 شهور تخصم مناصفه', 0, 4850, 65384.77, 0, 0, 70234.77, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 212),
(235, 'Journal', 151, NULL, 160, 1, NULL, NULL, 102, 'احمد خطاب - انتقالات من المكتب الي السكن بالليل 59 ريال + انتقالات اليوم الصباح لان خليل في الحفر 43 ريال', 0, 102, 65282.77, 0, 0, 65384.77, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 213),
(236, 'Journal', 151, NULL, 160, 1, NULL, NULL, 150, 'محمود بشير - سداد كمبيالات خاصة ب ابوسلطان', 0, 150, 65132.77, 0, 0, 65282.77, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 214),
(237, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1237, 'ماجد الحميدي - سداد الاقامة 9 شهور', 0, 1237, 63895.77, 0, 0, 65132.77, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 215),
(238, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4000, 'فيصل مترجم عرعر - سداد نقل الكفالة 4000 ريال نقل كفالة', 0, 4000, 59895.77, 0, 0, 63895.77, '0', '2025-10-11', NULL, NULL, NULL, NULL, '2025-11-12 06:14:46', '2025-11-12 06:14:46', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 216),
(239, 'Journal', 206, NULL, 160, 1, 20, NULL, 250, 'محمود عاصم - طباعة خطه العمل وتغليفها لتقديمها لمكتب العمل', 250, 0, 5250, 0, 0, 5000, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 217),
(240, 'Journal', 151, NULL, 160, 1, NULL, NULL, 250, 'محمود عاصم - طباعة خطه العمل وتغليفها لتقديمها لمكتب العمل', 0, 250, 59645.77, 0, 0, 59895.77, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 218),
(241, 'Journal', 349, NULL, 160, 1, 20, NULL, 0.58, 'رسوم وعمولات بنكية', 0.58, 0, 64.42, 0, 0, 63.84, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 219),
(242, 'Journal', 151, NULL, 160, 1, NULL, NULL, 0.58, 'رسوم وعمولات بنكية', 0, 0.58, 59645.19, 0, 0, 59645.77, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:16:21', '2025-11-12 06:16:21', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 220),
(243, 'Journal', 342, NULL, 160, 1, 19, NULL, 4850, 'فيصل مترجم عرعر - سداد رخصة العمل 12 شهور تخصم مناصفه', 4850, 0, 12137, 0, 0, 7287, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 221),
(244, 'Journal', 342, NULL, 160, 1, 19, NULL, 600, 'عادل عوض الهزيمي - سداد الإقامة - العاملة معروضه نقل والعميل موقع علي إقرار نقل', 600, 0, 12737, 0, 0, 12137, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 222),
(245, 'Journal', 342, NULL, 160, 1, 19, NULL, 1650, 'فيصل مترجم عرعر - سداد الاقامة 12 شهور', 1650, 0, 14387, 0, 0, 12737, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 223),
(246, 'Journal', 334, NULL, 160, 1, 18, NULL, 171, 'ابوفواز - مصروف اعاشة سكن عاملات مكتب انجاز 171 ريال', 171, 0, 331, 0, 0, 160, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 224),
(247, 'Journal', 179, NULL, 160, 1, 18, NULL, 90, 'نور الدين - فحص طبي عامله مها عواد العنزي العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', 90, 0, 180, 0, 0, 90, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 225),
(248, 'Journal', 367, NULL, 160, 1, 16, NULL, 3971, 'شويمي بن سعد بن شويمي السبيعي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة من مكتب سابولا اثيوبيا', 3971, 0, 26131.75, 0, 0, 22160.75, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 226),
(249, 'Journal', 367, NULL, 160, 1, 16, NULL, 14850, 'وليد عبدالله بجاد العتيبي - مطالبة مالية - العميل الغي العقد لخطا في راتب العاملة والعميل مستمر معنا بعقد جديد', 14850, 0, 40981.75, 0, 0, 26131.75, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 227),
(250, 'Journal', 367, NULL, 160, 1, 16, NULL, 6760.65, 'وسميه محمد ناصر الخويتم - مطالبة مالية - العميل الغي العقد وتخصم من الغرامه من مكتب MAJORDOMO  كينيا', 6760.65, 0, 47742.4, 0, 0, 40981.75, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 228),
(251, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4850, 'فيصل مترجم عرعر - سداد رخصة العمل 12 شهور تخصم مناصفه', 0, 4850, 54795.19, 0, 0, 59645.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 229),
(252, 'Journal', 151, NULL, 160, 1, NULL, NULL, 600, 'عادل عوض الهزيمي - سداد الإقامة - العاملة معروضه نقل والعميل موقع علي إقرار نقل', 0, 600, 54195.19, 0, 0, 54795.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 230),
(253, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1650, 'فيصل مترجم عرعر - سداد الاقامة 12 شهور', 0, 1650, 52545.19, 0, 0, 54195.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 231),
(254, 'Journal', 151, NULL, 160, 1, NULL, NULL, 171, 'ابوفواز - مصروف اعاشة سكن عاملات مكتب انجاز 171 ريال', 0, 171, 52374.19, 0, 0, 52545.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 232),
(255, 'Journal', 151, NULL, 160, 1, NULL, NULL, 90, 'نور الدين - فحص طبي عامله مها عواد العنزي العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', 0, 90, 52284.19, 0, 0, 52374.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 233),
(256, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3971, 'شويمي بن سعد بن شويمي السبيعي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة من مكتب سابولا اثيوبيا', 0, 3971, 48313.19, 0, 0, 52284.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 234),
(257, 'Journal', 151, NULL, 160, 1, NULL, NULL, 14850, 'وليد عبدالله بجاد العتيبي - مطالبة مالية - العميل الغي العقد لخطا في راتب العاملة والعميل مستمر معنا بعقد جديد', 0, 14850, 33463.19, 0, 0, 48313.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 235),
(258, 'Journal', 151, NULL, 160, 1, NULL, NULL, 6760.65, 'وسميه محمد ناصر الخويتم - مطالبة مالية - العميل الغي العقد وتخصم من الغرامه من مكتب MAJORDOMO  كينيا', 0, 6760.65, 26702.54, 0, 0, 33463.19, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 236),
(259, 'Journal', 151, NULL, 160, 1, NULL, NULL, 453, 'ايراد من العميل جهز هاجد العازمة', 453, 0, 27155.54, 0, 0, 26702.54, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 237),
(260, 'Journal', 304, NULL, 160, 1, NULL, NULL, 453, 'ايراد من العميل جهز هاجد العازمة', 0, 453, -15128, 0, 0, -14675, '0', '2025-10-12', NULL, NULL, NULL, NULL, '2025-11-12 06:26:55', '2025-11-12 06:26:55', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 238),
(261, 'Journal', 151, NULL, 160, 1, NULL, NULL, 116032.41, 'دفعة من مساند', 116032.41, 0, 143187.95, 0, 0, 27155.54, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 239),
(262, 'Journal', 364, NULL, 160, 1, NULL, NULL, 116032.41, 'دفعة من مساند', 0, 116032.41, -504136.11, 0, 0, -388103.7, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 240),
(263, 'Journal', 338, NULL, 160, 1, 18, NULL, 200, 'هاني - سداد فاتورة جوال المكتب 200', 200, 0, 2324.77, 0, 0, 2124.77, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 241),
(264, 'Journal', 367, NULL, 160, 1, 16, NULL, 5613.45, 'جواهر صبري بن رويشد الرويلي -  مطالبة مالية - العميل الغي العقد وتم خصم الغرامة', 5613.45, 0, 53355.85, 0, 0, 47742.4, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 242),
(265, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'رسوم وعمولات بنكية', 1.15, 0, 65.57, 0, 0, 64.42, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 243),
(266, 'Journal', 151, NULL, 160, 1, NULL, NULL, 200, 'هاني - سداد فاتورة جوال المكتب 200', 0, 200, 142987.95, 0, 0, 143187.95, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 244),
(267, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5613.45, 'جواهر صبري بن رويشد الرويلي -  مطالبة مالية - العميل الغي العقد وتم خصم الغرامة', 0, 5613.45, 137374.5, 0, 0, 142987.95, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 245),
(268, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية', 0, 1.15, 137373.35, 0, 0, 137374.5, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 246),
(269, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1000, 'دفعة من العميلة مشاعل ساير حجى', 1000, 0, 138373.35, 0, 0, 137373.35, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 247),
(270, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1000, 'دفعة من العميلة مشاعل ساير حجى', 1000, 0, 139373.35, 0, 0, 138373.35, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 248),
(271, 'Journal', 304, NULL, 160, 1, NULL, NULL, 2000, 'دفعة من العميلة مشاعل ساير حجى', 0, 2000, -17128, 0, 0, -15128, '0', '2025-10-13', NULL, NULL, NULL, NULL, '2025-11-12 06:31:35', '2025-11-12 06:31:35', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 249),
(272, 'Journal', 370, NULL, 160, 1, NULL, NULL, 35000, 'عياس العيسي - تحويل مبلغ 35000 المتبقي من مبلغ التقبيل مكتب الامتياز فرع الربوه الإجمالي 70000 ريال', 35000, 0, 70000, 0, 0, 35000, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 250),
(273, 'Journal', 349, NULL, 160, 1, 20, NULL, 8.05, 'رسوم وعمولات بنكية', 8.05, 0, 73.62, 0, 0, 65.57, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 251),
(274, 'Journal', 151, NULL, 160, 1, NULL, NULL, 35000, 'عياس العيسي - تحويل مبلغ 35000 المتبقي من مبلغ التقبيل مكتب الامتياز فرع الربوه الإجمالي 70000 ريال', 0, 35000, 104373.35, 0, 0, 139373.35, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 252),
(275, 'Journal', 151, NULL, 160, 1, NULL, NULL, 8.05, 'رسوم وعمولات بنكية', 0, 8.05, 104365.3, 0, 0, 104373.35, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 253),
(276, 'Journal', 151, NULL, 160, 1, NULL, NULL, 471, 'ايراد من العميلة اوامر', 471, 0, 104836.3, 0, 0, 104365.3, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 254),
(277, 'Journal', 304, NULL, 160, 1, NULL, NULL, 471, 'ايراد من العميلة اوامر', 0, 471, -17599, 0, 0, -17128, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:47:58', '2025-11-12 06:47:58', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 255),
(278, 'Journal', 305, NULL, 160, 1, NULL, NULL, 206.4, 'مشاعل صالح سفر النفيعي - مطالبه ماليه علي يوزر الإنجاز', 206.4, 0, 2256.4, 0, 0, 2050, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 256),
(279, 'Journal', 305, NULL, 160, 1, NULL, NULL, 206.55, 'عايض بن مهجي بن زائد العتيبي - مطالبه ماليه علي يوزر الإنجاز', 206.55, 0, 2462.95, 0, 0, 2256.4, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 257),
(280, 'Journal', 305, NULL, 160, 1, NULL, NULL, 206.4, 'ماجد عطالله بن سمير الحربي - مطالبه ماليه علي يوزر الإنجاز', 206.4, 0, 2669.35, 0, 0, 2462.95, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 258),
(281, 'Journal', 305, NULL, 160, 1, NULL, NULL, 206.4, 'مطلق بن فهد بن هادي الدوسري - مطالبه ماليه علي يوزر الإنجاز', 206.4, 0, 2875.75, 0, 0, 2669.35, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 259),
(282, 'Journal', 305, NULL, 160, 1, NULL, NULL, 1500, 'ابوصقر - راتب عاملة بنجلادش عملت في بيت ابوسلطان شهر ونص (امل رمضان)', 1500, 0, 4375.75, 0, 0, 2875.75, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 260),
(283, 'Journal', 305, NULL, 160, 1, NULL, NULL, 206.4, 'نوف مقبول خميس الحازمي - مطالبه ماليه علي يوزر الإنجاز', 206.4, 0, 4582.15, 0, 0, 4375.75, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 261),
(284, 'Journal', 349, NULL, 160, 1, 20, NULL, 0.58, 'رسوم وعمولات بنكية', 0.58, 0, 74.2, 0, 0, 73.62, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 262),
(285, 'Journal', 176, NULL, 160, 1, 20, NULL, 3750, 'سداد انجاز 1000 دولار مكتب رفيق بنجلادش', 3750, 0, 7999.85, 0, 0, 4249.85, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 263),
(286, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'رسوم وعمولات بنكية', 1.15, 0, 75.35, 0, 0, 74.2, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 264),
(287, 'Journal', 182, NULL, 160, 1, 18, NULL, 2000, 'مها عواد العنزي - سداد تأشيرة بديلة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', 2000, 0, 2000, 0, 0, 0, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 265),
(288, 'Journal', 367, NULL, 160, 1, 18, NULL, 4253.95, 'هاجد مبرك عوض العازمي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة من المكتب قولدن سيزون اثيوبيا', 4253.95, 0, 57609.8, 0, 0, 53355.85, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 266),
(289, 'Journal', 151, NULL, 160, 1, NULL, NULL, 206.4, 'مشاعل صالح سفر النفيعي - مطالبه ماليه علي يوزر الإنجاز', 0, 206.4, 104629.9, 0, 0, 104836.3, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 267),
(290, 'Journal', 151, NULL, 160, 1, NULL, NULL, 206.55, 'عايض بن مهجي بن زائد العتيبي - مطالبه ماليه علي يوزر الإنجاز', 0, 206.55, 104423.35, 0, 0, 104629.9, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 268),
(291, 'Journal', 151, NULL, 160, 1, NULL, NULL, 206.4, 'ماجد عطالله بن سمير الحربي - مطالبه ماليه علي يوزر الإنجاز', 0, 206.4, 104216.95, 0, 0, 104423.35, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 269),
(292, 'Journal', 151, NULL, 160, 1, NULL, NULL, 206.4, 'مطلق بن فهد بن هادي الدوسري - مطالبه ماليه علي يوزر الإنجاز', 0, 206.4, 104010.55, 0, 0, 104216.95, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 270),
(293, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1500, 'ابوصقر - راتب عاملة بنجلادش عملت في بيت ابوسلطان شهر ونص (امل رمضان)', 0, 1500, 102510.55, 0, 0, 104010.55, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 271),
(294, 'Journal', 151, NULL, 160, 1, NULL, NULL, 206.4, 'نوف مقبول خميس الحازمي - مطالبه ماليه علي يوزر الإنجاز', 0, 206.4, 102304.15, 0, 0, 102510.55, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 272),
(295, 'Journal', 151, NULL, 160, 1, NULL, NULL, 0.58, 'رسوم وعمولات بنكية', 0, 0.58, 102303.57, 0, 0, 102304.15, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 273),
(296, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3750, 'سداد انجاز 1000 دولار مكتب رفيق بنجلادش', 0, 3750, 98553.57, 0, 0, 102303.57, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 274),
(297, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية', 0, 1.15, 98552.42, 0, 0, 98553.57, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 275),
(298, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'مها عواد العنزي - سداد تأشيرة بديلة - العاملة نقل الي العميل يوسف محمد الظفيري تبع ابوسلطان يتم السداد علي الراتب', 0, 2000, 96552.42, 0, 0, 98552.42, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 276),
(299, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4253.95, 'هاجد مبرك عوض العازمي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة من المكتب قولدن سيزون اثيوبيا', 0, 4253.95, 92298.47, 0, 0, 96552.42, '0', '2025-10-14', NULL, NULL, NULL, NULL, '2025-11-12 06:56:05', '2025-11-12 06:56:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 277),
(300, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4254.1, 'ايراد من العميل عبد الرحمن', 4254.1, 0, 96552.57, 0, 0, 92298.47, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 278),
(301, 'Journal', 151, NULL, 160, 1, NULL, NULL, 14493.8, 'دفعة من مساند', 14493.8, 0, 111046.37, 0, 0, 96552.57, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 279),
(302, 'Journal', 304, NULL, 160, 1, NULL, NULL, 4254.1, 'ايراد من العميل عبد الرحمن', 0, 4254.1, -21853.1, 0, 0, -17599, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 280),
(303, 'Journal', 364, NULL, 160, 1, NULL, NULL, 14493.8, 'دفعة من مساند', 0, 14493.8, -518629.91, 0, 0, -504136.11, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:20:25', '2025-11-12 07:20:25', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 281),
(304, 'Journal', 368, NULL, 160, 1, 16, NULL, 1400, 'مندوبة الفلبين ANALYN FISHER - ادخال 5عقود للبولو2متميز +2 امتياز+1 انجاز (عبدالله لواص+طلال الرويلي+عبدالله العنزي+هديه الشمري+وليد الديب)', 1400, 0, 2240, 0, 0, 840, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 282),
(305, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1400, 'مندوبة الفلبين ANALYN FISHER - ادخال 5عقود للبولو2متميز +2 امتياز+1 انجاز (عبدالله لواص+طلال الرويلي+عبدالله العنزي+هديه الشمري+وليد الديب)', 0, 1400, 109646.37, 0, 0, 111046.37, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 283),
(306, 'Journal', 342, NULL, 160, 1, 16, NULL, 200, 'محمد مرعي - تمديد خروج وعوده 200 ريال', 200, 0, 14587, 0, 0, 14387, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 284),
(307, 'Journal', 151, NULL, 160, 1, NULL, NULL, 200, 'محمد مرعي - تمديد خروج وعوده 200 ريال', 0, 200, 109446.37, 0, 0, 109646.37, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 285),
(308, 'Journal', 367, NULL, 160, 1, 19, NULL, 4871.45, 'فاطمه محمد حسن حمدي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب يونيك اوغندا', 4871.45, 0, 62481.25, 0, 0, 57609.8, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 286),
(309, 'Journal', 151, NULL, 160, 1, NULL, NULL, 4871.45, 'فاطمه محمد حسن حمدي - سداد مساند - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب يونيك اوغندا', 0, 4871.45, 104574.92, 0, 0, 109446.37, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 287),
(310, 'Journal', 176, NULL, 160, 1, 20, NULL, 32954.96, 'سداد فاتورة مكتب سابولا اثيوبيا', 32954.96, 0, 40954.81, 0, 0, 7999.85, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 288),
(311, 'Journal', 151, NULL, 160, 1, NULL, NULL, 32954.96, 'سداد فاتورة مكتب سابولا اثيوبيا', 0, 32954.96, 71619.96, 0, 0, 104574.92, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 289),
(312, 'Journal', 349, NULL, 160, 1, 20, NULL, 5.75, 'رسوم وعمولات بنكية', 5.75, 0, 81.1, 0, 0, 75.35, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 290),
(313, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5.75, 'رسوم وعمولات بنكية', 0, 5.75, 71614.21, 0, 0, 71619.96, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 291),
(314, 'Journal', 155, NULL, 160, 1, NULL, NULL, 19000, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 19000, 0, 56466.8, 0, 0, 37466.8, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 292),
(315, 'Journal', 151, NULL, 160, 1, NULL, NULL, 19000, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 0, 19000, 52614.21, 0, 0, 71614.21, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 293),
(316, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'رسوم وعمولات بنكية', 1.15, 0, 82.25, 0, 0, 81.1, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 294),
(317, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية', 0, 1.15, 52613.06, 0, 0, 52614.21, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 295),
(318, 'Journal', 155, NULL, 160, 1, NULL, NULL, 16414, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 16414, 0, 72880.8, 0, 0, 56466.8, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 296),
(319, 'Journal', 151, NULL, 160, 1, NULL, NULL, 16414, 'دعم بنك الانماء سداد فاتورة مكتب انكوربوريتد الفلبين', 0, 16414, 36199.06, 0, 0, 52613.06, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 297),
(320, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'رسوم وعمولات بنكية', 1.15, 0, 83.4, 0, 0, 82.25, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 298),
(321, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'رسوم وعمولات بنكية', 0, 1.15, 36197.91, 0, 0, 36199.06, '0', '2025-10-15', NULL, NULL, NULL, NULL, '2025-11-12 07:27:17', '2025-11-12 07:27:17', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 299),
(322, 'Journal', 307, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9151', 2000, 0, 6000, 0, 0, 4000, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 300),
(323, 'Journal', 308, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9748', 2000, 0, 4000, 0, 0, 2000, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 301),
(324, 'Journal', 309, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 1705', 2000, 0, 4000, 0, 0, 2000, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 302),
(325, 'Journal', 310, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9726', 2000, 0, 4000, 0, 0, 2000, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 303),
(326, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9151', 0, 2000, 34197.91, 0, 0, 36197.91, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 304),
(327, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9748', 0, 2000, 32197.91, 0, 0, 34197.91, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 305),
(328, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 1705', 0, 2000, 30197.91, 0, 0, 32197.91, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 306),
(329, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9726', 0, 2000, 28197.91, 0, 0, 30197.91, '0', '2025-10-16', NULL, NULL, NULL, NULL, '2025-11-12 07:35:57', '2025-11-12 07:35:57', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 307),
(330, 'Journal', 308, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9748', 2000, 0, 6000, 0, 0, 4000, '0', '2025-10-18', NULL, NULL, NULL, NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 308),
(331, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'شحن فيزا رقم 9748', 0, 2000, 26197.91, 0, 0, 28197.91, '0', '2025-10-18', NULL, NULL, NULL, NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 309);
INSERT INTO `transections` (`id`, `tran_type`, `account_id`, `account_id_to`, `seller_id`, `branch_id`, `cost_id`, `cost_id_to`, `amount`, `description`, `debit`, `credit`, `balance`, `credit_account`, `debit_account`, `balance_account`, `balance_customer`, `date`, `end_date`, `customer_id`, `supplier_id`, `order_id`, `created_at`, `updated_at`, `deleted_at`, `company_id`, `asset_id`, `expense_id`, `tax`, `fixed_type`, `img`, `active`, `cash`, `name`, `tax_number`, `tax_id`, `is_reversal`, `salary_id`, `journal_entry_detail_id`) VALUES
(332, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5700, 'ايراد من العميل محمد', 5700, 0, 31897.91, 0, 0, 26197.91, '0', '2025-10-18', NULL, NULL, NULL, NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 310),
(333, 'Journal', 304, NULL, 160, 1, NULL, NULL, 5700, 'ايراد من العميل محمد', 0, 5700, -27553.1, 0, 0, -21853.1, '0', '2025-10-18', NULL, NULL, NULL, NULL, '2025-11-12 07:37:34', '2025-11-12 07:37:34', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 311),
(334, 'Journal', 307, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151 - شحن', 2000, 0, 8000, 0, 0, 6000, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 312),
(335, 'Journal', 308, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151 - شحن', 2000, 0, 8000, 0, 0, 6000, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 313),
(336, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151 - شحن', 0, 2000, 29897.91, 0, 0, 31897.91, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 314),
(337, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151 - شحن', 0, 2000, 27897.91, 0, 0, 29897.91, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:42:05', '2025-11-12 15:42:05', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 315),
(338, 'Journal', 346, NULL, 160, 1, 16, NULL, 1500, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 تحويل 1500 ريال', 1500, 0, 1500, 0, 0, 0, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 316),
(339, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 84.55, 0, 0, 83.4, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 317),
(340, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1500, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 تحويل 1500 ريال', 0, 1500, 26397.91, 0, 0, 27897.91, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 318),
(341, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 26396.76, 0, 0, 26397.91, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 319),
(342, 'Journal', 206, NULL, 160, 1, 20, NULL, 2500, 'خالد حويشي - تحويل 2500 ريال رسوم انهاء معاملة جمال من مكتب العمل', 2500, 0, 7750, 0, 0, 5250, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 320),
(343, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2500, 'خالد حويشي - تحويل 2500 ريال رسوم انهاء معاملة جمال من مكتب العمل', 0, 2500, 23896.76, 0, 0, 26396.76, '0', '2025-10-19', NULL, NULL, NULL, NULL, '2025-11-12 15:44:18', '2025-11-12 15:44:18', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 321),
(344, 'Journal', 151, NULL, 160, 1, NULL, NULL, 164545.88, 'دفعة من مساند', 164545.88, 0, 188442.64, 0, 0, 23896.76, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 322),
(345, 'Journal', 364, NULL, 160, 1, NULL, NULL, 164545.88, 'دفعة من مساند', 0, 164545.88, -683175.79, 0, 0, -518629.91, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 323),
(346, 'Journal', 307, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151 - عهدة', 2000, 0, 10000, 0, 0, 8000, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 324),
(347, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9151 - عهدة', 0, 2000, 186442.64, 0, 0, 188442.64, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 325),
(348, 'Journal', 151, NULL, 160, 1, NULL, NULL, 300, 'ايراد من العميل محمد', 300, 0, 186742.64, 0, 0, 186442.64, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 326),
(349, 'Journal', 304, NULL, 160, 1, NULL, NULL, 300, 'ايراد من العميل محمد', 0, 300, -27853.1, 0, 0, -27553.1, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 15:47:03', '2025-11-12 15:47:03', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 327),
(350, 'Journal', 176, NULL, 160, 1, 20, NULL, 25020, 'سداد فاتورة مكتب نيشن سريلانكا', 25020, 0, 65974.81, 0, 0, 40954.81, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 328),
(351, 'Journal', 349, NULL, 160, 1, 20, NULL, 18.4, 'عمولات بنكية', 18.4, 0, 102.95, 0, 0, 84.55, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 329),
(352, 'Journal', 155, NULL, 160, 1, NULL, NULL, 18000, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', 18000, 0, 90880.8, 0, 0, 72880.8, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 330),
(353, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 104.1, 0, 0, 102.95, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 331),
(354, 'Journal', 155, NULL, 160, 1, NULL, NULL, 19000, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', 19000, 0, 109880.8, 0, 0, 90880.8, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 332),
(355, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 105.25, 0, 0, 104.1, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 333),
(356, 'Journal', 155, NULL, 160, 1, NULL, NULL, 12890, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', 12890, 0, 122770.8, 0, 0, 109880.8, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 334),
(357, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 106.4, 0, 0, 105.25, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 335),
(358, 'Journal', 301, NULL, 160, 1, NULL, NULL, 1500, 'محمد رشاد - محاسب قانوني تحويل مبلغ 1500 ريال راتب شهر سبتمبر (ملف الضرائب)', 1500, 0, 15536.67, 0, 0, 14036.67, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 336),
(359, 'Journal', 367, NULL, 160, 1, 19, NULL, 7670, 'جواهر عايد ذعذاع العنزي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب سنترال بنجلادش', 7670, 0, 70151.25, 0, 0, 62481.25, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 337),
(360, 'Journal', 333, NULL, 160, 1, 19, NULL, 6000, 'نايف محمد شويحط - ايجار سكن عاملات مكتب المتميز - من 01-10-2025 حتي31-12-2025 تم تغيير العقد الإجمالي 24000 ريال', 6000, 0, 6000, 0, 0, 0, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 338),
(361, 'Journal', 365, NULL, 160, 1, 19, NULL, 950, 'ابوصقر - استلام 9 + 12 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر', 950, 0, 4322, 0, 0, 3372, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 339),
(362, 'Journal', 176, NULL, 160, 1, 20, NULL, 53206.32, 'سداد فاتورة مكتب رفيق بنجلادش', 53206.32, 0, 119181.13, 0, 0, 65974.81, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 340),
(363, 'Journal', 176, NULL, 160, 1, 20, NULL, 8135.2, 'سداد فاتورة مكتب كريستال اوغندا', 8135.2, 0, 127316.33, 0, 0, 119181.13, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 341),
(364, 'Journal', 176, NULL, 160, 1, 20, NULL, 2965.2, 'سداد فاتورة مكتب ماجوردمو كينيا', 2965.2, 0, 130281.53, 0, 0, 127316.33, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 342),
(365, 'Journal', 349, NULL, 160, 1, 20, NULL, 5.75, 'عمولات بنكية', 5.75, 0, 112.15, 0, 0, 106.4, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 343),
(366, 'Journal', 367, NULL, 160, 1, 16, NULL, 3800, 'حنين احمد محمد الجيزاني - استرجاع نقل - العامله معروضه نقل في مكتب الرياض والعميل موقع علي إقرار نقل', 3800, 0, 73951.25, 0, 0, 70151.25, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 344),
(367, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 113.3, 0, 0, 112.15, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 345),
(368, 'Journal', 331, NULL, 160, 1, 19, NULL, 9000, 'ايجار مكتب المتميز سداد دفعه 9000 ريال عن 3 شهور من 01-10-2025 حتي31-12-2025علما بان الايجار السنوي 36000 ريال', 9000, 0, 14600, 0, 0, 5600, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 346),
(369, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 114.45, 0, 0, 113.3, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 347),
(370, 'Journal', 151, NULL, 160, 1, NULL, NULL, 25020, 'سداد فاتورة مكتب نيشن سريلانكا', 0, 25020, 161722.64, 0, 0, 186742.64, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 348),
(371, 'Journal', 151, NULL, 160, 1, NULL, NULL, 18.4, 'عمولات بنكية', 0, 18.4, 161704.24, 0, 0, 161722.64, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 349),
(372, 'Journal', 151, NULL, 160, 1, NULL, NULL, 18000, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', 0, 18000, 143704.24, 0, 0, 161704.24, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 350),
(373, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 143703.09, 0, 0, 143704.24, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 351),
(374, 'Journal', 151, NULL, 160, 1, NULL, NULL, 19000, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', 0, 19000, 124703.09, 0, 0, 143703.09, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 352),
(375, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 124701.94, 0, 0, 124703.09, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 353),
(376, 'Journal', 151, NULL, 160, 1, NULL, NULL, 12890, 'دعم بنك الانماء سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', 0, 12890, 111811.94, 0, 0, 124701.94, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 354),
(377, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 111810.79, 0, 0, 111811.94, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 355),
(378, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1500, 'محمد رشاد - محاسب قانوني تحويل مبلغ 1500 ريال راتب شهر سبتمبر (ملف الضرائب)', 0, 1500, 110310.79, 0, 0, 111810.79, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 356),
(379, 'Journal', 151, NULL, 160, 1, NULL, NULL, 7670, 'جواهر عايد ذعذاع العنزي - استرجاع تسفير - تم تسفير العاملة داخل الضمان وتم خصم العاملة + التذكرة من مكتب سنترال بنجلادش', 0, 7670, 102640.79, 0, 0, 110310.79, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 357),
(380, 'Journal', 151, NULL, 160, 1, NULL, NULL, 6000, 'نايف محمد شويحط - ايجار سكن عاملات مكتب المتميز - من 01-10-2025 حتي31-12-2025 تم تغيير العقد الإجمالي 24000 ريال', 0, 6000, 96640.79, 0, 0, 102640.79, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 358),
(381, 'Journal', 151, NULL, 160, 1, NULL, NULL, 950, 'ابوصقر - استلام 9 + 12 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر', 0, 950, 95690.79, 0, 0, 96640.79, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 359),
(382, 'Journal', 151, NULL, 160, 1, NULL, NULL, 64306.72, 'سداد فاتورة مكتب رفيق بنجلادش', 0, 64306.72, 31384.07, 0, 0, 95690.79, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 360),
(383, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5.75, 'عمولات بنكية', 0, 5.75, 31378.32, 0, 0, 31384.07, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 361),
(384, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3800, 'حنين احمد محمد الجيزاني - استرجاع نقل - العامله معروضه نقل في مكتب الرياض والعميل موقع علي إقرار نقل', 0, 3800, 27578.32, 0, 0, 31378.32, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 362),
(385, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 27577.17, 0, 0, 27578.32, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 363),
(386, 'Journal', 151, NULL, 160, 1, NULL, NULL, 9000, 'ايجار مكتب المتميز سداد دفعه 9000 ريال عن 3 شهور من 01-10-2025 حتي31-12-2025علما بان الايجار السنوي 36000 ريال', 0, 9000, 18577.17, 0, 0, 27577.17, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 364),
(387, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 18576.02, 0, 0, 18577.17, '0', '2025-10-20', NULL, NULL, NULL, NULL, '2025-11-12 16:10:48', '2025-11-12 16:10:48', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 365),
(388, 'Journal', 151, NULL, 160, 1, NULL, NULL, 131666.5, 'دفعة من مساند', 131666.5, 0, 150242.52, 0, 0, 18576.02, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 366),
(389, 'Journal', 364, NULL, 160, 1, NULL, NULL, 131666.5, 'دفعة من مساند', 0, 131666.5, -814842.29, 0, 0, -683175.79, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 367),
(390, 'Journal', 349, NULL, 160, 1, 20, NULL, 37.38, 'رسوم وعمولات بنكية', 37.38, 0, 151.83, 0, 0, 114.45, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 368),
(391, 'Journal', 151, NULL, 160, 1, NULL, NULL, 37.38, 'رسوم وعمولات بنكية', 0, 37.38, 150205.14, 0, 0, 150242.52, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 369),
(392, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1270, 'ايراد من العميلة خلود', 1270, 0, 151475.14, 0, 0, 150205.14, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 370),
(393, 'Journal', 304, NULL, 160, 1, NULL, NULL, 1270, 'ايراد من العميلة خلود', 0, 1270, -29123.1, 0, 0, -27853.1, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:37:38', '2025-11-12 16:37:38', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 371),
(394, 'Journal', 365, NULL, 160, 1, 18, NULL, 317, 'ابوفواز - تحويل رسوم استلام عاملات من شركة سلسك الدمام 167 ريال +رسوم المندوب 150 ريال اماني رمضان الظفيري', 317, 0, 4639, 0, 0, 4322, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 372),
(395, 'Journal', 151, NULL, 160, 1, 18, NULL, 317, 'ابوفواز - تحويل رسوم استلام عاملات من شركة سلسك الدمام 167 ريال +رسوم المندوب 150 ريال اماني رمضان الظفيري', 0, 317, 151158.14, 0, 0, 151475.14, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 373),
(396, 'Journal', 347, NULL, 160, 1, 18, NULL, 2500, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل05-10', 2500, 0, 5000, 0, 0, 2500, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 374),
(397, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2500, 'أبو فواز - شحن محفظة الدريس 2500 ريال اخر تحويل05-10', 0, 2500, 148658.14, 0, 0, 151158.14, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 375),
(398, 'Journal', 366, NULL, 160, 1, 18, NULL, 950, 'وكالة نجد//تذكرة عاملة شويمي سعد شويمي السبيعي - داخل الضمان - تم خصم العاملة + التذكرة من مكتب سابولا اثيوبيا', 950, 0, 1800, 0, 0, 850, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 376),
(399, 'Journal', 366, NULL, 160, 1, 18, NULL, 950, 'وكالة نجد//تذكرة عاملة شويمي سعد شويمي السبيعي - داخل الضمان - تم خصم العاملة + التذكرة من مكتب سابولا اثيوبيا', 950, 0, 2750, 0, 0, 1800, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 377),
(400, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1900, 'وكالة نجد//تذكرة عاملة هاجد مبرك عوض العازمي - داخل الضمان - تم خصم العاملة + التذكرة من مكتب قولدن سيزون اثيوبيا', 0, 1900, 146758.14, 0, 0, 148658.14, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 378),
(401, 'Journal', 366, NULL, 160, 1, 19, NULL, 1600, 'ابوصقر- تذكرة عاملة اسامه بدر مطر ضاحي العنزي - تم خصم العاملة + التذكرة من مكتب ليلي الفلبين', 1600, 0, 4350, 0, 0, 2750, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 379),
(402, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1600, 'ابوصقر- تذكرة عاملة اسامه بدر مطر ضاحي العنزي - تم خصم العاملة + التذكرة من مكتب ليلي الفلبين', 0, 1600, 145158.14, 0, 0, 146758.14, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 380),
(403, 'Journal', 367, NULL, 160, 1, 19, NULL, 3779, 'فصايل محمد عوده الصلبي - استرجاع تسفير - تم تسفير العاملة داخل الضمان و تم خصم العاملة + التذكرة من مكتب قولدن سيزون اثيوبيا', 3779, 0, 77730.25, 0, 0, 73951.25, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 381),
(404, 'Journal', 151, NULL, 160, 1, NULL, NULL, 3779, 'سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا', 0, 3779, 141379.14, 0, 0, 145158.14, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 382),
(405, 'Journal', 176, NULL, 160, 1, 20, NULL, 58209.44, 'سداد فاتورة مكتب ليلي الفلبين', 58209.44, 0, 188490.97, 0, 0, 130281.53, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 383),
(406, 'Journal', 151, NULL, 160, 1, NULL, NULL, 58209.44, 'سداد جزء من فاتورة مكتب قولدن سيزون اثيوبيا\r\n+ سداد فاتورة مكتب ليلي الفلبين', 0, 58209.44, 83169.7, 0, 0, 141379.14, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 384),
(407, 'Journal', 349, NULL, 160, 1, 20, NULL, 5.75, 'عمولات بنكية', 5.75, 0, 157.58, 0, 0, 151.83, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 385),
(408, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5.75, 'عمولات بنكية', 0, 5.75, 83163.95, 0, 0, 83169.7, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 386),
(409, 'Journal', 346, NULL, 160, 1, 16, NULL, 1375, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 المتبقي 1375 ريال', 1375, 0, 2875, 0, 0, 1500, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 387),
(410, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1375, 'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 المتبقي 1375 ريال', 0, 1375, 81788.95, 0, 0, 83163.95, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 388),
(411, 'Journal', 349, NULL, 160, 1, 20, NULL, 1.15, 'عمولات بنكية', 1.15, 0, 158.73, 0, 0, 157.58, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 389),
(412, 'Journal', 151, NULL, 160, 1, NULL, NULL, 1.15, 'عمولات بنكية', 0, 1.15, 81787.8, 0, 0, 81788.95, '0', '2025-10-21', NULL, NULL, NULL, NULL, '2025-11-12 16:50:41', '2025-11-12 16:50:41', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 390),
(413, 'Journal', 151, NULL, 160, 1, NULL, NULL, 72437.3, 'دفعة من مساند', 72437.3, 0, 154225.1, 0, 0, 81787.8, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 391),
(414, 'Journal', 364, NULL, 160, 1, NULL, NULL, 72437.3, 'دفعة من مساند', 0, 72437.3, -887279.59, 0, 0, -814842.29, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 392),
(415, 'Journal', 308, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9748 - شحن', 2000, 0, 10000, 0, 0, 8000, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 393),
(416, 'Journal', 310, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9726- شحن', 2000, 0, 6000, 0, 0, 4000, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 394),
(417, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9748 - شحن', 0, 2000, 152225.1, 0, 0, 154225.1, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 395),
(418, 'Journal', 151, NULL, 160, 1, NULL, NULL, 2000, 'عهدة فيزا 9726- شحن', 0, 2000, 150225.1, 0, 0, 152225.1, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 396),
(419, 'Journal', 151, NULL, 160, 1, NULL, NULL, 10000, 'ايراد من العميل سعود', 10000, 0, 160225.1, 0, 0, 150225.1, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 397),
(420, 'Journal', 304, NULL, 160, 1, NULL, NULL, 10000, 'ايراد من العميل سعود', 0, 10000, -39123.1, 0, 0, -29123.1, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 16:54:40', '2025-11-12 16:54:40', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 398),
(421, 'Journal', 342, NULL, 160, 1, 18, NULL, 600, 'فاطمه عطيه حزيم العنزي - سداد الإقامة - العاملة نقل الي العميل حنان حليس الشمري مسدد 2000 ريال باقي 7000 تم اصدار كمبيالة', 600, 0, 15187, 0, 0, 14587, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 399),
(422, 'Journal', 366, NULL, 160, 1, 16, NULL, 300, 'وكالة أسبوع الطيران - تذكرة سفر - عاملة يوسف سطام العنزي الي سكاكا العميل مسدد 10000 ريال باقي 9000 (سعود وارد الرويلي)', 300, 0, 4650, 0, 0, 4350, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 400),
(423, 'Journal', 338, NULL, 160, 1, 16, NULL, 115, 'خليل - سداد فاتورة جوال المكتب 115 ريال', 115, 0, 2439.77, 0, 0, 2324.77, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 401),
(424, 'Journal', 338, NULL, 160, 1, 18, NULL, 200, 'ابوفواز - سداد فاتورة جوال المكتب 200', 200, 0, 2639.77, 0, 0, 2439.77, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 402),
(425, 'Journal', 368, NULL, 160, 1, 16, NULL, 840, 'مندوبة الفلبين ANALYN FISHER - ادخال 3عقود للبولو1متميز +2 امتياز (عبدالله لواص+وليد العتيبي+خالد الريض)', 840, 0, 3080, 0, 0, 2240, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 403),
(426, 'Journal', 205, NULL, 160, 1, 16, NULL, 129, 'اسامه - ضيافه مكتب أبو ريان وتم الاتفاق معاه علي العمل مرة اخري علي 600 دولار', 129, 0, 129, 0, 0, 0, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 404),
(427, 'Journal', 338, NULL, 160, 1, 16, NULL, 230, 'اسامه - سداد فاتورة جوال المكتب 230 ريال', 230, 0, 2869.77, 0, 0, 2639.77, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 405),
(428, 'Journal', 176, NULL, 160, 1, 20, NULL, 49890, 'سداد باقي فاتورة مكتب قولدن سيزون اثيوبيا', 49890, 0, 238380.97, 0, 0, 188490.97, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 406),
(429, 'Journal', 349, NULL, 160, 1, 20, NULL, 5.75, 'عمولات بنكية', 5.75, 0, 164.48, 0, 0, 158.73, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 407),
(430, 'Journal', 151, NULL, 160, 1, NULL, NULL, 115, 'عمران - سداد فاتورة جوال المكتب 115 ريال', 115, 0, 160340.1, 0, 0, 160225.1, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 408),
(431, 'Journal', 151, NULL, 160, 1, NULL, NULL, 0.58, 'عمولات بنكية', 0.58, 0, 160340.68, 0, 0, 160340.1, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 409),
(432, 'Journal', 151, NULL, 160, 1, NULL, NULL, 600, 'فاطمه عطيه حزيم العنزي - سداد الإقامة - العاملة نقل الي العميل حنان حليس الشمري مسدد 2000 ريال باقي 7000 تم اصدار كمبيالة', 0, 600, 159740.68, 0, 0, 160340.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 410),
(433, 'Journal', 151, NULL, 160, 1, NULL, NULL, 300, 'وكالة أسبوع الطيران - تذكرة سفر - عاملة يوسف سطام العنزي الي سكاكا العميل مسدد 10000 ريال باقي 9000 (سعود وارد الرويلي)', 0, 300, 159440.68, 0, 0, 159740.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 411),
(434, 'Journal', 151, NULL, 160, 1, NULL, NULL, 115, 'خليل - سداد فاتورة جوال المكتب 115 ريال', 0, 115, 159325.68, 0, 0, 159440.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 412),
(435, 'Journal', 151, NULL, 160, 1, NULL, NULL, 200, 'ابوفواز - سداد فاتورة جوال المكتب 200', 0, 200, 159125.68, 0, 0, 159325.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 413),
(436, 'Journal', 151, NULL, 160, 1, NULL, NULL, 840, 'مندوبة الفلبين ANALYN FISHER - ادخال 3عقود للبولو1متميز +2 امتياز (عبدالله لواص+وليد العتيبي+خالد الريض)', 0, 840, 158285.68, 0, 0, 159125.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 414),
(437, 'Journal', 151, NULL, 160, 1, NULL, NULL, 129, 'اسامه - ضيافه مكتب أبو ريان وتم الاتفاق معاه علي العمل مرة اخري علي 600 دولار', 0, 129, 158156.68, 0, 0, 158285.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 415),
(438, 'Journal', 151, NULL, 160, 1, NULL, NULL, 230, 'اسامه - سداد فاتورة جوال المكتب 230 ريال', 0, 230, 157926.68, 0, 0, 158156.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 416),
(439, 'Journal', 151, NULL, 160, 1, NULL, NULL, 49890, 'سداد باقي فاتورة مكتب قولدن سيزون اثيوبيا', 0, 49890, 108036.68, 0, 0, 157926.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 417),
(440, 'Journal', 151, NULL, 160, 1, NULL, NULL, 5.75, 'عمولات بنكية', 0, 5.75, 108030.93, 0, 0, 108036.68, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 418),
(441, 'Journal', 151, NULL, 160, 1, NULL, NULL, 115, 'عمران - سداد فاتورة جوال المكتب 115 ريال', 0, 115, 107915.93, 0, 0, 108030.93, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 419),
(442, 'Journal', 151, NULL, 160, 1, NULL, NULL, 0.58, 'عمولات بنكية', 0, 0.58, 107915.35, 0, 0, 107915.93, '0', '2025-10-22', NULL, NULL, NULL, NULL, '2025-11-12 17:10:14', '2025-11-12 17:10:14', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, 420),
(443, '1', 18, NULL, 160, 1, NULL, NULL, 0, 'قيد رصيد افتتاحي (تسجيل أول مرة)', 0, 0, 0, 0, 0, 0, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-12-28 02:05:42', '2025-12-28 02:05:42', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL),
(444, '1', 297, NULL, 160, 1, NULL, NULL, 0, 'قيد رصيد افتتاحي (تسجيل أول مرة) (مقابل الممتلكات والمعدات)', 0, 0, -1908072.82, 0, 0, -1908072.82, '0', '2025-01-01', NULL, NULL, NULL, NULL, '2025-12-28 02:05:42', '2025-12-28 02:05:42', NULL, 1, NULL, NULL, 0, NULL, NULL, 1, 1, NULL, NULL, NULL, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `transfers`
--

CREATE TABLE `transfers` (
  `id` int(11) NOT NULL,
  `transfer_number` varchar(50) NOT NULL,
  `source_branch_id` int(11) NOT NULL,
  `destination_branch_id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `account_id_to` int(11) NOT NULL,
  `total_amount` decimal(10,2) NOT NULL,
  `created_by` int(11) NOT NULL,
  `approved_by` int(11) DEFAULT NULL,
  `status` enum('pending','approved','rejected') DEFAULT 'pending',
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `transfer_items`
--

CREATE TABLE `transfer_items` (
  `id` int(11) NOT NULL,
  `transfer_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity` decimal(10,2) NOT NULL,
  `unit` varchar(50) NOT NULL,
  `cost` decimal(10,2) DEFAULT NULL,
  `total_cost` decimal(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `units`
--

CREATE TABLE `units` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local_id` bigint(20) NOT NULL,
  `unit_type` varchar(255) NOT NULL,
  `insert_flag` tinyint(4) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `update_flag` tinyint(4) DEFAULT 0,
  `updated_at` timestamp NULL DEFAULT NULL,
  `company_id` bigint(20) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `visitors`
--

CREATE TABLE `visitors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED NOT NULL,
  `note` text DEFAULT NULL,
  `date` date NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `work_centers`
--

CREATE TABLE `work_centers` (
  `id` bigint(20) UNSIGNED NOT NULL COMMENT 'المفتاح الأساسي لمركز العمل',
  `name` varchar(100) NOT NULL COMMENT 'اسم مركز العمل/الآلة',
  `description` text DEFAULT NULL COMMENT 'وصف تفصيلي أو ملاحظات عن المركز',
  `capacity_per_day` decimal(8,2) DEFAULT NULL COMMENT 'ساعات العمل المتاحة في اليوم',
  `cost_per_hour` decimal(10,2) DEFAULT NULL COMMENT 'تكلفة التشغيل لكل ساعة',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `branch_id` bigint(20) UNSIGNED DEFAULT NULL COMMENT 'الفرع/الموقع الذي ينتمي إليه المركز'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `accounts`
--
ALTER TABLE `accounts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_admins_department_id` (`department_id`),
  ADD KEY `idx_admins_manager_id` (`manager_id`);

--
-- Indexes for table `admin_details`
--
ALTER TABLE `admin_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `admin_sellers`
--
ALTER TABLE `admin_sellers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `application_status_history`
--
ALTER TABLE `application_status_history`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `approvals`
--
ALTER TABLE `approvals`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_approvals_requester` (`requested_by`),
  ADD KEY `fk_approvals_approver` (`approver_id`),
  ADD KEY `idx_approvals_target` (`approvable_type`,`approvable_id`),
  ADD KEY `idx_approvals_status` (`status`);

--
-- Indexes for table `archived_product_logs`
--
ALTER TABLE `archived_product_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_product_id` (`product_id`),
  ADD KEY `idx_branch_id` (`branch_id`);

--
-- Indexes for table `archived_stock_batches`
--
ALTER TABLE `archived_stock_batches`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_product_branch` (`product_id`,`branch_id`);

--
-- Indexes for table `assets`
--
ALTER TABLE `assets`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `attendances`
--
ALTER TABLE `attendances`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `bills_of_materials`
--
ALTER TABLE `bills_of_materials`
  ADD PRIMARY KEY (`id`),
  ADD KEY `bom_product_idx` (`product_id`);

--
-- Indexes for table `bom_components`
--
ALTER TABLE `bom_components`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_bom_components_bom_id` (`bom_id`),
  ADD KEY `idx_bom_components_component_product_id` (`component_product_id`);

--
-- Indexes for table `branches`
--
ALTER TABLE `branches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `business_settings`
--
ALTER TABLE `business_settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `call_logs`
--
ALTER TABLE `call_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_calllogs_lead` (`lead_id`),
  ADD KEY `idx_calllogs_admin` (`admin_id`),
  ADD KEY `idx_calllogs_outcome` (`outcome_id`),
  ADD KEY `idx_calllogs_time` (`started_at`);

--
-- Indexes for table `call_outcomes`
--
ALTER TABLE `call_outcomes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `clients`
--
ALTER TABLE `clients`
  ADD PRIMARY KEY (`id`),
  ADD KEY `clients_account_id_foreign` (`account_id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_comments_admin` (`admin_id`),
  ADD KEY `idx_comments_entity` (`entity_type`,`entity_id`);
ALTER TABLE `comments` ADD FULLTEXT KEY `ft_comments_body` (`body`);

--
-- Indexes for table `companies`
--
ALTER TABLE `companies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `confirm_stocks`
--
ALTER TABLE `confirm_stocks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `stock_id` (`product_id`),
  ADD KEY `confirm_stocks_ibfk_1` (`seller_id`);

--
-- Indexes for table `contracts`
--
ALTER TABLE `contracts`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `contracts_contract_number_unique` (`contract_number`),
  ADD KEY `contracts_client_id_foreign` (`client_id`),
  ADD KEY `contracts_receivable_account_id_foreign` (`receivable_account_id`),
  ADD KEY `contracts_revenue_account_id_foreign` (`revenue_account_id`);

--
-- Indexes for table `cost_centers`
--
ALTER TABLE `cost_centers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `coupons`
--
ALTER TABLE `coupons`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `course_sellers`
--
ALTER TABLE `course_sellers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `currencies`
--
ALTER TABLE `currencies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `current_orders`
--
ALTER TABLE `current_orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `stock_id` (`stock_id`);

--
-- Indexes for table `current_reserve_products`
--
ALTER TABLE `current_reserve_products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_id` (`seller_id`),
  ADD KEY `customer_id` (`customer_id`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customer_prices`
--
ALTER TABLE `customer_prices`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_id` (`product_id`),
  ADD KEY `customer_id` (`customer_id`);

--
-- Indexes for table `customer_products`
--
ALTER TABLE `customer_products`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `custom_fields`
--
ALTER TABLE `custom_fields`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `custom_fields_key_unique` (`key`),
  ADD KEY `custom_fields_applies_to_is_active_sort_order_index` (`applies_to`,`is_active`,`sort_order`);

--
-- Indexes for table `custom_field_values`
--
ALTER TABLE `custom_field_values`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `cf_unique_per_model` (`custom_field_id`,`fieldable_type`,`fieldable_id`),
  ADD KEY `custom_field_values_fieldable_type_fieldable_id_index` (`fieldable_type`,`fieldable_id`);

--
-- Indexes for table `departments`
--
ALTER TABLE `departments`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_departments_code` (`code`),
  ADD KEY `idx_departments_parent` (`parent_id`),
  ADD KEY `idx_departments_active` (`active`),
  ADD KEY `idx_departments_level` (`level`);

--
-- Indexes for table `develop_sellers`
--
ALTER TABLE `develop_sellers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `expenses`
--
ALTER TABLE `expenses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `faqs`
--
ALTER TABLE `faqs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `follow_ups`
--
ALTER TABLE `follow_ups`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_fu_task` (`task_id`),
  ADD KEY `fk_fu_project` (`project_id`),
  ADD KEY `fk_fu_lead` (`lead_id`),
  ADD KEY `fk_fu_creator` (`created_by`),
  ADD KEY `idx_fu_next` (`next_follow_up_at`),
  ADD KEY `idx_fu_status` (`status`),
  ADD KEY `idx_fu_owner` (`assigned_to`);

--
-- Indexes for table `guarantors`
--
ALTER TABLE `guarantors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `history_installments`
--
ALTER TABLE `history_installments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_id` (`seller_id`),
  ADD KEY `customer_id` (`customer_id`);

--
-- Indexes for table `history_transections`
--
ALTER TABLE `history_transections`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_id` (`seller_id`);

--
-- Indexes for table `installments`
--
ALTER TABLE `installments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_id` (`seller_id`),
  ADD KEY `customer_id` (`customer_id`);

--
-- Indexes for table `installment_contracts`
--
ALTER TABLE `installment_contracts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `interview_evaluations`
--
ALTER TABLE `interview_evaluations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `job_applicant_id` (`job_applicant_id`);

--
-- Indexes for table `inventory_adjustments`
--
ALTER TABLE `inventory_adjustments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_branch_id` (`branch_id`),
  ADD KEY `idx_inventory_count_id` (`inventory_count_id`);

--
-- Indexes for table `inventory_adjustment_items`
--
ALTER TABLE `inventory_adjustment_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_adjustment_id` (`inventory_adjustment_id`),
  ADD KEY `idx_product_id` (`product_id`);

--
-- Indexes for table `inventory_counts`
--
ALTER TABLE `inventory_counts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_branch_id` (`branch_id`);

--
-- Indexes for table `inventory_count_items`
--
ALTER TABLE `inventory_count_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_inventory_count_id` (`inventory_count_id`),
  ADD KEY `idx_product_id` (`product_id`);

--
-- Indexes for table `job_applicants`
--
ALTER TABLE `job_applicants`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `journal_entries`
--
ALTER TABLE `journal_entries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `journal_entries_details`
--
ALTER TABLE `journal_entries_details`
  ADD PRIMARY KEY (`id`),
  ADD KEY `journal_entry_id` (`journal_entry_id`);

--
-- Indexes for table `leads`
--
ALTER TABLE `leads`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_leads_status` (`status_id`),
  ADD KEY `idx_leads_source` (`source_id`),
  ADD KEY `idx_leads_owner` (`owner_id`),
  ADD KEY `idx_leads_phone` (`phone_normalized`),
  ADD KEY `fk_leads_created_by` (`created_by_admin_id`),
  ADD KEY `fk_leads_updated_by` (`updated_by_admin_id`);

--
-- Indexes for table `lead_assignments`
--
ALTER TABLE `lead_assignments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_la_lead` (`lead_id`),
  ADD KEY `idx_la_to` (`assigned_to_admin_id`),
  ADD KEY `idx_la_by` (`assigned_by_admin_id`);

--
-- Indexes for table `lead_notes`
--
ALTER TABLE `lead_notes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_leadnotes_lead` (`lead_id`),
  ADD KEY `idx_leadnotes_admin` (`admin_id`);

--
-- Indexes for table `lead_sources`
--
ALTER TABLE `lead_sources`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`);

--
-- Indexes for table `lead_statuses`
--
ALTER TABLE `lead_statuses`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`);

--
-- Indexes for table `lead_tasks`
--
ALTER TABLE `lead_tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_tasks_lead` (`lead_id`),
  ADD KEY `idx_tasks_due` (`due_at`),
  ADD KEY `idx_tasks_assg` (`assigned_to_id`),
  ADD KEY `fk_tasks_crby` (`created_by_id`);

--
-- Indexes for table `maintenance_logs`
--
ALTER TABLE `maintenance_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_notifications_user` (`user_id`),
  ADD KEY `idx_notifications_type` (`type`),
  ADD KEY `idx_notifications_read` (`read_at`);

--
-- Indexes for table `oauth_access_tokens`
--
ALTER TABLE `oauth_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD KEY `oauth_access_tokens_user_id_index` (`user_id`);

--
-- Indexes for table `oauth_auth_codes`
--
ALTER TABLE `oauth_auth_codes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `oauth_auth_codes_user_id_index` (`user_id`);

--
-- Indexes for table `oauth_clients`
--
ALTER TABLE `oauth_clients`
  ADD PRIMARY KEY (`id`),
  ADD KEY `oauth_clients_user_id_index` (`user_id`);

--
-- Indexes for table `oauth_personal_access_clients`
--
ALTER TABLE `oauth_personal_access_clients`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `oauth_refresh_tokens`
--
ALTER TABLE `oauth_refresh_tokens`
  ADD PRIMARY KEY (`id`),
  ADD KEY `oauth_refresh_tokens_access_token_id_index` (`access_token_id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `stock_id` (`stock_id`);

--
-- Indexes for table `order_details`
--
ALTER TABLE `order_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_detail_notifications`
--
ALTER TABLE `order_detail_notifications`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_notifications`
--
ALTER TABLE `order_notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `stock_id` (`stock_id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `payment_vouchers`
--
ALTER TABLE `payment_vouchers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `pos_sessions`
--
ALTER TABLE `pos_sessions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `production_orders`
--
ALTER TABLE `production_orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `production_order_batches`
--
ALTER TABLE `production_order_batches`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_pob_prod_order` (`production_order_id`),
  ADD KEY `idx_pob_stock_batch` (`stock_batch_id`);

--
-- Indexes for table `production_order_executions`
--
ALTER TABLE `production_order_executions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_po_id` (`production_order_id`),
  ADD KEY `idx_branch_id` (`branch_id`),
  ADD KEY `idx_executed_by` (`executed_by`);

--
-- Indexes for table `production_order_execution_items`
--
ALTER TABLE `production_order_execution_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_exec_id` (`execution_id`),
  ADD KEY `idx_product_id` (`product_id`);

--
-- Indexes for table `production_order_logs`
--
ALTER TABLE `production_order_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `production_order_id` (`production_order_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_expires`
--
ALTER TABLE `product_expires`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_logs`
--
ALTER TABLE `product_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `projects`
--
ALTER TABLE `projects`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`),
  ADD KEY `idx_projects_status` (`status_id`),
  ADD KEY `idx_projects_owner` (`owner_id`),
  ADD KEY `idx_projects_lead` (`lead_id`),
  ADD KEY `idx_projects_dates` (`start_date`,`due_date`),
  ADD KEY `idx_projects_active` (`active`),
  ADD KEY `idx_projects_code_name` (`code`,`name`);

--
-- Indexes for table `project_members`
--
ALTER TABLE `project_members`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_pm_unique` (`project_id`,`admin_id`),
  ADD KEY `fk_pm_admin` (`admin_id`),
  ADD KEY `fk_pm_added` (`added_by`),
  ADD KEY `idx_pm_role` (`role`);

--
-- Indexes for table `quotations`
--
ALTER TABLE `quotations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quotation_details`
--
ALTER TABLE `quotation_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `regions`
--
ALTER TABLE `regions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `reserve_products`
--
ALTER TABLE `reserve_products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_id` (`seller_id`);

--
-- Indexes for table `reserve_product_notifications`
--
ALTER TABLE `reserve_product_notifications`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `result_visitors`
--
ALTER TABLE `result_visitors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `routings`
--
ALTER TABLE `routings`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_routings_bom_id` (`bom_id`);

--
-- Indexes for table `routing_operations`
--
ALTER TABLE `routing_operations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_routing_ops_routing_id` (`routing_id`),
  ADD KEY `idx_routing_ops_work_center_id` (`work_center_id`);

--
-- Indexes for table `salaries`
--
ALTER TABLE `salaries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `scheduled_installments`
--
ALTER TABLE `scheduled_installments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `contract_id` (`contract_id`);

--
-- Indexes for table `seller_categories`
--
ALTER TABLE `seller_categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cat_id` (`cat_id`),
  ADD KEY `seller_categories_ibfk_2` (`seller_id`);

--
-- Indexes for table `seller_customers`
--
ALTER TABLE `seller_customers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `customer_id` (`customer_id`),
  ADD KEY `seller_id` (`seller_id`);

--
-- Indexes for table `seller_prices`
--
ALTER TABLE `seller_prices`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_id` (`product_id`),
  ADD KEY `seller_id` (`seller_id`);

--
-- Indexes for table `seller_regions`
--
ALTER TABLE `seller_regions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `region_id` (`region_id`),
  ADD KEY `seller_regions_ibfk_1` (`seller_id`);

--
-- Indexes for table `shifts`
--
ALTER TABLE `shifts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `soft_credentials`
--
ALTER TABLE `soft_credentials`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `statuses`
--
ALTER TABLE `statuses`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`),
  ADD KEY `idx_statuses_active` (`active`),
  ADD KEY `idx_statuses_sort` (`sort_order`),
  ADD KEY `idx_statuses_name` (`name`);

--
-- Indexes for table `stocks`
--
ALTER TABLE `stocks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_id` (`product_id`),
  ADD KEY `stocks_ibfk_1` (`seller_id`);

--
-- Indexes for table `stock_batches`
--
ALTER TABLE `stock_batches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `stock_histories`
--
ALTER TABLE `stock_histories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `stock_id` (`product_id`),
  ADD KEY `confirm_stocks_ibfk_1` (`seller_id`),
  ADD KEY `order_id` (`order_id`);

--
-- Indexes for table `stock_orders`
--
ALTER TABLE `stock_orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `storages`
--
ALTER TABLE `storages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `storage_sellers`
--
ALTER TABLE `storage_sellers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `storage_id` (`storage_id`),
  ADD KEY `seller_id` (`seller_id`);

--
-- Indexes for table `stores`
--
ALTER TABLE `stores`
  ADD PRIMARY KEY (`store_id`),
  ADD KEY `seller_id` (`seller_id`);

--
-- Indexes for table `sub_units`
--
ALTER TABLE `sub_units`
  ADD PRIMARY KEY (`id`),
  ADD KEY `unit_id` (`unit_id`);

--
-- Indexes for table `suppliers`
--
ALTER TABLE `suppliers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `system_logs`
--
ALTER TABLE `system_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_logs_actor` (`actor_admin_id`),
  ADD KEY `idx_logs_lead` (`lead_id`),
  ADD KEY `idx_logs_table` (`table_name`,`record_id`),
  ADD KEY `idx_logs_action` (`action`);

--
-- Indexes for table `tasks`
--
ALTER TABLE `tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_tasks_project` (`project_id`),
  ADD KEY `idx_tasks_lead` (`lead_id`),
  ADD KEY `idx_tasks_priority` (`priority`),
  ADD KEY `idx_tasks_due` (`due_at`),
  ADD KEY `idx_tasks_approval` (`approval_required`,`approval_status`);
ALTER TABLE `tasks` ADD FULLTEXT KEY `ft_tasks_txt` (`title`,`description`);

--
-- Indexes for table `task_assignees`
--
ALTER TABLE `task_assignees`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_ta_unique` (`task_id`,`admin_id`,`role`),
  ADD KEY `fk_ta_admin` (`admin_id`),
  ADD KEY `fk_ta_by` (`assigned_by`),
  ADD KEY `idx_ta_due` (`due_at`),
  ADD KEY `idx_ta_role` (`role`),
  ADD KEY `idx_ta_priority` (`priority`);

--
-- Indexes for table `taxes`
--
ALTER TABLE `taxes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tickets`
--
ALTER TABLE `tickets`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`),
  ADD KEY `idx_approved_status` (`approved_status`),
  ADD KEY `idx_is_resolved` (`is_resolved`),
  ADD KEY `idx_created_by` (`created_by`),
  ADD KEY `idx_resolved_by` (`resolved_by`),
  ADD KEY `idx_approved_by` (`approved_by`);

--
-- Indexes for table `ticket_assignees`
--
ALTER TABLE `ticket_assignees`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_ticket_admin_once` (`ticket_id`,`admin_id`,`is_active`),
  ADD KEY `idx_ticket_active` (`ticket_id`,`is_active`),
  ADD KEY `idx_admin` (`admin_id`);

--
-- Indexes for table `ticket_comments`
--
ALTER TABLE `ticket_comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_ticket` (`ticket_id`),
  ADD KEY `idx_admin` (`admin_id`);

--
-- Indexes for table `transaction_sellers`
--
ALTER TABLE `transaction_sellers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `transections`
--
ALTER TABLE `transections`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_id` (`seller_id`);

--
-- Indexes for table `transfers`
--
ALTER TABLE `transfers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_source_branch` (`source_branch_id`),
  ADD KEY `idx_destination_branch` (`destination_branch_id`),
  ADD KEY `idx_account` (`account_id`),
  ADD KEY `idx_account_to` (`account_id_to`);

--
-- Indexes for table `transfer_items`
--
ALTER TABLE `transfer_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `transfer_id` (`transfer_id`),
  ADD KEY `idx_product` (`product_id`);

--
-- Indexes for table `units`
--
ALTER TABLE `units`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `visitors`
--
ALTER TABLE `visitors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `work_centers`
--
ALTER TABLE `work_centers`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `accounts`
--
ALTER TABLE `accounts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=373;

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=167;

--
-- AUTO_INCREMENT for table `admin_details`
--
ALTER TABLE `admin_details`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `admin_sellers`
--
ALTER TABLE `admin_sellers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT for table `application_status_history`
--
ALTER TABLE `application_status_history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `approvals`
--
ALTER TABLE `approvals`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `archived_product_logs`
--
ALTER TABLE `archived_product_logs`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `archived_stock_batches`
--
ALTER TABLE `archived_stock_batches`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `assets`
--
ALTER TABLE `assets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `attendances`
--
ALTER TABLE `attendances`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `bills_of_materials`
--
ALTER TABLE `bills_of_materials`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `bom_components`
--
ALTER TABLE `bom_components`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'المفتاح الأساسي لكل مكون في قائمة المواد';

--
-- AUTO_INCREMENT for table `branches`
--
ALTER TABLE `branches`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `brands`
--
ALTER TABLE `brands`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `business_settings`
--
ALTER TABLE `business_settings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `call_logs`
--
ALTER TABLE `call_logs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `call_outcomes`
--
ALTER TABLE `call_outcomes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `clients`
--
ALTER TABLE `clients`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `companies`
--
ALTER TABLE `companies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `confirm_stocks`
--
ALTER TABLE `confirm_stocks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=220;

--
-- AUTO_INCREMENT for table `contracts`
--
ALTER TABLE `contracts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `cost_centers`
--
ALTER TABLE `cost_centers`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `coupons`
--
ALTER TABLE `coupons`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `course_sellers`
--
ALTER TABLE `course_sellers`
  MODIFY `id` int(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `currencies`
--
ALTER TABLE `currencies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=120;

--
-- AUTO_INCREMENT for table `current_orders`
--
ALTER TABLE `current_orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `current_reserve_products`
--
ALTER TABLE `current_reserve_products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `customer_prices`
--
ALTER TABLE `customer_prices`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `customer_products`
--
ALTER TABLE `customer_products`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `custom_fields`
--
ALTER TABLE `custom_fields`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `custom_field_values`
--
ALTER TABLE `custom_field_values`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `departments`
--
ALTER TABLE `departments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `develop_sellers`
--
ALTER TABLE `develop_sellers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `expenses`
--
ALTER TABLE `expenses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `faqs`
--
ALTER TABLE `faqs`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=297;

--
-- AUTO_INCREMENT for table `follow_ups`
--
ALTER TABLE `follow_ups`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `guarantors`
--
ALTER TABLE `guarantors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `history_installments`
--
ALTER TABLE `history_installments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `history_transections`
--
ALTER TABLE `history_transections`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `installments`
--
ALTER TABLE `installments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `installment_contracts`
--
ALTER TABLE `installment_contracts`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `interview_evaluations`
--
ALTER TABLE `interview_evaluations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `inventory_adjustments`
--
ALTER TABLE `inventory_adjustments`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `inventory_adjustment_items`
--
ALTER TABLE `inventory_adjustment_items`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `inventory_counts`
--
ALTER TABLE `inventory_counts`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `inventory_count_items`
--
ALTER TABLE `inventory_count_items`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `job_applicants`
--
ALTER TABLE `job_applicants`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `journal_entries`
--
ALTER TABLE `journal_entries`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT for table `journal_entries_details`
--
ALTER TABLE `journal_entries_details`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=421;

--
-- AUTO_INCREMENT for table `leads`
--
ALTER TABLE `leads`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `lead_assignments`
--
ALTER TABLE `lead_assignments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `lead_notes`
--
ALTER TABLE `lead_notes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `lead_sources`
--
ALTER TABLE `lead_sources`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `lead_statuses`
--
ALTER TABLE `lead_statuses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `lead_tasks`
--
ALTER TABLE `lead_tasks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `maintenance_logs`
--
ALTER TABLE `maintenance_logs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT for table `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `oauth_clients`
--
ALTER TABLE `oauth_clients`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `oauth_personal_access_clients`
--
ALTER TABLE `oauth_personal_access_clients`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `order_details`
--
ALTER TABLE `order_details`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `order_detail_notifications`
--
ALTER TABLE `order_detail_notifications`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `order_notifications`
--
ALTER TABLE `order_notifications`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payment_vouchers`
--
ALTER TABLE `payment_vouchers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pos_sessions`
--
ALTER TABLE `pos_sessions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `production_orders`
--
ALTER TABLE `production_orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'المفتاح الأساسي';

--
-- AUTO_INCREMENT for table `production_order_batches`
--
ALTER TABLE `production_order_batches`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'المفتاح الأساسي لكل ربط';

--
-- AUTO_INCREMENT for table `production_order_executions`
--
ALTER TABLE `production_order_executions`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `production_order_execution_items`
--
ALTER TABLE `production_order_execution_items`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `production_order_logs`
--
ALTER TABLE `production_order_logs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `product_expires`
--
ALTER TABLE `product_expires`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `product_logs`
--
ALTER TABLE `product_logs`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `projects`
--
ALTER TABLE `projects`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `project_members`
--
ALTER TABLE `project_members`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `quotations`
--
ALTER TABLE `quotations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quotation_details`
--
ALTER TABLE `quotation_details`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `regions`
--
ALTER TABLE `regions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `reserve_products`
--
ALTER TABLE `reserve_products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `reserve_product_notifications`
--
ALTER TABLE `reserve_product_notifications`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `result_visitors`
--
ALTER TABLE `result_visitors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `routings`
--
ALTER TABLE `routings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'المفتاح الأساسي لكل مسار تشغيل';

--
-- AUTO_INCREMENT for table `routing_operations`
--
ALTER TABLE `routing_operations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'المفتاح الأساسي لكل خطوة تشغيل';

--
-- AUTO_INCREMENT for table `salaries`
--
ALTER TABLE `salaries`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `scheduled_installments`
--
ALTER TABLE `scheduled_installments`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT for table `seller_categories`
--
ALTER TABLE `seller_categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=665;

--
-- AUTO_INCREMENT for table `seller_customers`
--
ALTER TABLE `seller_customers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5783;

--
-- AUTO_INCREMENT for table `seller_prices`
--
ALTER TABLE `seller_prices`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `seller_regions`
--
ALTER TABLE `seller_regions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=425;

--
-- AUTO_INCREMENT for table `shifts`
--
ALTER TABLE `shifts`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `soft_credentials`
--
ALTER TABLE `soft_credentials`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `statuses`
--
ALTER TABLE `statuses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `stocks`
--
ALTER TABLE `stocks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2472;

--
-- AUTO_INCREMENT for table `stock_batches`
--
ALTER TABLE `stock_batches`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `stock_histories`
--
ALTER TABLE `stock_histories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `stock_orders`
--
ALTER TABLE `stock_orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `storages`
--
ALTER TABLE `storages`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- AUTO_INCREMENT for table `storage_sellers`
--
ALTER TABLE `storage_sellers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=99;

--
-- AUTO_INCREMENT for table `stores`
--
ALTER TABLE `stores`
  MODIFY `store_id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT for table `sub_units`
--
ALTER TABLE `sub_units`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `suppliers`
--
ALTER TABLE `suppliers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `system_logs`
--
ALTER TABLE `system_logs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=190;

--
-- AUTO_INCREMENT for table `tasks`
--
ALTER TABLE `tasks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `task_assignees`
--
ALTER TABLE `task_assignees`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `taxes`
--
ALTER TABLE `taxes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `tickets`
--
ALTER TABLE `tickets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `ticket_assignees`
--
ALTER TABLE `ticket_assignees`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `ticket_comments`
--
ALTER TABLE `ticket_comments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `transaction_sellers`
--
ALTER TABLE `transaction_sellers`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `transections`
--
ALTER TABLE `transections`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=445;

--
-- AUTO_INCREMENT for table `transfers`
--
ALTER TABLE `transfers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `transfer_items`
--
ALTER TABLE `transfer_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `units`
--
ALTER TABLE `units`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `visitors`
--
ALTER TABLE `visitors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `work_centers`
--
ALTER TABLE `work_centers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'المفتاح الأساسي لمركز العمل';

--
-- Constraints for dumped tables
--

--
-- Constraints for table `admins`
--
ALTER TABLE `admins`
  ADD CONSTRAINT `fk_admins_department` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_admins_manager` FOREIGN KEY (`manager_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `approvals`
--
ALTER TABLE `approvals`
  ADD CONSTRAINT `fk_approvals_approver` FOREIGN KEY (`approver_id`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_approvals_requester` FOREIGN KEY (`requested_by`) REFERENCES `admins` (`id`);

--
-- Constraints for table `call_logs`
--
ALTER TABLE `call_logs`
  ADD CONSTRAINT `fk_calllogs_admin` FOREIGN KEY (`admin_id`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_calllogs_lead` FOREIGN KEY (`lead_id`) REFERENCES `leads` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_calllogs_outcome` FOREIGN KEY (`outcome_id`) REFERENCES `call_outcomes` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `clients`
--
ALTER TABLE `clients`
  ADD CONSTRAINT `clients_account_id_foreign` FOREIGN KEY (`account_id`) REFERENCES `accounts` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `fk_comments_admin` FOREIGN KEY (`admin_id`) REFERENCES `admins` (`id`);

--
-- Constraints for table `confirm_stocks`
--
ALTER TABLE `confirm_stocks`
  ADD CONSTRAINT `confirm_stocks_ibfk_1` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `confirm_stocks_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `contracts`
--
ALTER TABLE `contracts`
  ADD CONSTRAINT `contracts_client_id_foreign` FOREIGN KEY (`client_id`) REFERENCES `clients` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `contracts_receivable_account_id_foreign` FOREIGN KEY (`receivable_account_id`) REFERENCES `accounts` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `contracts_revenue_account_id_foreign` FOREIGN KEY (`revenue_account_id`) REFERENCES `accounts` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `customer_prices`
--
ALTER TABLE `customer_prices`
  ADD CONSTRAINT `customer_prices_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `customer_prices_ibfk_2` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `custom_field_values`
--
ALTER TABLE `custom_field_values`
  ADD CONSTRAINT `custom_field_values_custom_field_id_foreign` FOREIGN KEY (`custom_field_id`) REFERENCES `custom_fields` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `departments`
--
ALTER TABLE `departments`
  ADD CONSTRAINT `fk_departments_parent` FOREIGN KEY (`parent_id`) REFERENCES `departments` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Constraints for table `follow_ups`
--
ALTER TABLE `follow_ups`
  ADD CONSTRAINT `fk_fu_creator` FOREIGN KEY (`created_by`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_fu_lead` FOREIGN KEY (`lead_id`) REFERENCES `leads` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_fu_owner` FOREIGN KEY (`assigned_to`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_fu_project` FOREIGN KEY (`project_id`) REFERENCES `projects` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_fu_task` FOREIGN KEY (`task_id`) REFERENCES `tasks` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `installments`
--
ALTER TABLE `installments`
  ADD CONSTRAINT `installments_ibfk_1` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `interview_evaluations`
--
ALTER TABLE `interview_evaluations`
  ADD CONSTRAINT `interview_evaluations_ibfk_1` FOREIGN KEY (`job_applicant_id`) REFERENCES `job_applicants` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `journal_entries_details`
--
ALTER TABLE `journal_entries_details`
  ADD CONSTRAINT `journal_entries_details_ibfk_1` FOREIGN KEY (`journal_entry_id`) REFERENCES `journal_entries` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `leads`
--
ALTER TABLE `leads`
  ADD CONSTRAINT `fk_leads_created_by` FOREIGN KEY (`created_by_admin_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_leads_owner` FOREIGN KEY (`owner_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_leads_source` FOREIGN KEY (`source_id`) REFERENCES `lead_sources` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_leads_status` FOREIGN KEY (`status_id`) REFERENCES `lead_statuses` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_leads_updated_by` FOREIGN KEY (`updated_by_admin_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `lead_assignments`
--
ALTER TABLE `lead_assignments`
  ADD CONSTRAINT `fk_la_by` FOREIGN KEY (`assigned_by_admin_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_la_lead` FOREIGN KEY (`lead_id`) REFERENCES `leads` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_la_to` FOREIGN KEY (`assigned_to_admin_id`) REFERENCES `admins` (`id`);

--
-- Constraints for table `lead_notes`
--
ALTER TABLE `lead_notes`
  ADD CONSTRAINT `fk_leadnotes_admin` FOREIGN KEY (`admin_id`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_leadnotes_lead` FOREIGN KEY (`lead_id`) REFERENCES `leads` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `lead_tasks`
--
ALTER TABLE `lead_tasks`
  ADD CONSTRAINT `fk_tasks_assg` FOREIGN KEY (`assigned_to_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_tasks_crby` FOREIGN KEY (`created_by_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_tasks_lead` FOREIGN KEY (`lead_id`) REFERENCES `leads` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `fk_notifications_user` FOREIGN KEY (`user_id`) REFERENCES `admins` (`id`);

--
-- Constraints for table `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`stock_id`) REFERENCES `stocks` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `order_notifications`
--
ALTER TABLE `order_notifications`
  ADD CONSTRAINT `order_notifications_ibfk_1` FOREIGN KEY (`stock_id`) REFERENCES `stocks` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `projects`
--
ALTER TABLE `projects`
  ADD CONSTRAINT `fk_projects_lead` FOREIGN KEY (`lead_id`) REFERENCES `leads` (`id`),
  ADD CONSTRAINT `fk_projects_owner` FOREIGN KEY (`owner_id`) REFERENCES `admins` (`id`);

--
-- Constraints for table `project_members`
--
ALTER TABLE `project_members`
  ADD CONSTRAINT `fk_pm_added` FOREIGN KEY (`added_by`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_pm_admin` FOREIGN KEY (`admin_id`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_pm_project` FOREIGN KEY (`project_id`) REFERENCES `projects` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `reserve_products`
--
ALTER TABLE `reserve_products`
  ADD CONSTRAINT `reserve_products_ibfk_1` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `scheduled_installments`
--
ALTER TABLE `scheduled_installments`
  ADD CONSTRAINT `scheduled_installments_ibfk_1` FOREIGN KEY (`contract_id`) REFERENCES `installment_contracts` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `seller_categories`
--
ALTER TABLE `seller_categories`
  ADD CONSTRAINT `seller_categories_ibfk_1` FOREIGN KEY (`cat_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `seller_categories_ibfk_2` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `seller_customers`
--
ALTER TABLE `seller_customers`
  ADD CONSTRAINT `seller_customers_ibfk_1` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `seller_customers_ibfk_2` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `seller_prices`
--
ALTER TABLE `seller_prices`
  ADD CONSTRAINT `seller_prices_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `seller_prices_ibfk_2` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `seller_regions`
--
ALTER TABLE `seller_regions`
  ADD CONSTRAINT `seller_regions_ibfk_1` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `seller_regions_ibfk_2` FOREIGN KEY (`region_id`) REFERENCES `regions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `stocks`
--
ALTER TABLE `stocks`
  ADD CONSTRAINT `stocks_ibfk_1` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `stocks_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `stock_histories`
--
ALTER TABLE `stock_histories`
  ADD CONSTRAINT `stock_histories_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `stock_orders` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `storage_sellers`
--
ALTER TABLE `storage_sellers`
  ADD CONSTRAINT `storage_sellers_ibfk_1` FOREIGN KEY (`storage_id`) REFERENCES `storages` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `storage_sellers_ibfk_2` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `stores`
--
ALTER TABLE `stores`
  ADD CONSTRAINT `stores_ibfk_1` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `sub_units`
--
ALTER TABLE `sub_units`
  ADD CONSTRAINT `sub_units_ibfk_1` FOREIGN KEY (`unit_id`) REFERENCES `units` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `system_logs`
--
ALTER TABLE `system_logs`
  ADD CONSTRAINT `fk_logs_actor` FOREIGN KEY (`actor_admin_id`) REFERENCES `admins` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_logs_lead` FOREIGN KEY (`lead_id`) REFERENCES `leads` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `task_assignees`
--
ALTER TABLE `task_assignees`
  ADD CONSTRAINT `fk_ta_admin` FOREIGN KEY (`admin_id`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_ta_by` FOREIGN KEY (`assigned_by`) REFERENCES `admins` (`id`),
  ADD CONSTRAINT `fk_ta_task` FOREIGN KEY (`task_id`) REFERENCES `tasks` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `ticket_assignees`
--
ALTER TABLE `ticket_assignees`
  ADD CONSTRAINT `fk_ta_ticket` FOREIGN KEY (`ticket_id`) REFERENCES `tickets` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `ticket_comments`
--
ALTER TABLE `ticket_comments`
  ADD CONSTRAINT `fk_tc_ticket` FOREIGN KEY (`ticket_id`) REFERENCES `tickets` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `transections`
--
ALTER TABLE `transections`
  ADD CONSTRAINT `transections_ibfk_1` FOREIGN KEY (`seller_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `transfer_items`
--
ALTER TABLE `transfer_items`
  ADD CONSTRAINT `transfer_items_ibfk_1` FOREIGN KEY (`transfer_id`) REFERENCES `transfers` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
