<?php

namespace Database\Seeders\CrmAndLeads;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class LeadStatusesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::statement('SET FOREIGN_KEY_CHECKS=0;');
        DB::table('lead_statuses')->truncate();
        DB::statement('--
-- Dumping data for table `lead_statuses`
--

INSERT INTO `lead_statuses` (`id`, `name`, `code`, `sort_order`, `is_active`, `created_at`, `updated_at`) VALUES
(5, \'اصدار العقد\', \'1\', 100, 1, \'2025-09-09 17:57:24\', \'2025-09-09 17:57:24\'),
(6, \'انتظار موافقة مكتب الارسال الخارجي\', \'2\', 101, 1, \'2025-09-09 17:59:17\', \'2025-09-09 17:59:17\'),
(7, \'انتظار نتيجة الفحص الطبي\', \'3\', 102, 1, \'2025-09-09 17:59:43\', \'2025-09-09 17:59:43\'),
(8, \'انتظار موافقة وزارة العمل الخارجيه\', \'104\', 103, 1, \'2025-09-09 18:00:11\', \'2025-09-09 18:00:11\'),
(9, \'تصديق التاشيره\', \'105\', 104, 1, \'2025-09-09 18:01:13\', \'2025-09-09 18:01:13\'),
(10, \'انتظار الحصول علي شهادة التدريب المدرسي\', \'106\', 105, 1, \'2025-09-09 18:02:42\', \'2025-09-09 18:02:42\'),
(11, \'الحصول علي ورقة حسن السير والسلوك\', \'107\', 106, 1, \'2025-09-09 18:03:20\', \'2025-09-09 18:03:20\'),
(12, \'تم اصدار التاشيره\', \'108\', 109, 1, \'2025-09-09 18:04:32\', \'2025-09-09 18:04:32\'),
(13, \'الصحول علي تصريح السفر\', \'109\', 108, 1, \'2025-09-09 18:05:03\', \'2025-09-09 18:05:03\'),
(14, \'انتظار حجز التذكره\', \'110\', 109, 1, \'2025-09-09 18:05:20\', \'2025-09-09 18:08:04\'),
(15, \'موعد الوصول\', \'111\', 110, 1, \'2025-09-09 18:06:32\', \'2025-09-09 18:06:32\');');
        DB::statement('SET FOREIGN_KEY_CHECKS=1;');
    }
}
