<?php

namespace Database\Seeders\FinanceAndAccounting;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class JournalEntriesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::statement('SET FOREIGN_KEY_CHECKS=0;');
        DB::table('journal_entries')->truncate();
        DB::statement('--
-- Dumping data for table `journal_entries`
--

INSERT INTO `journal_entries` (`id`, `entry_date`, `reference`, `description`, `created_by`, `payment_voucher_id`, `type`, `branch_id`, `asset_id`, `reversal`, `created_at`, `updated_at`, `deleted_at`, `reversal_of_id`, `head_date`, `ref`) VALUES
(1, \'2025-01-01\', \'OB-20250911-182000-YIL8\', \'رصيد افتتاحي\', 160, NULL, \'1\', 1, NULL, 1, \'2025-09-11 18:20:00\', \'2025-09-13 14:40:16\', \'2025-09-13 14:40:16\', NULL, \'2025-09-11 15:20:00\', NULL),
(2, \'2025-01-01\', \'OB-20250911-183107-Q0S9\', \'رصيد افتتاحي\', 160, NULL, \'1\', 1, NULL, 1, \'2025-09-11 18:31:07\', \'2025-09-13 14:40:38\', \'2025-09-13 14:40:38\', NULL, \'2025-09-11 15:31:07\', NULL),
(3, \'2025-09-12\', NULL, \'صص\', 163, NULL, \'entry\', 1, NULL, 1, \'2025-09-12 14:24:05\', \'2025-09-12 14:30:32\', \'2025-09-12 14:30:32\', NULL, \'2025-09-12 11:24:05\', NULL),
(4, \'2025-09-13\', NULL, \'تست\', 163, NULL, \'entry\', 1, NULL, 1, \'2025-09-13 15:40:13\', \'2025-09-13 16:01:53\', \'2025-09-13 16:01:53\', NULL, \'2025-09-13 12:40:13\', NULL),
(5, \'2025-11-01\', NULL, \'حوالة ايراد مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:06:22\', \'2025-11-12 03:09:14\', \'2025-11-12 03:09:14\', NULL, \'2025-11-12 00:06:22\', NULL),
(6, \'2025-01-10\', NULL, \'حوالة ايراد مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:10:06\', \'2025-11-12 03:10:06\', NULL, NULL, \'2025-11-12 00:10:06\', NULL),
(7, \'2025-01-10\', NULL, \'ايراد من الاستقدام عوض\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:12:46\', \'2025-11-12 03:12:46\', NULL, NULL, \'2025-11-12 00:12:46\', NULL),
(8, \'2025-10-01\', NULL, \'ياسمين علي هادي - استلام سلسك - رسوم استلام عاملة هدي احمد عطيه بجازان 200 اتعاب المندوب + 239 قيمة التذكرة\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:34:44\', \'2025-11-12 03:34:44\', NULL, NULL, \'2025-11-12 00:34:44\', NULL),
(9, \'2025-10-01\', NULL, \'شحن نت سكن العاملات مكتب المتميز 287.5 ريال\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:35:59\', \'2025-11-12 03:35:59\', NULL, NULL, \'2025-11-12 00:35:59\', NULL),
(10, \'2025-10-01\', NULL, \'ابوفواز - ارسال عامله من الحفر الي الرياض -اثيوبيا عاملة ملاك محمد الشمري\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:40:05\', \'2025-11-12 03:40:05\', NULL, NULL, \'2025-11-12 00:40:05\', NULL),
(11, \'2025-10-01\', NULL, \'بدريه خيران عيفان الرشيدي - مطالبة مالية - تمت المفاهمه مع العميل ومستمر معنا وتخصم الغرامة علي مكتب سنترال بنجلادش\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:42:58\', \'2025-11-12 03:42:58\', NULL, NULL, \'2025-11-12 00:42:58\', NULL),
(12, \'2025-10-01\', NULL, \'ابوصقر - استلام 23 عاملة مرسلين من الحفر الي عرعر + ارسال عاملة الي الحفر\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:46:53\', \'2025-11-12 03:46:53\', NULL, NULL, \'2025-11-12 00:46:53\', NULL),
(13, \'2025-10-02\', NULL, \'ايراد من العميل فيصل\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:50:10\', \'2025-11-12 03:50:10\', NULL, NULL, \'2025-11-12 00:50:10\', NULL),
(14, \'2025-10-02\', NULL, \'عهدة البطاقة الائتمانية رقم 151\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:51:57\', \'2025-11-12 03:51:57\', NULL, NULL, \'2025-11-12 00:51:57\', NULL),
(15, \'2025-10-02\', NULL, \'فيصل قاسم بن محمد العنزي - سداد مساند - العميل مسدد 3500 ريال خصم خاص من ابوسلطان\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:53:10\', \'2025-11-12 03:53:10\', NULL, NULL, \'2025-11-12 00:53:10\', NULL),
(16, \'2025-10-02\', NULL, \'فيصل سالم سعيد القثمي - سداد الإقامة - العاملة معروضه نقل خدمات والعميل موقع علي إقرار نقل\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:56:35\', \'2025-11-12 03:56:35\', NULL, NULL, \'2025-11-12 00:56:35\', NULL),
(17, \'2025-10-05\', NULL, \'ايراد من العميلة غادة راشد\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 03:57:39\', \'2025-11-12 03:57:39\', NULL, NULL, \'2025-11-12 00:57:39\', NULL),
(18, \'2025-10-05\', NULL, \'عهدة فيزا 0236\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:00:19\', \'2025-11-12 04:00:19\', NULL, NULL, \'2025-11-12 01:00:19\', NULL),
(19, \'2025-10-05\', NULL, \'ابوفيصل - سداد فاتورة جوال المكتب\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:08:50\', \'2025-11-12 04:08:50\', NULL, NULL, \'2025-11-12 01:08:50\', NULL),
(20, \'2025-10-06\', NULL, \'دفعة من مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:14:05\', \'2025-11-12 04:14:05\', NULL, NULL, \'2025-11-12 01:14:05\', NULL),
(21, \'2025-10-07\', NULL, \'دفعة من مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:16:32\', \'2025-11-12 04:16:32\', NULL, NULL, \'2025-11-12 01:16:32\', NULL),
(22, \'2025-10-07\', NULL, \'عياس العيسي - تحويل مبلغ 35000 من مبلغ التقبيل مكتب الامتياز فرع الربوه متبقي نصف المبلغ\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:21:07\', \'2025-11-12 04:21:07\', NULL, NULL, \'2025-11-12 01:21:07\', NULL),
(23, \'2025-10-08\', NULL, \'دفعة من مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:26:18\', \'2025-11-12 04:26:18\', NULL, NULL, \'2025-11-12 01:26:18\', NULL),
(24, \'2025-10-08\', NULL, \'راكان نوار محمد المطيري - مطالبة مالية رجالية علي يوزر الامتياز\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:35:28\', \'2025-11-12 04:35:28\', NULL, NULL, \'2025-11-12 01:35:28\', NULL),
(25, \'2025-10-08\', NULL, \'مندوبة الفلبين ANALYN FISHER - ادخال 3 عقود للبولو2 امتياز+1 انجاز (نايف السيف+محمد سلمان+منال الحميد)\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:41:54\', \'2025-11-12 04:41:54\', NULL, NULL, \'2025-11-12 01:41:54\', NULL),
(26, \'2025-10-08\', NULL, \'رواتب مكتب الإنجاز شهر سبتمبر\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:54:49\', \'2025-11-12 04:54:49\', NULL, NULL, \'2025-11-12 01:54:49\', NULL),
(27, \'2025-10-08\', NULL, \'سداد دراسة الجدوى ترخيص مكتب العمل - يوسف سداد بطاقة ائتمانية 7808\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 04:56:25\', \'2025-11-12 04:56:25\', NULL, NULL, \'2025-11-12 01:56:25\', NULL),
(28, \'2025-10-09\', NULL, \'استرداد من الموظفة نجلاء\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 05:50:37\', \'2025-11-12 05:50:37\', NULL, NULL, \'2025-11-12 02:50:37\', NULL),
(29, \'2025-10-09\', NULL, \'تامينات مؤسسة سلطان\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:04:01\', \'2025-11-12 06:04:01\', NULL, NULL, \'2025-11-12 03:04:01\', NULL),
(30, \'2025-10-09\', NULL, \'عهدة فيزا رقم 9748\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:08:41\', \'2025-11-12 06:08:41\', NULL, NULL, \'2025-11-12 03:08:41\', NULL),
(31, \'2025-10-11\', NULL, \'عهدة فيزا 9151\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:14:45\', \'2025-11-12 06:14:45\', NULL, NULL, \'2025-11-12 03:14:45\', NULL),
(32, \'2025-10-12\', NULL, \'محمود عاصم - طباعة خطه العمل وتغليفها لتقديمها لمكتب العمل\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:16:21\', \'2025-11-12 06:16:21\', NULL, NULL, \'2025-11-12 03:16:21\', NULL),
(33, \'2025-10-12\', NULL, \'فيصل مترجم عرعر - سداد رخصة العمل 12 شهور تخصم مناصفه\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:26:55\', \'2025-11-12 06:26:55\', NULL, NULL, \'2025-11-12 03:26:55\', NULL),
(34, \'2025-10-13\', NULL, \'دفعة من مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:31:35\', \'2025-11-12 06:31:35\', NULL, NULL, \'2025-11-12 03:31:35\', NULL),
(35, \'2025-10-14\', NULL, \'عياس العيسي - تحويل مبلغ 35000 المتبقي من مبلغ التقبيل مكتب الامتياز فرع الربوه الإجمالي 70000 ريال\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:47:58\', \'2025-11-12 06:47:58\', NULL, NULL, \'2025-11-12 03:47:58\', NULL),
(36, \'2025-10-14\', NULL, \'مشاعل صالح سفر النفيعي - مطالبه ماليه علي يوزر الإنجاز\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 06:56:05\', \'2025-11-12 06:56:05\', NULL, NULL, \'2025-11-12 03:56:05\', NULL),
(37, \'2025-10-15\', NULL, \'ايراد من العميل عبد الرحمن\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 07:20:25\', \'2025-11-12 07:20:25\', NULL, NULL, \'2025-11-12 04:20:25\', NULL),
(38, \'2025-10-15\', NULL, \'مندوبة الفلبين ANALYN FISHER - ادخال 5عقود للبولو2متميز +2 امتياز+1 انجاز (عبدالله لواص+طلال الرويلي+عبدالله العنزي+هديه الشمري+وليد الديب)\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 07:27:17\', \'2025-11-12 07:27:17\', NULL, NULL, \'2025-11-12 04:27:17\', NULL),
(39, \'2025-10-16\', NULL, \'شحن فيزا رقم 9151\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 07:35:57\', \'2025-11-12 07:35:57\', NULL, NULL, \'2025-11-12 04:35:57\', NULL),
(40, \'2025-10-18\', NULL, \'شحن فيزا رقم 9748\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 07:37:34\', \'2025-11-12 07:37:34\', NULL, NULL, \'2025-11-12 04:37:34\', NULL),
(41, \'2025-10-19\', NULL, \'عهدة فيزا 9151 - شحن\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 15:42:05\', \'2025-11-12 15:42:05\', NULL, NULL, \'2025-11-12 12:42:05\', NULL),
(42, \'2025-10-19\', NULL, \'مؤسسه خيال الزاهر - فك وتركيب زجاج لمكتب الجديد الربوه تعديل مكتب ابوسلطان وغرفة الاجتماعات الإجمالي 2875 تحويل 1500 ريال\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 15:44:18\', \'2025-11-12 15:44:18\', NULL, NULL, \'2025-11-12 12:44:18\', NULL),
(43, \'2025-10-20\', NULL, \'دفعة من مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 15:47:03\', \'2025-11-12 15:47:03\', NULL, NULL, \'2025-11-12 12:47:03\', NULL),
(44, \'2025-10-20\', NULL, \'سداد فاتورة مكتب نيشن سريلانكا\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 16:10:48\', \'2025-11-12 16:10:48\', NULL, NULL, \'2025-11-12 13:10:48\', NULL),
(45, \'2025-10-21\', NULL, \'دفعة من مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 16:37:38\', \'2025-11-12 16:37:38\', NULL, NULL, \'2025-11-12 13:37:38\', NULL),
(46, \'2025-10-21\', NULL, \'ابوفواز - تحويل رسوم استلام عاملات من شركة سلسك الدمام 167 ريال +رسوم المندوب 150 ريال اماني رمضان الظفيري\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 16:50:41\', \'2025-11-12 16:50:41\', NULL, NULL, \'2025-11-12 13:50:41\', NULL),
(47, \'2025-10-22\', NULL, \'دفعة من مساند\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 16:54:40\', \'2025-11-12 16:54:40\', NULL, NULL, \'2025-11-12 13:54:40\', NULL),
(48, \'2025-10-22\', NULL, \'فاطمه عطيه حزيم العنزي - سداد الإقامة - العاملة نقل الي العميل حنان حليس الشمري مسدد 2000 ريال باقي 7000 تم اصدار كمبيالة\', 160, NULL, \'entry\', 1, NULL, 1, \'2025-11-12 17:10:14\', \'2025-11-12 17:10:14\', NULL, NULL, \'2025-11-12 14:10:14\', NULL);');
        DB::statement('SET FOREIGN_KEY_CHECKS=1;');
    }
}
